[
  {
    "section_title": "1. Who is the responsible controller for the data processing and whom you may contact?",
    "section_text": "The party responsible for processing data (“controller”) is: IKEA Möbelvertrieb OHG (“IKEA”)Legal entity: Offene Handelsgesellschaft [General commercial partnership]Registered office: Shopping City Süd, Südring, 2334 VösendorfCompany registration number: FN 316 sCommercial court of registration: Wiener Neustadt Regional CourtVAT ID number: ATU19420008ARA licence No.: 4838 Do not hesitate to contact us at the following address if you have any questions or concerns as to how we process your data, or if you find an error on our website or app:IKEA Kundenservice Österreich(IKEA Customer Service, Austria)2334 Vösendorf-SüdTel.: +43 800 081100E-mail for retail customers: customer.support.at@ikea.comE-mail for business customers: business.support.at@ikea.com Or use our contact forms: General enquiry about processing personal dataBug report concerning our website or iOS/Android app"
  },
  {
    "section_title": "2. What data is being processed and from which sources do these stem from?",
    "section_text": "We process the data that we receive from you in our business relationship. This includes the data you enter when registering with us or when you visit our website at https://www.ikea.com/at/. We also process the data we receive from our contractors and credit agencies, specifically KSV 1870. We will never collect or process special categories of personal data. Personal data includes: Your personal details such as your name, address, e-mail address, phone number, date of birth, and genderInformation on your family status and living conditions such as your marital status, name and date of birth of children, apartment, size, and fittings if specified by you when you register for IKEA FamilyInformation on a company you run such as your industrial specialisation, legal entity, year of establishment, number of employees, ATU and commercial register data if you provide it when registering for IKEA for Business.Information on your IKEA purchases such as your IKEA Family or IKEA for Business number, store, receipt number, date and time of purchase, item, quantity and priceInformation on the payment method you used such as your credit card company and number, name of the credit data owner, period of validity, and CRC number.Visual data with time and location during your visit at one of our IKEA stores if you have been in an area with surveillance."
  },
  {
    "section_title": "3. For which purpose and for how long is the data being processed?",
    "section_text": "We  process your data for specific purposes and for a specific duration according to the data protection laws and legal regulations. Please find below the most important purposes and respective processing periods below. If we collect data from your for purposes which go beyond We will separately inform you of any data we collect from you for purposes that go beyond this when we collect the data:"
  },
  {
    "section_title": "4. On which legal basis is personal data being processed?",
    "section_text": "4.1 On grounds of consent – Art 6 para 1 lit a GDPR: We will only process your personal data according to the purposes specified in the respective declaration of consent and to the extent agreed after you have given us your consent for us to process your data. You may revoke your consent in writing at any time with effect for the future by e-mail or letter to the contact address given in Pt. 1. Revocation of consent shall not affect the lawfulness of processing your data before revocation. 4.2 To fulfil contractual obligations – GDPR Art 6.1 (b): We will process your data in order to fulfil our contractual obligations towards you. For example, we will need your name and address in order to send you the goods you have ordered online and to send you an invoice for your order. As another example, we will need your e-mail address or phone number to contact you if there are difficulties in delivering your order or to respond to any requests or enquiries you may have made. 4.3 To fulfil statutory obligations – GDPR Art 6.1 (c): Statutory obligations may require us to process your data, especially retention of business correspondence and contract documents. These obligations may arise from the following laws, amongst others: Austrian Commercial Code (UGB)Austrian Federal Fiscal Code (BAO)Austrian Civil Code (ABGB) 4.4 To protect legitimate interests – GDPR Art 6.1 (f): We may process your personal data as necessary to safeguard our legitimate interests or the legitimate interests of a third party: As an example, we may need to process your date of birth in order to identify you and avoid confusion with other customers of the same name. This may be necessary to ensure that we have only stored you once in our database.A  legitimateinterest in processing your personal data also applies for our own and third-party marketing purposes, customer loyalty, and direct advertising where legally permissible. As an example, we may process your purchasing data from your IKEA Family membership in order to thank you for your loyalty to IKEA with special offer tokens.We may also process your data from enquiries to customer service to be able to respond to your enquiry or request more quickly and effectively.We also have a  legitimate interest in processing your data for administration purposes within theIKEA Groupand in litigation.We may also process your data with credit agencies to determine your creditworthiness and default risk or to process enquiries or requests you have made towards us.Apart from that, we will also ask you for your opinion on the products you have purchased in our IKEA service ratings and review surveys. This serves our policy of constant improvement in our product range and services, and helps other customers make a decision on their purchases.We will process your MAC address when you use our free IKEA WiFi service in order to provide you with this free service, and also to log users in the event of legal claims or to investigate criminal offences.Data processing from video surveillance serves our  legitimateinterests in protecting our customers, the safety of our co-workers, our products and property, and fulfilling our legal duty of care including gathering and securing evidence, with evaluation only taking place as defined by the purpose of data processing in each specific case. We may therefore process your data on the basis of our  legitimateinterests in addition to your consent as a legal basis, that is, even if you have revoked your consent."
  },
  {
    "section_title": "5. Who will be receiving your data?",
    "section_text": "Your data will be passed on to the following recipients: Contractors such as IT and payment service companies, suppliers, and freight companies that we have commissioned as data processors to the extent that they require your data to perform services that we have ordered from them. These contractors are contractually obliged to treat your data confidentially and only process the data to the extent necessary to provide the services ordered.Our co-workers and other parties in IKEA Möbelvertrieb OHG and the IKEA company group will receive your data that they need to fulfil their respective contractual and statutory obligations or protect our vested interests.If legally required to do so, we will also pass your data on to public bodies and authorities.We may also pass your data on to the following recipients as necessary on a case-by-case basis:- To secure evidence in criminal cases: Law enforcement and courts- For security purposes: Law enforcement- To secure evidence in civil matters: Courts- To process insurance claims: Insurance companies- For law legal purposes: Lawyers, authorities and other authorities."
  },
  {
    "section_title": "6. Are you obliged to provide data?",
    "section_text": "You will need to give us your data for us to be able to fulfil our contractual obligations and provide our optional benefits and or free services for you – your purchases, IKEA for Business or IKEA Family membership, IKEA Family newsletter, or our free WiFi service. This data will include, for example, your name and address for us to deliver your order and send you your invoice. Necessary data entries are marked with an asterisk* on mandatory fields. We will usually not be able to provide the service you have requested, such as a purchase or membership, unless you give us this necessary data. Providing your visual data  is optional but remember that we will need to process your data for the purposes given above if you access areas of our IKEA stores with video surveillance as clearly marked out in the store."
  },
  {
    "section_title": "7. Is there automated decision-making including profiling?",
    "section_text": "We will not use automated decision-making according to Art 22 GDPR in order to establish and maintain business relationships or make other decisions that would significantly affect you in a similar way."
  },
  {
    "section_title": "8. Your rights in processing your personal data",
    "section_text": "You may (i) demand disclosure on whether and what personal information we have stored on you and request copies of your data, (ii) demand correction, supplementation or deletion of your personal data if incorrect or processed so as to violate statutory regulations, (iii) demand that we restrict your personal data from being processed, (iv) object to the use of your personal data for processing or revoke consent you have previously granted, (v) request the data that you have given us in a transferable format, (vi) lodge a complaint to the Austrian data protection authority (www.dsb.gv.at). Contact us via thiscontact formor send us a letter by post using the above contact addresses in order to assert any of the rights stated above."
  }
]