[
  {
    "title": "Article 1 - Data Collection",
    "paragraphs": [
      "You can disable Ads by visitingSettings > Brave Rewards > Adsand turning off the Ads default.In the cases where we collect high-level statistics relating to web activity data (e.g. You can deactivate Privacy-Preserving Product Analytics in Settings.Your feedbackWe collect feedback solely for the purpose of improving our products and services, enhancing your browsing experience, and resolving compatibility issues. We hope youâll find any changes agreeable, but if youâre not comfortable with changes to the info we collect or how we use it, we understand your choice to stop using Brave.ÂPersonal data means any information that relates to an identified or identifiable living individual. In the cases where we collect high-level statistics relating to web activity data (e.g. We collect feedback solely for the purpose of improving our products and services, enhancing your browsing experience, and resolving compatibility issues. We hope youâll find any changes agreeable, but if youâre not comfortable with changes to the info we collect or how we use it, we understand your choice to stop using Brave.Â Personal data means any information that relates to an identified or identifiable living individual."
    ]
  },
  {
    "title": "Article 2 - Data Usage",
    "paragraphs": [
      "The only way a userâs data is stored by Brave is if the user has switched on Rewards or Sync.Read this document to understand how the Brave Browser uses data.To learn how we use data to operate our websites, forums, and communications, visit theWebsite Privacy Policy. To learn how we use data for publishers and creators visit thePublisher Privacy Policyon the Basic Attention Token website.In this policy âweâ, âusâ, etc. On desktop, we use the Safe BrowsingUpdate APIwhich relies on storing URL hashes locally on your device. On Android, we use theSafetyNet Safe Browsing APIwhich sends partial URL hashes directly to Google when a URL is determined to be potentially malicious by the list stored locally on your device, as per the Safe Browsing Update API.If you prefer not to use Safe Browsing, just visitbrave://settings/securityto change your settings to No protection (not recommended). Your IP address will not be stored by Brave, but it may be stored by the website you have visited.See data processing details.Brave RewardsIf you enableBrave Rewards, we assign your Brave browser a âRewards Payment IDâ, which is used to account for Basic Attention Token (BAT) rewards you may earn for seeingBrave Private Ads. See theBrave Rewards data processing tableWhen you make an on-demand contribution to Brave Creators using BAT from your linked custodial account(s), the custodian can see and record the details of your contribution transactions (such as, but not limited to, the amount and the recipient). See theBrave Rewards data processing tablefor details of what data we process and why and for how long.Cookies:As part of the process to connect your Solana address to your Rewards Payment ID, a temporary, security-related cookie will be set in your browser for one of our Rewards-related service domains. The purpose of this cookie is to protect you against cross-site forgery attacks during the connection process. what are the estimated amount of ads that can be served to different content categories that users encounter as they browse the web) we use proven privacy mechanisms like local differential privacy that guarantee that no information about individual users will ever be revealed to us. We use variables such as type of Ad, placement and timing. You should review the privacy notices and terms of service of those third parties.We use Decentralised Exchange Aggregators (DEX) such as0xfor swaps made on EVM compatible blockchains andJupiterfor swaps completed on the Solana blockchain. We use this statistical data to understand at a high level which cryptocurrency assets are being used and on which platforms.Sanctions ComplianceCryptocurrency addresses that are listed on or otherwise associated with theSpecially Designated Nationals and Blocked Persons List(SDN list) are ineligible to participate in any of Braves services. Who you talk to, when, and how, is private to you.See data processing details.Please note that Brave uses the8x8communications platform, and software (API) capabilities of 8x8 (based on theJitsiOpen Source video conferencing software) to help deliver Brave Talk. We use the third-party payment providerStripeto process payments for premium subscriptions. Stripe will process your email address, name, and payment card data for the purpose of managing your subscription payments only. Brave Firewall + VPN is powered byGuardian, and Guardian also provides technical support for Braves Firewall + VPN service.To learn more about what information we use for subscriptionsand whysee our data processing details.Brave LeoBrave Leo is Braves privacy-first AI-powered assistant integrated into the browser. Anthropic acts on our behalf as a data processor for any personal data submitted, but does not use any personal data for its own purposes or to train its AI model. The data cant be used to identify you.We use a service called Backtrace.io to store the reports. We do not sell, trade, or transfer your information to any third parties.See data processing details.Web compatibility reportsIf you submit a Web compatibility report, youll have the option to include certain details to help us analyze and address compatibility issues. A crash report can contain personal information.See data processing details.How to switch this feature off.You can switch off âAutomatically send usage statistics and crash reports to Brave Softwareâ in settings.Tip:Â you can quickly access settings by copyingbrave://settingsÂ into your address bar.These incomplete versions of Brave represent unfinished and untested work on future versions of Brave, and their incomplete behaviour may not be adequately described by this policy. More information about the safety & reliability of pre-release versions of Brave can be found in ourdevelopment documentation.LocationPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo estimate the userâs physical location at the request of a website and with the confirmation of the user.IP address, and information about nearby WiFi access points (MAC address, signal strength, and SSID).Legitimate interest.No storage.Brave RewardsPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo make and verify Basic Attention Token contributions, (including to detect and prevent fraud).IP address at time of claiming a grant of BAT tokens or requesting confirmation tokens.Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Generally stored for 7 days. In case of confirmed fraud, stored for up to 2 years.To make and verify Basic Attention Token contributions, (including to detect and prevent fraud).Rewards Payment ID, declared country code and Custodian ID and custodial country code when verifying a Brave Rewards wallet with a custodial partner.Necessary for the performance of acontract between us, (and necessary to provide the requested service & to provide customer support).Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements.To make and verify Basic Attention Token contributions to a Solana address, (including to detect and prevent fraud).Rewards Payment ID and associated Solana addressNecessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Compliance with legal obligationsThe duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements.Brave NewsPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo collect content from the server in order to display it for the user.IP addresses.Legitimate interest. The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and responseBrave TalkPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo facilitate communications via Brave Talk.IP address, meeting URL, chat content, audio and video, recordings of meetings.Legitimate interest. The processing is necessary to provide the requested service.Duration of the call, except for recordings of meetings that are temporarily stored for 24 hours.To create a Brave Premium account and manage account access.Email addressLegitimate interest.The data is necessary to establish an account and manage account access.Until an account is deleted.Brave Firewall + VPNPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo send an alert to the user when a firewall rule is triggered.Pseudonymous user ID, details of the blocked tracker/firewall rule triggered.Necessary for the performance of the contract (to deliver the service).3 days.To create private connections.IP Address.Necessary for the performance of the contract (to deliver the service).None. IP addresses are not logged.To provide customer support.Email address and other personal data that a user may choose to share when requesting technical support from Guardian.Necessary for the performance of the contract (to deliver the service).12 Months after closing a support ticket.Brave IPFS Public GatewayPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo allow access to IPFS content when the user cannot access it via a local IPFS nodeIP addressLegitimate interest. The user requested the service, and the risk of the processing of the data is minimal.Indefinite. (Protocol Labs)Your feedbackPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest. The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years.Browser testing and research (Nightly, Dev, and Beta versions only)Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the BrowserDevice model, iOS version, language, timezone, CPU architecture, carrier, connection status. We explain this via our product privacy policies and/or contextual privacy notices.Right of access: Where we process personal data about you, you have the right to request a copy of it.Right to delete: When certain grounds apply, you can ask us to delete personal data we are processing about you. Please note, we have a separate global policy for Brave Search results and theright to be forgotten.Right to rectification: You can ask us to correct inaccurate personal data and/or to update incomplete data.Right to restriction: In certain circumstances, you can request that we refrain from processing your personal data.Right to object: In certain circumstances, you can object to the processing of your personal data (for example to object to the use of your data for profiling and/or purely automated decision making). To learn how we use data to operate our websites, forums, and communications, visit theWebsite Privacy Policy. To learn how we use data for publishers and creators visit thePublisher Privacy Policyon the Basic Attention Token website. On desktop, we use the Safe BrowsingUpdate APIwhich relies on storing URL hashes locally on your device. On Android, we use theSafetyNet Safe Browsing APIwhich sends partial URL hashes directly to Google when a URL is determined to be potentially malicious by the list stored locally on your device, as per the Safe Browsing Update API. Your IP address will not be stored by Brave, but it may be stored by the website you have visited.See data processing details. See theBrave Rewards data processing table When you make an on-demand contribution to Brave Creators using BAT from your linked custodial account(s), the custodian can see and record the details of your contribution transactions (such as, but not limited to, the amount and the recipient). See theBrave Rewards data processing tablefor details of what data we process and why and for how long. The purpose of this cookie is to protect you against cross-site forgery attacks during the connection process. what are the estimated amount of ads that can be served to different content categories that users encounter as they browse the web) we use proven privacy mechanisms like local differential privacy that guarantee that no information about individual users will ever be revealed to us. We use variables such as type of Ad, placement and timing. We use Decentralised Exchange Aggregators (DEX) such as0xfor swaps made on EVM compatible blockchains andJupiterfor swaps completed on the Solana blockchain. We use this statistical data to understand at a high level which cryptocurrency assets are being used and on which platforms. Who you talk to, when, and how, is private to you.See data processing details. We use the third-party payment providerStripeto process payments for premium subscriptions. Stripe will process your email address, name, and payment card data for the purpose of managing your subscription payments only. Brave Firewall + VPN is powered byGuardian, and Guardian also provides technical support for Braves Firewall + VPN service.To learn more about what information we use for subscriptionsand whysee our data processing details. Anthropic acts on our behalf as a data processor for any personal data submitted, but does not use any personal data for its own purposes or to train its AI model. We use a service called Backtrace.io to store the reports. We do not sell, trade, or transfer your information to any third parties.See data processing details. A crash report can contain personal information.See data processing details. LocationPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo estimate the userâs physical location at the request of a website and with the confirmation of the user.IP address, and information about nearby WiFi access points (MAC address, signal strength, and SSID).Legitimate interest.No storage.Brave RewardsPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo make and verify Basic Attention Token contributions, (including to detect and prevent fraud).IP address at time of claiming a grant of BAT tokens or requesting confirmation tokens.Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Generally stored for 7 days. In case of confirmed fraud, stored for up to 2 years.To make and verify Basic Attention Token contributions, (including to detect and prevent fraud).Rewards Payment ID, declared country code and Custodian ID and custodial country code when verifying a Brave Rewards wallet with a custodial partner.Necessary for the performance of acontract between us, (and necessary to provide the requested service & to provide customer support).Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements.To make and verify Basic Attention Token contributions to a Solana address, (including to detect and prevent fraud).Rewards Payment ID and associated Solana addressNecessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Compliance with legal obligationsThe duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements.Brave NewsPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo collect content from the server in order to display it for the user.IP addresses.Legitimate interest. The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and responseBrave TalkPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo facilitate communications via Brave Talk.IP address, meeting URL, chat content, audio and video, recordings of meetings.Legitimate interest. The processing is necessary to provide the requested service.Duration of the call, except for recordings of meetings that are temporarily stored for 24 hours.To create a Brave Premium account and manage account access.Email addressLegitimate interest.The data is necessary to establish an account and manage account access.Until an account is deleted.Brave Firewall + VPNPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo send an alert to the user when a firewall rule is triggered.Pseudonymous user ID, details of the blocked tracker/firewall rule triggered.Necessary for the performance of the contract (to deliver the service).3 days.To create private connections.IP Address.Necessary for the performance of the contract (to deliver the service).None. IP addresses are not logged.To provide customer support.Email address and other personal data that a user may choose to share when requesting technical support from Guardian.Necessary for the performance of the contract (to deliver the service).12 Months after closing a support ticket.Brave IPFS Public GatewayPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo allow access to IPFS content when the user cannot access it via a local IPFS nodeIP addressLegitimate interest. The user requested the service, and the risk of the processing of the data is minimal.Indefinite. (Protocol Labs)Your feedbackPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest. The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years.Browser testing and research (Nightly, Dev, and Beta versions only)Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the BrowserDevice model, iOS version, language, timezone, CPU architecture, carrier, connection status. LocationPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo estimate the userâs physical location at the request of a website and with the confirmation of the user.IP address, and information about nearby WiFi access points (MAC address, signal strength, and SSID).Legitimate interest.No storage. Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo estimate the userâs physical location at the request of a website and with the confirmation of the user.IP address, and information about nearby WiFi access points (MAC address, signal strength, and SSID).Legitimate interest.No storage. Purpose of processing Categories of personal data processed Legal basis of processing To estimate the userâs physical location at the request of a website and with the confirmation of the user. Brave RewardsPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo make and verify Basic Attention Token contributions, (including to detect and prevent fraud).IP address at time of claiming a grant of BAT tokens or requesting confirmation tokens.Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Generally stored for 7 days. In case of confirmed fraud, stored for up to 2 years.To make and verify Basic Attention Token contributions, (including to detect and prevent fraud).Rewards Payment ID, declared country code and Custodian ID and custodial country code when verifying a Brave Rewards wallet with a custodial partner.Necessary for the performance of acontract between us, (and necessary to provide the requested service & to provide customer support).Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements.To make and verify Basic Attention Token contributions to a Solana address, (including to detect and prevent fraud).Rewards Payment ID and associated Solana addressNecessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Compliance with legal obligationsThe duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements. Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo make and verify Basic Attention Token contributions, (including to detect and prevent fraud).IP address at time of claiming a grant of BAT tokens or requesting confirmation tokens.Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Generally stored for 7 days. In case of confirmed fraud, stored for up to 2 years.To make and verify Basic Attention Token contributions, (including to detect and prevent fraud).Rewards Payment ID, declared country code and Custodian ID and custodial country code when verifying a Brave Rewards wallet with a custodial partner.Necessary for the performance of acontract between us, (and necessary to provide the requested service & to provide customer support).Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements.To make and verify Basic Attention Token contributions to a Solana address, (including to detect and prevent fraud).Rewards Payment ID and associated Solana addressNecessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Compliance with legal obligationsThe duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements. Purpose of processing Categories of personal data processed Legal basis of processing To make and verify Basic Attention Token contributions, (including to detect and prevent fraud). Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards. Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards. Necessary for the performance of acontract between us, (and necessary to provide the requested service & to provide customer support).Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards. Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards. Rewards Payment ID and associated Solana address Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Compliance with legal obligations Necessary for the performance of acontract between usand necessary to provide the requested service. Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards. Brave NewsPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo collect content from the server in order to display it for the user.IP addresses.Legitimate interest. The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo collect content from the server in order to display it for the user.IP addresses.Legitimate interest. The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processing Categories of personal data processed Legal basis of processing To collect content from the server in order to display it for the user. The data are used in order to deliver the service, and the risk of the processing of the data is minimal. The duration of the request and response Brave TalkPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo facilitate communications via Brave Talk.IP address, meeting URL, chat content, audio and video, recordings of meetings.Legitimate interest. The processing is necessary to provide the requested service.Duration of the call, except for recordings of meetings that are temporarily stored for 24 hours.To create a Brave Premium account and manage account access.Email addressLegitimate interest.The data is necessary to establish an account and manage account access.Until an account is deleted. Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo facilitate communications via Brave Talk.IP address, meeting URL, chat content, audio and video, recordings of meetings.Legitimate interest. The processing is necessary to provide the requested service.Duration of the call, except for recordings of meetings that are temporarily stored for 24 hours.To create a Brave Premium account and manage account access.Email addressLegitimate interest.The data is necessary to establish an account and manage account access.Until an account is deleted. Purpose of processing Categories of personal data processed Legal basis of processing To facilitate communications via Brave Talk. The processing is necessary to provide the requested service. Brave Firewall + VPNPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo send an alert to the user when a firewall rule is triggered.Pseudonymous user ID, details of the blocked tracker/firewall rule triggered.Necessary for the performance of the contract (to deliver the service).3 days.To create private connections.IP Address.Necessary for the performance of the contract (to deliver the service).None. Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo send an alert to the user when a firewall rule is triggered.Pseudonymous user ID, details of the blocked tracker/firewall rule triggered.Necessary for the performance of the contract (to deliver the service).3 days.To create private connections.IP Address.Necessary for the performance of the contract (to deliver the service).None. Purpose of processing Categories of personal data processed Legal basis of processing To send an alert to the user when a firewall rule is triggered. Brave IPFS Public GatewayPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo allow access to IPFS content when the user cannot access it via a local IPFS nodeIP addressLegitimate interest. The user requested the service, and the risk of the processing of the data is minimal.Indefinite. (Protocol Labs) Brave IPFS Public Gateway Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo allow access to IPFS content when the user cannot access it via a local IPFS nodeIP addressLegitimate interest. The user requested the service, and the risk of the processing of the data is minimal.Indefinite. (Protocol Labs) Purpose of processing Categories of personal data processed Legal basis of processing To allow access to IPFS content when the user cannot access it via a local IPFS node Legitimate interest. The user requested the service, and the risk of the processing of the data is minimal. (Protocol Labs) Your feedbackPurpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest. The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years. Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest. The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years. Purpose of processing Categories of personal data processed Legal basis of processing To use feedback sent by users to improve the product. The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal. Browser testing and research (Nightly, Dev, and Beta versions only)Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the BrowserDevice model, iOS version, language, timezone, CPU architecture, carrier, connection status. Browser testing and research (Nightly, Dev, and Beta versions only) Purpose of processingCategories of personal data processedLegal basis of processingDuration of storageTo fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the BrowserDevice model, iOS version, language, timezone, CPU architecture, carrier, connection status. Purpose of processing Categories of personal data processed Legal basis of processing To fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the Browser Device model, iOS version, language, timezone, CPU architecture, carrier, connection status. Right to delete: When certain grounds apply, you can ask us to delete personal data we are processing about you. Right to restriction: In certain circumstances, you can request that we refrain from processing your personal data. Right to object: In certain circumstances, you can object to the processing of your personal data (for example to object to the use of your data for profiling and/or purely automated decision making)."
    ]
  },
  {
    "title": "Article 4 - Data Retention",
    "paragraphs": [
      "Responses generated with Brave-hosted models are discarded after theyre generated, and not used for model training; no personal data is retained by Brave-hosted AI models.Note that some non-Brave hosted models (such as Anthropic) will have different data retention policies. Note that some non-Brave hosted models (such as Anthropic) will have different data retention policies."
    ]
  },
  {
    "title": "Article 5 - User Rights",
    "paragraphs": [
      "We count the number and type of these requests when we receive them to produce aggregate statistics. We proxy these requests through Braves servers to reduce the amount of information sent to Google (for example, we remove your IP address) to protect against Google profiling or tracking you when using Safe Browsing. In certain circumstances, such as when a service is used by default, Brave will proxy the requests to prevent data from being connected to your IP address and does not log this. The proxy removes and does not retain IP addresses before passing the encrypted request to the private content server, which then sends the encrypted reply back to the browser via the proxy. )Brave TranslateBrave removes IP addresses associated with requests submitted to the translation service. Additionally, any text submitted is not retained after the request completes. Leo offers multiple capabilities including chat, webpage summaries, and more.How Leo Works and What Data is ProcessedWhen you use Leo, Brave browser shares with Leos backend server the necessary information to complete your request:For general chat queries: your prompt and conversation contextFor webpage summaries and suggested questions: the content of the page youre viewingFor Tab Focus mode: the titles and origins (not full URLs) of your open non-Private/non-Tor tabsPrivacy ProtectionsBrave Leo includes multiple privacy protections regardless of which feature youre using:Reverse proxy: All requests are proxied through an anonymizing server so that your request and IP address cannot be linked.Immediate discarding of responses: Conversations are not persisted on Braves servers. The data are used in a way that does not negatively affect your rights or interests.Apple retains the data for one year. We do not buy or sell personal data about consumers.Where we process personal data about you (subject to laws such as the EU General Data Protection Regulation (GDPR), or California privacylawssuch as theCCPAor CPRA), you have the following rights:Right to be informed: You have the right to know what personal data we process about you and why, together with information about your rights. Please note that we do not buy or sell personal data about consumers.Right to data portability: In certain circumstances you have the right to request and receive personal data in a structured, commonly used, machine readable format that makes it possible to reuse the data. We count the number and type of these requests when we receive them to produce aggregate statistics. We proxy these requests through Braves servers to reduce the amount of information sent to Google (for example, we remove your IP address) to protect against Google profiling or tracking you when using Safe Browsing. In certain circumstances, such as when a service is used by default, Brave will proxy the requests to prevent data from being connected to your IP address and does not log this. The proxy removes and does not retain IP addresses before passing the encrypted request to the private content server, which then sends the encrypted reply back to the browser via the proxy. Brave removes IP addresses associated with requests submitted to the translation service. Additionally, any text submitted is not retained after the request completes. How Leo Works and What Data is Processed When you use Leo, Brave browser shares with Leos backend server the necessary information to complete your request: For general chat queries: your prompt and conversation context For webpage summaries and suggested questions: the content of the page youre viewing For Tab Focus mode: the titles and origins (not full URLs) of your open non-Private/non-Tor tabs Brave Leo includes multiple privacy protections regardless of which feature youre using: Reverse proxy: All requests are proxied through an anonymizing server so that your request and IP address cannot be linked. The data are used in a way that does not negatively affect your rights or interests.Apple retains the data for one year. IP address at time of claiming a grant of BAT tokens or requesting confirmation tokens. Necessary for the performance of acontract between usand necessary to provide the requested service. Necessary for the performance of acontract between us, (and necessary to provide the requested service & to provide customer support). IP addresses are not logged.To provide customer support.Email address and other personal data that a user may choose to share when requesting technical support from Guardian.Necessary for the performance of the contract (to deliver the service).12 Months after closing a support ticket. IP addresses are not logged.To provide customer support.Email address and other personal data that a user may choose to share when requesting technical support from Guardian.Necessary for the performance of the contract (to deliver the service).12 Months after closing a support ticket. Email address and other personal data that a user may choose to share when requesting technical support from Guardian. The data are used in a way that does not negatively affect your rights or interests.Apple retains the data for one year. The data are used in a way that does not negatively affect your rights or interests.Apple retains the data for one year. The data are used in a way that does not negatively affect your rights or interests. Where we process personal data about you (subject to laws such as the EU General Data Protection Regulation (GDPR), or California privacylawssuch as theCCPAor CPRA), you have the following rights: Right to be informed: You have the right to know what personal data we process about you and why, together with information about your rights. Right of access: Where we process personal data about you, you have the right to request a copy of it. Right to data portability: In certain circumstances you have the right to request and receive personal data in a structured, commonly used, machine readable format that makes it possible to reuse the data."
    ]
  },
  {
    "title": "Article 6 - Security",
    "paragraphs": [
      "refers to Brave Software Inc, while âBraveâ refers to the browser.Security & updatesBrave automatically checks with us for updates. This ensures that you always have access to the latest security fixes. No particular personâs information can be identified in the statistics we produce.You can also update to the latest versionhere.Safe BrowsingThe Brave Browser automatically uses Google Safe Browsing to help protect you against websites, downloads and extensions that are known to be unsafe (such as sites that are fraudulent or that host malware). On Android, open Brave Shields & privacy inside settings and then set the Safe Browsing option to No protection (not recommended).SyncIf you switch on Sync then your bookmarks (and soon passwords and other data) will be saved in an encrypted file on a cloud storage service, to which you will have the only decryption key. This is done in a way that protects end-user privacy - we cannot link data to individuals or their devices and nor can we identify users or their devices from the research.Brave WalletThe Brave Wallet is a secure crypto wallet built directly into the Brave browser. You can also add feeds manually by subscribing directly to publishersâ content using publicly available RSS feeds.To protect your privacy, Brave employs a combination of methods for delivering content that ensure your browser cannot be identified or tracked by Brave or any third party. Additional security options are available to you in the settings menu once you initiate a call. These include:Enable Lobby: This lets you protect your meeting by only allowing people to enter after being approved by a moderator.Add a passcode: This lets you restrict access to the meeting to people who have been provided the code.Enable Video Bridge Encryption (VBE): This is currently experimental. We do this to protect your privacy.Brave Firewall + VPNYou can subscribe to Brave Firewall + VPN in two ways: viaaccount.brave.com, or via the applicable app store for your mobile device (iOS App Store or Google Play Store). Additionally, WDP protects the URLs you send by encrypting them in a manner that prevents Brave from seeing or reading the URL unless it has been sent by a large number of other users.The system is designed so that no data received can be linked back to individuals or their devices. Brave may retain some crash reports indefinitely, if useful for testing.Help with privacy settings in BraveYou can find guides on how to change privacy settings in Bravein the Help Center.Contacting Brave about your personal data and privacy rightsTo contact our data protection officer and privacy team with privacy related enquiries, or to exercise your data protection and privacy rights, emailprivacy@brave.com.Itâs Braveâs policy to not collect personal data1unless itâs necessary to provide services to our users, or to meet certain legal obligations. If youâre in the EU you can contact our nominated representative under the General Data Protection Regulation (GDPR), or you can complain to theIrish Data Protection Commissioner. If youâre in California you can complain to theCalifornia Privacy Protection Agency.For EU residents, we have appointed a nominated representative under theGDPRto act on our behalf regarding GDPR compliance. You may contact our nominated representative if you wish; however, the representative will refer enquiries to Braveâs data protection officer for consideration.Our EU nominated representative is:Brave EU Nominated RepresentativeCare of CastlebridgeNew Work JunctionClonard, WexfordIrelandbrave@gdprnomrep.euWeâll update this policy whenever we make material changes to our practices, and weâll announce it to let you know. This ensures that you always have access to the latest security fixes. The Brave Browser automatically uses Google Safe Browsing to help protect you against websites, downloads and extensions that are known to be unsafe (such as sites that are fraudulent or that host malware). If you prefer not to use Safe Browsing, just visitbrave://settings/securityto change your settings to No protection (not recommended). On Android, open Brave Shields & privacy inside settings and then set the Safe Browsing option to No protection (not recommended). Cookies:As part of the process to connect your Solana address to your Rewards Payment ID, a temporary, security-related cookie will be set in your browser for one of our Rewards-related service domains. This is done in a way that protects end-user privacy - we cannot link data to individuals or their devices and nor can we identify users or their devices from the research. To protect your privacy, Brave employs a combination of methods for delivering content that ensure your browser cannot be identified or tracked by Brave or any third party. Additional security options are available to you in the settings menu once you initiate a call. These include: Enable Lobby: This lets you protect your meeting by only allowing people to enter after being approved by a moderator. We do this to protect your privacy. Additionally, WDP protects the URLs you send by encrypting them in a manner that prevents Brave from seeing or reading the URL unless it has been sent by a large number of other users. Contacting Brave about your personal data and privacy rights To contact our data protection officer and privacy team with privacy related enquiries, or to exercise your data protection and privacy rights, emailprivacy@brave.com. If youâre in the EU you can contact our nominated representative under the General Data Protection Regulation (GDPR), or you can complain to theIrish Data Protection Commissioner. If youâre in California you can complain to theCalifornia Privacy Protection Agency. You may contact our nominated representative if you wish; however, the representative will refer enquiries to Braveâs data protection officer for consideration."
    ]
  },
  {
    "title": "Article 7 - Cookies",
    "paragraphs": [
      "LAST UPDATED April 21, 2025Brave Browser Privacy Policy LAST UPDATED April 21, 2025Brave Browser Privacy Policy LAST UPDATED April 21, 2025 Brave Browser Privacy Policy Our company does not store any record of peopleâs browsing history. The moment the cookie is done playing its role in the connection process, the cookie is immediately cleared from your browser.AdsIf you switch on Brave Rewards we automatically enable Brave Ads. This means you will receive ads in the form of notifications and in-browser sponsored content, and Basic Attention Tokens to reward you for viewing those ads. We will receive anonymized confirmations for ads that you have viewed, but no data that identifies you or that can be linked to you as an individual leaves the Brave browser on your device. You should review the privacy notices and terms of service of those third parties.Brave NewsBrave News is a private, ad-supported content news reader integrated into the Brave browser. The feed of text and images from Brave and from your RSS feeds is temporarily stored on your device, and it is replaced upon starting or refreshing your Brave News session.Display advertising and promoted content is delivered to all browsers within a given country that have turned on and enabled Brave News. The suggestions and your choices are determined on your browser and never leave your device. The Brave browser fetches it without ever hitting Brave servers, and Brave never knows anything about your chosen RSS feeds.Itâs your choice. Your name and email address that you choose to display will be processed and available during the meeting.While communications are encrypted between the Brave browser and Brave Talk servers via transport layer encryption, they are not encrypted on the server during a call, unless you enable Video Bridge Encryption (VBE). Brave does not receive nor have access to your payment method details supplied to Stripe, and we cannot associate an account email address or payment details with your communications on Brave Talk.To avoid scams:For the avoidance of phishing attacks, note that we at Brave will never contact Brave Browser users in a Brave Talk call.We do not authenticate users or their associated avatar images. If you opt in, youâll contribute some anonymous data about searches and web page visits made within the Brave Browser (including pages arrived at via some, but not all, other search engines). Even if you have chosen to send reports in the past, you can turn off future reports insettings.Privacy Preserving Product AnalyticsThe Browser sends us anonymous reports to alert us to product problems and necessary improvements. The report only describes general use of the Browser or other Brave products, such as a general range of how many extensions are installed, a general range of how many tabs are open, and whether features like Shields, Rewards, and Ads are switched on.See the full list of questions here. All submitted data will be deleted from Braves servers after 1 year.Nightly, Dev, and Beta browser versionsNightly,Dev, andBetaversions of the Brave Browser are experimental previews of new Brave Browser versions. They allow us to test new features so that we can find and fix errors before releasing a new version of the Brave Browser. These test versions of the Browser may automatically send crash reports to Brave so that we can identify and fix problems. Read this document to understand how the Brave Browser uses data. refers to Brave Software Inc, while âBraveâ refers to the browser. If you enableBrave Rewards, we assign your Brave browser a âRewards Payment IDâ, which is used to account for Basic Attention Token (BAT) rewards you may earn for seeingBrave Private Ads. The moment the cookie is done playing its role in the connection process, the cookie is immediately cleared from your browser. This means you will receive ads in the form of notifications and in-browser sponsored content, and Basic Attention Tokens to reward you for viewing those ads. We will receive anonymized confirmations for ads that you have viewed, but no data that identifies you or that can be linked to you as an individual leaves the Brave browser on your device. The Brave Wallet is a secure crypto wallet built directly into the Brave browser. Brave News is a private, ad-supported content news reader integrated into the Brave browser. Display advertising and promoted content is delivered to all browsers within a given country that have turned on and enabled Brave News. The suggestions and your choices are determined on your browser and never leave your device. The Brave browser fetches it without ever hitting Brave servers, and Brave never knows anything about your chosen RSS feeds. While communications are encrypted between the Brave browser and Brave Talk servers via transport layer encryption, they are not encrypted on the server during a call, unless you enable Video Bridge Encryption (VBE). To avoid scams:For the avoidance of phishing attacks, note that we at Brave will never contact Brave Browser users in a Brave Talk call. Brave Leo is Braves privacy-first AI-powered assistant integrated into the browser. If you opt in, youâll contribute some anonymous data about searches and web page visits made within the Brave Browser (including pages arrived at via some, but not all, other search engines). Privacy Preserving Product Analytics The Browser sends us anonymous reports to alert us to product problems and necessary improvements. The report only describes general use of the Browser or other Brave products, such as a general range of how many extensions are installed, a general range of how many tabs are open, and whether features like Shields, Rewards, and Ads are switched on.See the full list of questions here. Nightly, Dev, and Beta browser versions Nightly,Dev, andBetaversions of the Brave Browser are experimental previews of new Brave Browser versions. They allow us to test new features so that we can find and fix errors before releasing a new version of the Brave Browser. These test versions of the Browser may automatically send crash reports to Brave so that we can identify and fix problems."
    ]
  },
  {
    "title": "Article 8 - Legal Basis",
    "paragraphs": [
      "More information on each model, rate limits, and defaults can be found in theBrave Leo Help Center.The legal basis relied on to process any personal data submitted is that it is necessary for the legitimate interests of Brave and end users.Web Discovery ProjectThe Web Discovery Project is intended to make Brave Search more relevant and useful for everyone. The legal basis relied on to process any personal data submitted is that it is necessary for the legitimate interests of Brave and end users. For EU residents, we have appointed a nominated representative under theGDPRto act on our behalf regarding GDPR compliance."
    ]
  },
  {
    "title": "Article 9 - International Transfer",
    "paragraphs": [
      "Accordingly, Brave compares cryptographic addresses to the SDN list.The Brave Wallet will not allow transfers to any sanctioned address  it has a built-in copy of the SDN list and does not contact any server to make this determination. The Brave Wallet will not allow transfers to any sanctioned address  it has a built-in copy of the SDN list and does not contact any server to make this determination."
    ]
  },
  {
    "title": "Article 10 - Contact Information",
    "paragraphs": [
      "Note that if you enable VBE but other participants do not, they wonât be able to see or hear you.Please note that if you upgrade to the Brave Talk Premium plan, Brave will require an email address to initially create a premium account, and subsequently to manage your access to the account using anonymous credentials. (Of course, this is a good practice regardless of whether you are using Brave Talk, or email, or any other form of communication. The email you used to create your account is unlinkable to your day-to-day use of Leo, making this a uniquely private credentialing experience.Local StorageIf you have the chat history feature enabled, conversations are encrypted and stored locally on your device. For example, WDP will not send search queries that are very long, including email addresses or long numbers.WDP also records some of the pages you visit, if the URLs pass a series of checks designed to filter out unique or identifying URLs. Any personally identifiable information (PII) you provide, such as your contact details, will be handled with strict confidentiality. These terms are equivalent but not identical.This can include information that can directly identify an individualâsuch as name or email addressâand any other information that may make a person indirectly identifiableâsuch as online identifiers that could be combined with other data to identify an individual, or used on their own to single out individuals and distinguish one person from another with an intent to learn something about them or to take an action towards them. Your name and email address that you choose to display will be processed and available during the meeting. Please note that if you upgrade to the Brave Talk Premium plan, Brave will require an email address to initially create a premium account, and subsequently to manage your access to the account using anonymous credentials. Brave does not receive nor have access to your payment method details supplied to Stripe, and we cannot associate an account email address or payment details with your communications on Brave Talk. (Of course, this is a good practice regardless of whether you are using Brave Talk, or email, or any other form of communication.) The email you used to create your account is unlinkable to your day-to-day use of Leo, making this a uniquely private credentialing experience. For example, WDP will not send search queries that are very long, including email addresses or long numbers. Any personally identifiable information (PII) you provide, such as your contact details, will be handled with strict confidentiality. These terms are equivalent but not identical.This can include information that can directly identify an individualâsuch as name or email addressâand any other information that may make a person indirectly identifiableâsuch as online identifiers that could be combined with other data to identify an individual, or used on their own to single out individuals and distinguish one person from another with an intent to learn something about them or to take an action towards them. These terms are equivalent but not identical.This can include information that can directly identify an individualâsuch as name or email addressâand any other information that may make a person indirectly identifiableâsuch as online identifiers that could be combined with other data to identify an individual, or used on their own to single out individuals and distinguish one person from another with an intent to learn something about them or to take an action towards them. This can include information that can directly identify an individualâsuch as name or email addressâand any other information that may make a person indirectly identifiableâsuch as online identifiers that could be combined with other data to identify an individual, or used on their own to single out individuals and distinguish one person from another with an intent to learn something about them or to take an action towards them."
    ]
  },
  {
    "title": "Article 11 - General",
    "paragraphs": [
      "We donât write any personal data to the blockchain. On iOS, Apple proxies Google Safe Browsing through their own servers. For iOS users in mainland China, Apple may also use the Tencent Safe Browsing service. More details athttps://www.apple.com/legal/privacy/data/en/safari/. On iOS, open Brave Shields & Privacy inside settings and disable Block Dangerous Sites. The data1are entirely inaccessible to Brave and to the cloud storage provider.Learn howto switch on Sync here.Unused Sync chains expire after 12 months and the associated server data is permanently deleted.LocationIf you use Brave to visit a website that wants to determine your location, you will be asked whether you want it to be allowed to know where you are. If you click yes to this message, then the website will be sent an approximation of where you are based on your IP address. We will also ask you to select your country, which we will use to assign a country code to your Rewards Payment ID. The country code helps us ensure Ads are displayed to individuals depending on their country. We will also use the country code to help us prevent fraud. You can find your Rewards Payment ID by navigating to brave://rewards-internals.Even with Brave Rewards enabled and a Rewards Payment ID assigned, we never collect your browsing history or similar information, and we canât derive this information from your contributions to content creators or sites. We alsocannot tell which specific Brave Private Ads youâve seen or interacted with.Note that we record the identifiers mentioned herein on servers located in the United States. We take a range of technical and organisational measures to safeguard personal data.Connecting a custodial accountWhen you choose to connect a custodial account to Brave Rewards using one of our custodial partners such asUphold,Gemini,bitFlyer(Japan only), orZebPay(India only), three things become associated with your Rewards Payment ID: a custodian ID, deposit address(es), and a country code. All three are assigned by the custodial partner. The deposit address allows us to make deposits to your custodial account, while the country code helps us prevent fraud and limit service to users in countries where Brave Rewards is supported. In addition, we also use IP addresses and Rewards Payment IDs associated with monthly BAT payments to safeguard against fraud. This is subject to the privacy policies ofUphold,Gemini,bitFlyer, orZebPay. However, when using theAuto-Contributefeature to support Brave creators with BAT from your custodial account,neither Brave nor your custodian can tell which specific creators youâre contributing to.Connecting a self-custody accountWhen you choose to connect a self-custody account/address (such as a Solana address), your Rewards Payment ID will be associated with your self-custody address. While the categories of ads that you see and when you see them are inferred from your browsing activity, the data are stored on your device and are inaccessible to us. Read more about how we achieve this withPrivacy Preserving Product AnalyticsandPrivate Advertising Analytics. To read more about Brave Ads and privacy have a look at ourFAQ.Brave conducts A/B testing to support research into user engagement with Brave Ads to inform our strategy for choosing and displaying Ads to end-users. You can buy, send, store, and swap thousands of assets (and NFTs) seamlessly on 100+ blockchain networks including Ethereum, Solana, Filecoin, and more. You can learn more about âcrypto walletsâ and the Brave WallethereBrave Wallet relies on third party service providers to help us read and write transactional data from various blockchains including Bitcoin, Ethereum, Solana, and others on a users behalf. To do this we typically need to pass wallet address(s) or transactional data to these service providers in order to help users interact with the blockchain. By enabling Brave Wallet, you consent to relying on these services to interact with the Blockchain when necessary.Brave does not track any of the actions you make in your wallet. We strive to put privacy first:Brave proxies and strips the IP address associated with access to the Brave Wallet.When you make a transaction using a third party that redirects you to their services, such as an on-ramp partner, they will capture your IP address and may conduct identity verification checks in order to meet obligations they have under sanctions and anti-money laundering laws. They will also process your wallet address, related transaction data and your IP address but will ONLY use this data to fulfill the transaction (including getting a quote).We will use anonymized and aggregated statistics from on-ramp partners that include regional volumes of transactions, including daily number of transactions by token/chain; daily $ volume of transactions by token/chain; monthly unique transactions by token/chain. We strive to put privacy first:Brave does not track any of the actions that you make in your wallet.Brave proxies and strips the IP address associated with access to the Brave Wallet.When you make a transaction using a third party that redirects you to their services, such as an on-ramp partner, they will capture your IP address and may conduct identity verification checks in order to meet obligations they have under sanctions and anti-money laundering laws. It provides news content, Brave offers, display advertising, and promoted content. It is off by default.When you turn ON Brave News, a range of content is presented by default. The default content is selected usingBrave Search. You can at any time change the default content settings and choose what content you want appearing in your feed. Headlines are made available on a public CDN in text files, the same file for all users for each region. Some images from publishers and images in the Brave News user interface are processed to improve performance and ensure they display correctly in the Brave News user experience. Processed images are all delivered through a private and encrypted proxy method. All other publisher images are collected directly from the publishers from your device. When you add RSS feeds manually, the text and images are collected directly from the publisher of the RSS feed and included in Brave News on the client. Images from these are served by Brave using its private and encrypted proxy. If you also enable Brave Ads, advertising will be presented based on your interests, as inferred from your browsing behaviour and done on your device. Brave News remains private to you and anonymous.Brave News will offer suggestions of sources you might like to follow. If you choose to follow a suggested source it will be added to your Following list; you can always unfollow a source via the Settings panel. Your Brave News sessions are not logged or saved by Brave. This information is private to you and only you.Braveâs source list,content aggregatorandSuggestions serviceare open source and available to view via GitHub.Please note: The RSS feed content you add is collected directly from the feed source and not proxied by Brave. You can add, follow, unfollow, or hide content sources any time.Brave TalkBrave Talk is a private video and/or audio conference tool. What you say or type in the service is not logged or saved. 8x8 provides a service on behalf of Brave, and we remain responsible for Brave Talk.What information does Brave Talk process?We process the minimum information necessary to provide the Brave Talk service. This includes:Your IP address and the URL of the meeting that will be processed only to enable calls; they are not retained after a call ends.If you use the chat function, chats will be temporarily cached for the duration of the meeting.If you record a meeting that you host, the recording will be temporarily stored on the server for 24 hours to allow you to download it. If you enable VBE, it will disable server side services such as recording, live streaming, and phone participation. Accordingly, you should never share any confidential information with anyone on Brave Talk unless you are certain that you know who you are talking to. We do not collect identifiers that can be linked to you (such as IP address). If you select a model from Anthropic and submit Leo queries, that data will be processed by Anthropic, and retained on Anthropicâs servers for 30 days. Anthropic are also not allowed to share query inputs and outputs, or link them to Brave.Optional features: Features like Tab Focus Mode require explicit opt-in before any data is processed.No login requirement: Users do not need to create a Brave account to use the free version of Leo.Unlinkable subscription: If you sign up for Leo Premium, youâre issued unlinkable tokens that validate your subscription when using Leo. This means that Brave can never connect your purchase details with your usage of the product, an extra step that ensures your activity is private to you and only you. These saved conversations are not persisted on Braves servers and are not used for model training. You can disable conversation storage or clear saved chats through Settings. When you clear your browsing history, any associated webpage content in your chats will also be removed. Chat history is not available in Private Windows or Private Windows with Tor.Important NotesThe accuracy of Leos responses is not guaranteed and may include inaccurate, misleading, and/or false information. You should not submit sensitive or private information to Leo, and should exercise caution with any text related to health, finance, personal safety, or similar cases.Brave Leo is powered by different AI models which you can select, including self-hosted implementations of open-source models, such as Metas Llama models, and models provided by 3rd parties, such as Anthropics Claude models. This data helps build the Brave Search independent index, and ensure we show relevant results to your search queries and support more relevant experiences with Brave products and services.Collection is done in a privacy-preserving fashion. The Web Discovery Project records the terms you search for on some search engines if that search query passes a series of checks, intended to avoid recording or sending sensitive queries. For example, URLs that are too long or include certain terms or long numbers are never sent. For a URL to be sent it needs to be visited independently by a large number of people. All data received is unlinkable, making it impossible to build profiles or sessions of Web Discovery Project contributors.Read a full description of the Web Discovery Project methodology.How we improve BraveDiagnostic reportsWhen Brave crashes or freezes, it creates a report that can be sent to us to help us diagnose and fix whatever caused the problem. This report contains technical information about your computer system and the event causing the problem. You can choose whether to send us these reports. None of the information it reports harms your privacy. These reports are stripped of metadata, and aggregated with measurements reported by many other instances of Brave. The data are not personal, and cannot be combined to identify you. Providing this information is voluntary, and any data you submit will be deleted from Braves servers after 30 days. See ourWeb compatibility reports wiki pagefor more details on what data is collected.Brave Leo feedbackYou can voluntarily submit feedback on Leos responses (Braves privacy-first, AI-powered assistant) by clicking the thumbs-up or thumbs-down icons. This sends the rating, full text of the current conversation, language, selected AI model, version, and Premium subscription status (if any). You also have the option to include additional details and the current website to assist us in improving Leos responses. In cases of suspected fraud, stored for up to 60 days. Optional: Crash log (crash logs will also be sent if you opted-in when activating iOS) Optional: Comments and screenshots you share if you send feedback through TestFlight.Our interest in testing the product and fixing problems. Please note, anonymous data is not subject to this right.Right to lodge a complaint with a regulatory authority: Brave is based in the USA. The authority to lodge a complaint about Brave will depend on where you live. If youâre in the UK you can complain to theInformation Commissionerâs Office. In the USA, this is often referred to as Personal Information (PI) or Personally Identifiable Information (PII). Our company does not store any record of peopleâs browsing history. We donât write any personal data to the blockchain. The only way a userâs data is stored by Brave is if the user has switched on Rewards or Sync. Our company does not store any record of peopleâs browsing history. We donât write any personal data to the blockchain. The only way a userâs data is stored by Brave is if the user has switched on Rewards or Sync. In this policy âweâ, âusâ, etc. Brave automatically checks with us for updates. No particular personâs information can be identified in the statistics we produce. You can also update to the latest versionhere. On iOS, Apple proxies Google Safe Browsing through their own servers. For iOS users in mainland China, Apple may also use the Tencent Safe Browsing service. More details athttps://www.apple.com/legal/privacy/data/en/safari/. On iOS, open Brave Shields & Privacy inside settings and disable Block Dangerous Sites. If you switch on Sync then your bookmarks (and soon passwords and other data) will be saved in an encrypted file on a cloud storage service, to which you will have the only decryption key. The data1are entirely inaccessible to Brave and to the cloud storage provider.Learn howto switch on Sync here. Unused Sync chains expire after 12 months and the associated server data is permanently deleted. If you use Brave to visit a website that wants to determine your location, you will be asked whether you want it to be allowed to know where you are. If you click yes to this message, then the website will be sent an approximation of where you are based on your IP address. We will also ask you to select your country, which we will use to assign a country code to your Rewards Payment ID. The country code helps us ensure Ads are displayed to individuals depending on their country. We will also use the country code to help us prevent fraud. You can find your Rewards Payment ID by navigating to brave://rewards-internals. Even with Brave Rewards enabled and a Rewards Payment ID assigned, we never collect your browsing history or similar information, and we canât derive this information from your contributions to content creators or sites. We alsocannot tell which specific Brave Private Ads youâve seen or interacted with. Note that we record the identifiers mentioned herein on servers located in the United States. We take a range of technical and organisational measures to safeguard personal data. Connecting a custodial account When you choose to connect a custodial account to Brave Rewards using one of our custodial partners such asUphold,Gemini,bitFlyer(Japan only), orZebPay(India only), three things become associated with your Rewards Payment ID: a custodian ID, deposit address(es), and a country code. All three are assigned by the custodial partner. The deposit address allows us to make deposits to your custodial account, while the country code helps us prevent fraud and limit service to users in countries where Brave Rewards is supported. In addition, we also use IP addresses and Rewards Payment IDs associated with monthly BAT payments to safeguard against fraud. This is subject to the privacy policies ofUphold,Gemini,bitFlyer, orZebPay. However, when using theAuto-Contributefeature to support Brave creators with BAT from your custodial account,neither Brave nor your custodian can tell which specific creators youâre contributing to. Connecting a self-custody account When you choose to connect a self-custody account/address (such as a Solana address), your Rewards Payment ID will be associated with your self-custody address. If you switch on Brave Rewards we automatically enable Brave Ads. While the categories of ads that you see and when you see them are inferred from your browsing activity, the data are stored on your device and are inaccessible to us. You can disable Ads by visitingSettings > Brave Rewards > Adsand turning off the Ads default. Read more about how we achieve this withPrivacy Preserving Product AnalyticsandPrivate Advertising Analytics. To read more about Brave Ads and privacy have a look at ourFAQ. Brave conducts A/B testing to support research into user engagement with Brave Ads to inform our strategy for choosing and displaying Ads to end-users. You can buy, send, store, and swap thousands of assets (and NFTs) seamlessly on 100+ blockchain networks including Ethereum, Solana, Filecoin, and more. You can learn more about âcrypto walletsâ and the Brave Wallethere Brave Wallet relies on third party service providers to help us read and write transactional data from various blockchains including Bitcoin, Ethereum, Solana, and others on a users behalf. To do this we typically need to pass wallet address(s) or transactional data to these service providers in order to help users interact with the blockchain. By enabling Brave Wallet, you consent to relying on these services to interact with the Blockchain when necessary. Brave does not track any of the actions you make in your wallet. We strive to put privacy first: Brave proxies and strips the IP address associated with access to the Brave Wallet. When you make a transaction using a third party that redirects you to their services, such as an on-ramp partner, they will capture your IP address and may conduct identity verification checks in order to meet obligations they have under sanctions and anti-money laundering laws. You should review the privacy notices and terms of service of those third parties. They will also process your wallet address, related transaction data and your IP address but will ONLY use this data to fulfill the transaction (including getting a quote). We will use anonymized and aggregated statistics from on-ramp partners that include regional volumes of transactions, including daily number of transactions by token/chain; daily $ volume of transactions by token/chain; monthly unique transactions by token/chain. Cryptocurrency addresses that are listed on or otherwise associated with theSpecially Designated Nationals and Blocked Persons List(SDN list) are ineligible to participate in any of Braves services. Accordingly, Brave compares cryptographic addresses to the SDN list. We strive to put privacy first: Brave does not track any of the actions that you make in your wallet. Brave proxies and strips the IP address associated with access to the Brave Wallet. When you make a transaction using a third party that redirects you to their services, such as an on-ramp partner, they will capture your IP address and may conduct identity verification checks in order to meet obligations they have under sanctions and anti-money laundering laws. You should review the privacy notices and terms of service of those third parties. It provides news content, Brave offers, display advertising, and promoted content. It is off by default. When you turn ON Brave News, a range of content is presented by default. The default content is selected usingBrave Search. You can at any time change the default content settings and choose what content you want appearing in your feed. You can also add feeds manually by subscribing directly to publishersâ content using publicly available RSS feeds. Headlines are made available on a public CDN in text files, the same file for all users for each region. Some images from publishers and images in the Brave News user interface are processed to improve performance and ensure they display correctly in the Brave News user experience. Processed images are all delivered through a private and encrypted proxy method. All other publisher images are collected directly from the publishers from your device. When you add RSS feeds manually, the text and images are collected directly from the publisher of the RSS feed and included in Brave News on the client. The feed of text and images from Brave and from your RSS feeds is temporarily stored on your device, and it is replaced upon starting or refreshing your Brave News session. Images from these are served by Brave using its private and encrypted proxy. If you also enable Brave Ads, advertising will be presented based on your interests, as inferred from your browsing behaviour and done on your device. Brave News remains private to you and anonymous. Brave News will offer suggestions of sources you might like to follow. If you choose to follow a suggested source it will be added to your Following list; you can always unfollow a source via the Settings panel. Your Brave News sessions are not logged or saved by Brave. This information is private to you and only you. Braveâs source list,content aggregatorandSuggestions serviceare open source and available to view via GitHub. Please note: The RSS feed content you add is collected directly from the feed source and not proxied by Brave. You can add, follow, unfollow, or hide content sources any time. Brave Talk is a private video and/or audio conference tool. What you say or type in the service is not logged or saved. Please note that Brave uses the8x8communications platform, and software (API) capabilities of 8x8 (based on theJitsiOpen Source video conferencing software) to help deliver Brave Talk. 8x8 provides a service on behalf of Brave, and we remain responsible for Brave Talk. What information does Brave Talk process? We process the minimum information necessary to provide the Brave Talk service. This includes: Your IP address and the URL of the meeting that will be processed only to enable calls; they are not retained after a call ends. If you use the chat function, chats will be temporarily cached for the duration of the meeting. If you record a meeting that you host, the recording will be temporarily stored on the server for 24 hours to allow you to download it. Add a passcode: This lets you restrict access to the meeting to people who have been provided the code. Enable Video Bridge Encryption (VBE): This is currently experimental. If you enable VBE, it will disable server side services such as recording, live streaming, and phone participation. Note that if you enable VBE but other participants do not, they wonât be able to see or hear you. We do not authenticate users or their associated avatar images. Accordingly, you should never share any confidential information with anyone on Brave Talk unless you are certain that you know who you are talking to. You can subscribe to Brave Firewall + VPN in two ways: viaaccount.brave.com, or via the applicable app store for your mobile device (iOS App Store or Google Play Store). Leo offers multiple capabilities including chat, webpage summaries, and more. Immediate discarding of responses: Conversations are not persisted on Braves servers. We do not collect identifiers that can be linked to you (such as IP address). Responses generated with Brave-hosted models are discarded after theyre generated, and not used for model training; no personal data is retained by Brave-hosted AI models. If you select a model from Anthropic and submit Leo queries, that data will be processed by Anthropic, and retained on Anthropicâs servers for 30 days. Anthropic are also not allowed to share query inputs and outputs, or link them to Brave. Optional features: Features like Tab Focus Mode require explicit opt-in before any data is processed. No login requirement: Users do not need to create a Brave account to use the free version of Leo. Unlinkable subscription: If you sign up for Leo Premium, youâre issued unlinkable tokens that validate your subscription when using Leo. This means that Brave can never connect your purchase details with your usage of the product, an extra step that ensures your activity is private to you and only you. If you have the chat history feature enabled, conversations are encrypted and stored locally on your device. These saved conversations are not persisted on Braves servers and are not used for model training. You can disable conversation storage or clear saved chats through Settings. When you clear your browsing history, any associated webpage content in your chats will also be removed. Chat history is not available in Private Windows or Private Windows with Tor. The accuracy of Leos responses is not guaranteed and may include inaccurate, misleading, and/or false information. You should not submit sensitive or private information to Leo, and should exercise caution with any text related to health, finance, personal safety, or similar cases. Brave Leo is powered by different AI models which you can select, including self-hosted implementations of open-source models, such as Metas Llama models, and models provided by 3rd parties, such as Anthropics Claude models. More information on each model, rate limits, and defaults can be found in theBrave Leo Help Center. Web Discovery Project The Web Discovery Project is intended to make Brave Search more relevant and useful for everyone. This data helps build the Brave Search independent index, and ensure we show relevant results to your search queries and support more relevant experiences with Brave products and services. Collection is done in a privacy-preserving fashion. The Web Discovery Project records the terms you search for on some search engines if that search query passes a series of checks, intended to avoid recording or sending sensitive queries. WDP also records some of the pages you visit, if the URLs pass a series of checks designed to filter out unique or identifying URLs. For example, URLs that are too long or include certain terms or long numbers are never sent. The system is designed so that no data received can be linked back to individuals or their devices. For a URL to be sent it needs to be visited independently by a large number of people. All data received is unlinkable, making it impossible to build profiles or sessions of Web Discovery Project contributors. Read a full description of the Web Discovery Project methodology. When Brave crashes or freezes, it creates a report that can be sent to us to help us diagnose and fix whatever caused the problem. This report contains technical information about your computer system and the event causing the problem. The data cant be used to identify you. You can choose whether to send us these reports. Even if you have chosen to send reports in the past, you can turn off future reports insettings. None of the information it reports harms your privacy. These reports are stripped of metadata, and aggregated with measurements reported by many other instances of Brave. The data are not personal, and cannot be combined to identify you. You can deactivate Privacy-Preserving Product Analytics in Settings. Web compatibility reports If you submit a Web compatibility report, youll have the option to include certain details to help us analyze and address compatibility issues. Providing this information is voluntary, and any data you submit will be deleted from Braves servers after 30 days. See ourWeb compatibility reports wiki pagefor more details on what data is collected. You can voluntarily submit feedback on Leos responses (Braves privacy-first, AI-powered assistant) by clicking the thumbs-up or thumbs-down icons. This sends the rating, full text of the current conversation, language, selected AI model, version, and Premium subscription status (if any). You also have the option to include additional details and the current website to assist us in improving Leos responses. All submitted data will be deleted from Braves servers after 1 year. How to switch this feature off.You can switch off âAutomatically send usage statistics and crash reports to Brave Softwareâ in settings. Tip:Â you can quickly access settings by copyingbrave://settingsÂ into your address bar. These incomplete versions of Brave represent unfinished and untested work on future versions of Brave, and their incomplete behaviour may not be adequately described by this policy. More information about the safety & reliability of pre-release versions of Brave can be found in ourdevelopment documentation. In cases of suspected fraud, stored for up to 60 days. Optional: Crash log (crash logs will also be sent if you opted-in when activating iOS) Optional: Comments and screenshots you share if you send feedback through TestFlight.Our interest in testing the product and fixing problems. Brave may retain some crash reports indefinitely, if useful for testing. IP address, and information about nearby WiFi access points (MAC address, signal strength, and SSID). In cases of suspected fraud, stored for up to 60 days. In cases of suspected fraud, stored for up to 60 days. Generally stored for 7 days. In cases of suspected fraud, stored for up to 60 days. In case of confirmed fraud, stored for up to 2 years. To make and verify Basic Attention Token contributions, (including to detect and prevent fraud). Rewards Payment ID, declared country code and Custodian ID and custodial country code when verifying a Brave Rewards wallet with a custodial partner. The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements. To make and verify Basic Attention Token contributions to a Solana address, (including to detect and prevent fraud). Compliance with legal obligations The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements. IP address, meeting URL, chat content, audio and video, recordings of meetings. Duration of the call, except for recordings of meetings that are temporarily stored for 24 hours. To create a Brave Premium account and manage account access. Legitimate interest.The data is necessary to establish an account and manage account access. The data is necessary to establish an account and manage account access. Until an account is deleted. Pseudonymous user ID, details of the blocked tracker/firewall rule triggered. Necessary for the performance of the contract (to deliver the service). To create private connections. Necessary for the performance of the contract (to deliver the service). IP addresses are not logged. To provide customer support. Necessary for the performance of the contract (to deliver the service). 12 Months after closing a support ticket. Personal data that a user may include in the text they write when sending feedback through an app store or any other means. Optional: Crash log (crash logs will also be sent if you opted-in when activating iOS) Optional: Comments and screenshots you share if you send feedback through TestFlight.Our interest in testing the product and fixing problems. Brave may retain some crash reports indefinitely, if useful for testing. Optional: Crash log (crash logs will also be sent if you opted-in when activating iOS) Optional: Comments and screenshots you share if you send feedback through TestFlight.Our interest in testing the product and fixing problems. Brave may retain some crash reports indefinitely, if useful for testing. Optional: Crash log (crash logs will also be sent if you opted-in when activating iOS) Optional: Comments and screenshots you share if you send feedback through TestFlight. Our interest in testing the product and fixing problems. Apple retains the data for one year. Brave may retain some crash reports indefinitely, if useful for testing. Help with privacy settings in Brave You can find guides on how to change privacy settings in Bravein the Help Center. Itâs Braveâs policy to not collect personal data1unless itâs necessary to provide services to our users, or to meet certain legal obligations. We do not buy or sell personal data about consumers. We explain this via our product privacy policies and/or contextual privacy notices. Please note, we have a separate global policy for Brave Search results and theright to be forgotten. Right to rectification: You can ask us to correct inaccurate personal data and/or to update incomplete data. Please note that we do not buy or sell personal data about consumers. Please note, anonymous data is not subject to this right. Right to lodge a complaint with a regulatory authority: Brave is based in the USA. The authority to lodge a complaint about Brave will depend on where you live. If youâre in the UK you can complain to theInformation Commissionerâs Office. Our EU nominated representative is: Brave EU Nominated RepresentativeCare of CastlebridgeNew Work JunctionClonard, WexfordIreland Weâll update this policy whenever we make material changes to our practices, and weâll announce it to let you know. In the USA, this is often referred to as Personal Information (PI) or Personally Identifiable Information (PII). Personal data means any information that relates to an identified or identifiable living individual. In the USA, this is often referred to as Personal Information (PI) or Personally Identifiable Information (PII). Personal data means any information that relates to an identified or identifiable living individual. In the USA, this is often referred to as Personal Information (PI) or Personally Identifiable Information (PII). These terms are equivalent but not identical."
    ]
  }
]