[
  {
    "title": "Article 1 - Data Collection",
    "paragraphs": [
      "Note that other Firefox features may integrate third-party AI models, as further detailed in this Notice.More details, including how to adjust your data settings:You can read more detailed information about the information we collect forDesktop,AndroidoriOS. On Desktop and Android if you opt in to sending us crash reports automatically, we collect this information without prompting you each time; on iOS, crash reports contain less information and are sent automatically to us by default. As part of our work to improve privacy and security for all internet users, we collect technical data viaOHTTP, to better understand, prevent and defend against fingerprinting.Forsome Firefox users, Firefox routes DNS requests to a resolver service that has agreed to Mozillasstrict privacy standards for resolvers. Because we are a global company, in order to provide the services outlined in this Privacy Notice, the information we collect may be accessed from locations where our people are located and data may also be transferred to other jurisdictions as a result of sharing data with our partners. This could include categories of browsing data (travel, shopping, social media), top level domains (example.com) or specific web pages visited.Browsing category, Top Level Domains (TLDs), specific URLs.Search dataThis is data about the search category, search keywords or search query of terms searched for.Search category (Food, Travel), keywords (Boston), search term (current weather in Boston).ContentWhen you provide it to us, we may process data such as uploaded images or survey responses.Uploaded image, bookmarks, comments, survey responses.Contact dataWhen you provide it to us, we may process data about how to contact you.Email address, phone number.Lawful BasesWhat we use your data forWhat data we processOur lawful basisMore information, including choosing how you want to share this data in FirefoxTo provide you with the Firefox browserTechnical dataLocationLanguage preferenceSettings dataUnique identifiersInteraction dataContractto provide you with the necessary functionality for Firefox to operate.Legitimate interestin providing additional functionality, accessibility services and a more personalized experience.You can read more detailed information about the information we collect forDesktop,AndroidoriOS. Note that other Firefox features may integrate third-party AI models, as further detailed in this Notice.More details, including how to adjust your data settings:You can read more detailed information about the information we collect forDesktop,AndroidoriOS. On Desktop and Android if you opt in to sending us crash reports automatically, we collect this information without prompting you each time; on iOS, crash reports contain less information and are sent automatically to us by default. As part of our work to improve privacy and security for all internet users, we collect technical data viaOHTTP, to better understand, prevent and defend against fingerprinting.Forsome Firefox users, Firefox routes DNS requests to a resolver service that has agreed to Mozillasstrict privacy standards for resolvers. Note that other Firefox features may integrate third-party AI models, as further detailed in this Notice.More details, including how to adjust your data settings:You can read more detailed information about the information we collect forDesktop,AndroidoriOS. More details, including how to adjust your data settings:You can read more detailed information about the information we collect forDesktop,AndroidoriOS. More details, including how to adjust your data settings: You can read more detailed information about the information we collect forDesktop,AndroidoriOS. On Desktop and Android if you opt in to sending us crash reports automatically, we collect this information without prompting you each time; on iOS, crash reports contain less information and are sent automatically to us by default. On Desktop and Android if you opt in to sending us crash reports automatically, we collect this information without prompting you each time; on iOS, crash reports contain less information and are sent automatically to us by default. As part of our work to improve privacy and security for all internet users, we collect technical data viaOHTTP, to better understand, prevent and defend against fingerprinting.Forsome Firefox users, Firefox routes DNS requests to a resolver service that has agreed to Mozillasstrict privacy standards for resolvers. As part of our work to improve privacy and security for all internet users, we collect technical data viaOHTTP, to better understand, prevent and defend against fingerprinting. Because we are a global company, in order to provide the services outlined in this Privacy Notice, the information we collect may be accessed from locations where our people are located and data may also be transferred to other jurisdictions as a result of sharing data with our partners. Because we are a global company, in order to provide the services outlined in this Privacy Notice, the information we collect may be accessed from locations where our people are located and data may also be transferred to other jurisdictions as a result of sharing data with our partners. Lawful BasesWhat we use your data forWhat data we processOur lawful basisMore information, including choosing how you want to share this data in FirefoxTo provide you with the Firefox browserTechnical dataLocationLanguage preferenceSettings dataUnique identifiersInteraction dataContractto provide you with the necessary functionality for Firefox to operate.Legitimate interestin providing additional functionality, accessibility services and a more personalized experience.You can read more detailed information about the information we collect forDesktop,AndroidoriOS. You can read more detailed information about the information we collect forDesktop,AndroidoriOS."
    ]
  },
  {
    "title": "Article 2 - Data Usage",
    "paragraphs": [
      "In this Privacy Notice, we explain what data we process, how we process it, and for what purposes. In this Privacy Notice, we explain what data we process, how we process it, and for what purposes. These operate locally  web page content, PDFs, images and tab URLs stay on your device and are not sent to Mozillas servers or used for training purposes without your explicit consent. You can remove this functionality at any time by turning off Sponsored Suggestions  more information on how to do this is available in the relevantFirefox Supportpage.You may be able to opt into an enhanced search experience, which will result in Mozilla processing additional personal data, including your technical data, location and search data. See our Data and Firefox Suggestblog postfor more details.More details, including how to adjust your data settings:You can update yourSearch settingsandSearch suggestion features, at any time, and learn more about how wecategorize searches.To serve relevant content and advertising on Firefox New TabWe use technical data, language preference, and location to serve content and advertising on the Firefox New Tab page in the correct format (i.e. You can opt out of having your data processed for personalization or advertising purposes by turning off technical and interaction data onDesktopandMobileat any time.To provide Mozilla accountsIf you sign up for a Mozilla account, we process additional information alongside the data set out in this Notice, such as account details, contact information and sync data, in accordance with theMozilla Accounts Privacy Notice.To provide AI ChatbotsYou have the option to use a third-party AI chatbot of your choice to help you with things like summarizing what youre reading, writing and brainstorming ideas, subject to that providersterms of use and privacy notice.If you choose to enable a chatbot in the sidebar and/or through a shortcut, Mozilla does not have access to your conversations or the underlying content you input into the selected chatbot. For this we use technical, location and settings data, as well as interaction and system performance data (such as number of tabs open, memory usage or the outcome of automated processes like updates). In the rare situations where the information needed also includes limited browsing data (e.g., Top Level Domain annotations for page-load performance monitoring), it will be transmitted using OHTTP; this helps prevent Mozilla from linking you or your device to the data collected for this purpose.On Desktop and Android, if Firefox encounters an unexpected issue, theMozilla Crash Reporterwill also ask if you wish to send us additional information, which may include sites that were open at the time of the crash and other browsing data. In addition to these standard processes, we useGoogles Safe Browsing Serviceto protect you from malicious downloads and phishing attacks, and validate web page and technical data withCertificate Authorities. System logs of your DNS requests are deleted from the service within 24 hours and are only used for the purpose of DNS resolution.Learn moreabout DNS over HTTPS.More details, including how to adjust your data settings:Upgrades and add-ons blocklist,Googles Safe Browsing Service,OHTTP,To understand usage of FirefoxWe processdatato better understand how you engage with our services, such as how much you use Firefox, your language preference, how often you use our search tools or interact with search suggestions, how fast pages load for you and how many ads orCAPTCHAsyou see. We use technology that is appropriate to the circumstances, including identifier removal, OHTTP, or DAP  these help prevent data from being linked to you. In some cases, we may share or publish aggregated and anonymized data to facilitate research or as part of the lawful business purposes outlined above (such as sharing aggregated insights with advertising partners).To communicate with youDepending on your settings (and whether or not you have a Mozilla account), we may communicate with you via in-product messaging, send you communications (including marketing-related communications), or ask you to participate in research / surveys, or respond to customer support communications. When you send us personal data via these methods, we will use the information only for the purpose you provided it. We also process interaction data related to these communications to better understand who has received our service-related announcements (such as new features, updates or security alerts).To comply with applicable laws, and identify and prevent harmful, unauthorized or illegal activityWe may also be required to process your personal data to comply with applicable laws and protection purposes, such as:Responding tolawful requestsand complying withlegal processes, such as responding to subpoenas, investigations, or requests from government authorities. Mozilla requires a valid Legal Process to compel the disclosure of Specific User data to a government.Responding to requests to exercise privacy rights, such as your right to access or delete your personal data.Identifying, investigating and addressing potential fraudulent activities, or other harmful activities such as illegal activities, cyberattacks or intellectual property infringement (including filing or defending legal claims).Performing internal compliance and security activities, such as audits and enterprise security management.How is your data shared?To provide our services as described above, we may disclose personal data to:Partners, service providers, suppliers and contractorsTo perform the purposes listed above, we work with partners, service providers, suppliers and contractors. We may also need to disclose personal data as part of a corporate transaction, such as a merger, acquisition, sale of assets or similar transaction.How long is your data kept?We only retain your personal data for as long as necessary to fulfill the purposes outlined in this Privacy Notice. In general, we do not retain personal data for more than 25 months, but actual retention periods may vary depending on the type of data and the purpose(s) for which it was collected (for example, we retain your first seen date for the period of your use of Firefox, so we know how long youve been a Firefox user). Once the retention period expires we securely delete your data, unless otherwise required by law.Our services also use encrypted backup storage as another layer of protection to help recover from potential disasters; data in these environments is put beyond use and only processed for business continuity purposes. )Request a copy of the data we have about youRequest portability of your dataRequest correction of any data we hold about you that is inaccurate or incompleteHave personal data we hold about you deleted (in certain circumstances)In some cases, restrict or object to how we use your personal dataComplain to your relevant data protection authority if you have concerns about how were handling your personal data. You can opt out of having your data processed for personalization or advertising purposes by turning off technical and interaction data onDesktopandMobileat any time.To provide Mozilla AccountsSee ourMozilla Accounts Privacy NoticeTo provide AI ChatbotsTechnical dataLocationSettings dataUnique identifiersInteraction dataConsent, when you choose to enable an AI Chatbot.You can read more about how tomanageorremoveAI chatbots in Firefox.To provide Review Checker, including serving sponsored contentTechnical dataSettings dataUnique identifiersInteraction dataBrowsing dataConsent, when you choose to enable Review Checker.You can read more information aboutHow to use Firefox Review Checkerand how we implement privacy preserving tech such asOHTTP.To enable add-ons (addons.mozilla.org, AMO), including offering personalized suggestionsTechnical dataLocationSettings dataUnique identifiersInteraction dataSearch dataLegitimate interestin providing and understanding usage of the AMO infrastructure, including reviewing add-ons and blocking those known to cause security, stability or performance issues.Consent, when you choose to enable a specific Mozilla provided add-on. These operate locally  web page content, PDFs, images and tab URLs stay on your device and are not sent to Mozillas servers or used for training purposes without your explicit consent. You can remove this functionality at any time by turning off Sponsored Suggestions  more information on how to do this is available in the relevantFirefox Supportpage.You may be able to opt into an enhanced search experience, which will result in Mozilla processing additional personal data, including your technical data, location and search data. See our Data and Firefox Suggestblog postfor more details.More details, including how to adjust your data settings:You can update yourSearch settingsandSearch suggestion features, at any time, and learn more about how wecategorize searches.To serve relevant content and advertising on Firefox New TabWe use technical data, language preference, and location to serve content and advertising on the Firefox New Tab page in the correct format (i.e. You can opt out of having your data processed for personalization or advertising purposes by turning off technical and interaction data onDesktopandMobileat any time.To provide Mozilla accountsIf you sign up for a Mozilla account, we process additional information alongside the data set out in this Notice, such as account details, contact information and sync data, in accordance with theMozilla Accounts Privacy Notice.To provide AI ChatbotsYou have the option to use a third-party AI chatbot of your choice to help you with things like summarizing what youre reading, writing and brainstorming ideas, subject to that providersterms of use and privacy notice.If you choose to enable a chatbot in the sidebar and/or through a shortcut, Mozilla does not have access to your conversations or the underlying content you input into the selected chatbot. For this we use technical, location and settings data, as well as interaction and system performance data (such as number of tabs open, memory usage or the outcome of automated processes like updates). In the rare situations where the information needed also includes limited browsing data (e.g., Top Level Domain annotations for page-load performance monitoring), it will be transmitted using OHTTP; this helps prevent Mozilla from linking you or your device to the data collected for this purpose.On Desktop and Android, if Firefox encounters an unexpected issue, theMozilla Crash Reporterwill also ask if you wish to send us additional information, which may include sites that were open at the time of the crash and other browsing data. In addition to these standard processes, we useGoogles Safe Browsing Serviceto protect you from malicious downloads and phishing attacks, and validate web page and technical data withCertificate Authorities. System logs of your DNS requests are deleted from the service within 24 hours and are only used for the purpose of DNS resolution.Learn moreabout DNS over HTTPS.More details, including how to adjust your data settings:Upgrades and add-ons blocklist,Googles Safe Browsing Service,OHTTP,To understand usage of FirefoxWe processdatato better understand how you engage with our services, such as how much you use Firefox, your language preference, how often you use our search tools or interact with search suggestions, how fast pages load for you and how many ads orCAPTCHAsyou see. We use technology that is appropriate to the circumstances, including identifier removal, OHTTP, or DAP  these help prevent data from being linked to you. In some cases, we may share or publish aggregated and anonymized data to facilitate research or as part of the lawful business purposes outlined above (such as sharing aggregated insights with advertising partners).To communicate with youDepending on your settings (and whether or not you have a Mozilla account), we may communicate with you via in-product messaging, send you communications (including marketing-related communications), or ask you to participate in research / surveys, or respond to customer support communications. When you send us personal data via these methods, we will use the information only for the purpose you provided it. We also process interaction data related to these communications to better understand who has received our service-related announcements (such as new features, updates or security alerts).To comply with applicable laws, and identify and prevent harmful, unauthorized or illegal activityWe may also be required to process your personal data to comply with applicable laws and protection purposes, such as:Responding tolawful requestsand complying withlegal processes, such as responding to subpoenas, investigations, or requests from government authorities. These operate locally  web page content, PDFs, images and tab URLs stay on your device and are not sent to Mozillas servers or used for training purposes without your explicit consent. These operate locally  web page content, PDFs, images and tab URLs stay on your device and are not sent to Mozillas servers or used for training purposes without your explicit consent. You can remove this functionality at any time by turning off Sponsored Suggestions  more information on how to do this is available in the relevantFirefox Supportpage.You may be able to opt into an enhanced search experience, which will result in Mozilla processing additional personal data, including your technical data, location and search data. You may be able to opt into an enhanced search experience, which will result in Mozilla processing additional personal data, including your technical data, location and search data. To serve relevant content and advertising on Firefox New TabWe use technical data, language preference, and location to serve content and advertising on the Firefox New Tab page in the correct format (i.e. You can opt out of having your data processed for personalization or advertising purposes by turning off technical and interaction data onDesktopandMobileat any time. To serve relevant content and advertising on Firefox New Tab We use technical data, language preference, and location to serve content and advertising on the Firefox New Tab page in the correct format (i.e. You can opt out of having your data processed for personalization or advertising purposes by turning off technical and interaction data onDesktopandMobileat any time. You can opt out of having your data processed for personalization or advertising purposes by turning off technical and interaction data onDesktopandMobileat any time. For this we use technical, location and settings data, as well as interaction and system performance data (such as number of tabs open, memory usage or the outcome of automated processes like updates). In the rare situations where the information needed also includes limited browsing data (e.g., Top Level Domain annotations for page-load performance monitoring), it will be transmitted using OHTTP; this helps prevent Mozilla from linking you or your device to the data collected for this purpose.On Desktop and Android, if Firefox encounters an unexpected issue, theMozilla Crash Reporterwill also ask if you wish to send us additional information, which may include sites that were open at the time of the crash and other browsing data. For this we use technical, location and settings data, as well as interaction and system performance data (such as number of tabs open, memory usage or the outcome of automated processes like updates). In the rare situations where the information needed also includes limited browsing data (e.g., Top Level Domain annotations for page-load performance monitoring), it will be transmitted using OHTTP; this helps prevent Mozilla from linking you or your device to the data collected for this purpose. In addition to these standard processes, we useGoogles Safe Browsing Serviceto protect you from malicious downloads and phishing attacks, and validate web page and technical data withCertificate Authorities. System logs of your DNS requests are deleted from the service within 24 hours and are only used for the purpose of DNS resolution.Learn moreabout DNS over HTTPS.More details, including how to adjust your data settings:Upgrades and add-ons blocklist,Googles Safe Browsing Service,OHTTP, Because maintaining the latest version of Firefox helps keep you safe against vulnerabilities, desktop versions of Firefox regularly connect to Mozillas servers (or another service that you used to install Firefox) to check for software updates; updates for Android and iOS versions of Firefox are managed by Googles Play Store and Apples App Store, respectively. In addition to these standard processes, we useGoogles Safe Browsing Serviceto protect you from malicious downloads and phishing attacks, and validate web page and technical data withCertificate Authorities. System logs of your DNS requests are deleted from the service within 24 hours and are only used for the purpose of DNS resolution.Learn moreabout DNS over HTTPS. We use technology that is appropriate to the circumstances, including identifier removal, OHTTP, or DAP  these help prevent data from being linked to you. In some cases, we may share or publish aggregated and anonymized data to facilitate research or as part of the lawful business purposes outlined above (such as sharing aggregated insights with advertising partners). We use technology that is appropriate to the circumstances, including identifier removal, OHTTP, or DAP  these help prevent data from being linked to you. In some cases, we may share or publish aggregated and anonymized data to facilitate research or as part of the lawful business purposes outlined above (such as sharing aggregated insights with advertising partners). When you send us personal data via these methods, we will use the information only for the purpose you provided it. When you send us personal data via these methods, we will use the information only for the purpose you provided it. To comply with applicable laws, and identify and prevent harmful, unauthorized or illegal activityWe may also be required to process your personal data to comply with applicable laws and protection purposes, such as:Responding tolawful requestsand complying withlegal processes, such as responding to subpoenas, investigations, or requests from government authorities. To comply with applicable laws, and identify and prevent harmful, unauthorized or illegal activity We may also be required to process your personal data to comply with applicable laws and protection purposes, such as: Responding tolawful requestsand complying withlegal processes, such as responding to subpoenas, investigations, or requests from government authorities. How is your data shared?To provide our services as described above, we may disclose personal data to:Partners, service providers, suppliers and contractorsTo perform the purposes listed above, we work with partners, service providers, suppliers and contractors. To provide our services as described above, we may disclose personal data to: Partners, service providers, suppliers and contractors To perform the purposes listed above, we work with partners, service providers, suppliers and contractors. How long is your data kept?We only retain your personal data for as long as necessary to fulfill the purposes outlined in this Privacy Notice. In general, we do not retain personal data for more than 25 months, but actual retention periods may vary depending on the type of data and the purpose(s) for which it was collected (for example, we retain your first seen date for the period of your use of Firefox, so we know how long youve been a Firefox user). Once the retention period expires we securely delete your data, unless otherwise required by law.Our services also use encrypted backup storage as another layer of protection to help recover from potential disasters; data in these environments is put beyond use and only processed for business continuity purposes. We only retain your personal data for as long as necessary to fulfill the purposes outlined in this Privacy Notice. In general, we do not retain personal data for more than 25 months, but actual retention periods may vary depending on the type of data and the purpose(s) for which it was collected (for example, we retain your first seen date for the period of your use of Firefox, so we know how long youve been a Firefox user). Our services also use encrypted backup storage as another layer of protection to help recover from potential disasters; data in these environments is put beyond use and only processed for business continuity purposes. )Request a copy of the data we have about youRequest portability of your dataRequest correction of any data we hold about you that is inaccurate or incompleteHave personal data we hold about you deleted (in certain circumstances)In some cases, restrict or object to how we use your personal dataComplain to your relevant data protection authority if you have concerns about how were handling your personal data. )Request a copy of the data we have about youRequest portability of your dataRequest correction of any data we hold about you that is inaccurate or incompleteHave personal data we hold about you deleted (in certain circumstances)In some cases, restrict or object to how we use your personal dataComplain to your relevant data protection authority if you have concerns about how were handling your personal data. Request a copy of the data we have about you Request portability of your data Request correction of any data we hold about you that is inaccurate or incomplete Have personal data we hold about you deleted (in certain circumstances) In some cases, restrict or object to how we use your personal data Complain to your relevant data protection authority if you have concerns about how were handling your personal data. You can opt out of having your data processed for personalization or advertising purposes by turning off technical and interaction data onDesktopandMobileat any time.To provide Mozilla AccountsSee ourMozilla Accounts Privacy NoticeTo provide AI ChatbotsTechnical dataLocationSettings dataUnique identifiersInteraction dataConsent, when you choose to enable an AI Chatbot.You can read more about how tomanageorremoveAI chatbots in Firefox.To provide Review Checker, including serving sponsored contentTechnical dataSettings dataUnique identifiersInteraction dataBrowsing dataConsent, when you choose to enable Review Checker.You can read more information aboutHow to use Firefox Review Checkerand how we implement privacy preserving tech such asOHTTP.To enable add-ons (addons.mozilla.org, AMO), including offering personalized suggestionsTechnical dataLocationSettings dataUnique identifiersInteraction dataSearch dataLegitimate interestin providing and understanding usage of the AMO infrastructure, including reviewing add-ons and blocking those known to cause security, stability or performance issues.Consent, when you choose to enable a specific Mozilla provided add-on. You can opt out of having your data processed for personalization or advertising purposes by turning off technical and interaction data onDesktopandMobileat any time."
    ]
  },
  {
    "title": "Article 3 - Data Sharing",
    "paragraphs": [
      "This data may be shared with our advertising partners on a de-identified or aggregated basis.In some instances, when ads are enabled on New Tab, additional browsing data may also be processed locally on your device to measure the effectiveness of those ads; such data will only be shared with Mozilla and/or our advertising partners via our privacy-preserving technologies on an aggregated and/or de-identified basis.When a user visits a third-party website by clicking an advertisement or link in Firefox, that site may use cookies and other web APIs available to any website to collect data subject to that websites privacy and/or cookie notices.More details, including how to adjust your data settings:You can read more information abouthow to manage your New Tab pageincluding yourdata settings. We do collect technical and interaction data on how this feature is used to help improve Firefox, such as how often each third-party chatbot provider is chosen, how often suggested prompts are used, and the length of selected text.More details, including how to adjust your data settings:You can read more about how tomanageorremoveAI chatbots in Firefox.To provide Review Checker, including serving sponsored contentReview Checker is a Firefox feature that helps you determine whether reviews are reliable when you shop online with sites like Amazon.com, BestBuy.com and Walmart.com. We sometimes release information to make our products better and foster an open web, but when we do, we will do so in a de-identified or aggregatedformat.Mozilla controlled entities and successorsAs a global company, we share data across Mozilla-controlled affiliates and subsidiaries. This data may be shared with our advertising partners on a de-identified or aggregated basis.In some instances, when ads are enabled on New Tab, additional browsing data may also be processed locally on your device to measure the effectiveness of those ads; such data will only be shared with Mozilla and/or our advertising partners via our privacy-preserving technologies on an aggregated and/or de-identified basis.When a user visits a third-party website by clicking an advertisement or link in Firefox, that site may use cookies and other web APIs available to any website to collect data subject to that websites privacy and/or cookie notices.More details, including how to adjust your data settings:You can read more information abouthow to manage your New Tab pageincluding yourdata settings. We do collect technical and interaction data on how this feature is used to help improve Firefox, such as how often each third-party chatbot provider is chosen, how often suggested prompts are used, and the length of selected text.More details, including how to adjust your data settings:You can read more about how tomanageorremoveAI chatbots in Firefox.To provide Review Checker, including serving sponsored contentReview Checker is a Firefox feature that helps you determine whether reviews are reliable when you shop online with sites like Amazon.com, BestBuy.com and Walmart.com. Note that other Firefox features may integrate third-party AI models, as further detailed in this Notice. This data may be shared with our advertising partners on a de-identified or aggregated basis.In some instances, when ads are enabled on New Tab, additional browsing data may also be processed locally on your device to measure the effectiveness of those ads; such data will only be shared with Mozilla and/or our advertising partners via our privacy-preserving technologies on an aggregated and/or de-identified basis.When a user visits a third-party website by clicking an advertisement or link in Firefox, that site may use cookies and other web APIs available to any website to collect data subject to that websites privacy and/or cookie notices.More details, including how to adjust your data settings:You can read more information abouthow to manage your New Tab pageincluding yourdata settings. When a user visits a third-party website by clicking an advertisement or link in Firefox, that site may use cookies and other web APIs available to any website to collect data subject to that websites privacy and/or cookie notices. To provide AI ChatbotsYou have the option to use a third-party AI chatbot of your choice to help you with things like summarizing what youre reading, writing and brainstorming ideas, subject to that providersterms of use and privacy notice.If you choose to enable a chatbot in the sidebar and/or through a shortcut, Mozilla does not have access to your conversations or the underlying content you input into the selected chatbot. We do collect technical and interaction data on how this feature is used to help improve Firefox, such as how often each third-party chatbot provider is chosen, how often suggested prompts are used, and the length of selected text.More details, including how to adjust your data settings:You can read more about how tomanageorremoveAI chatbots in Firefox. To provide AI Chatbots You have the option to use a third-party AI chatbot of your choice to help you with things like summarizing what youre reading, writing and brainstorming ideas, subject to that providersterms of use and privacy notice. We do collect technical and interaction data on how this feature is used to help improve Firefox, such as how often each third-party chatbot provider is chosen, how often suggested prompts are used, and the length of selected text. We sometimes release information to make our products better and foster an open web, but when we do, we will do so in a de-identified or aggregatedformat.Mozilla controlled entities and successorsAs a global company, we share data across Mozilla-controlled affiliates and subsidiaries. Mozilla controlled entities and successors As a global company, we share data across Mozilla-controlled affiliates and subsidiaries."
    ]
  },
  {
    "title": "Article 4 - Data Retention",
    "paragraphs": [
      "Specific retention periods may also depend on the sensitivity of the data, the context of its collection, your settings and preferences, and our legal or contractual obligations to retain or delete your data, such as for fraud prevention, regulatory compliance, or service continuity. If you have any other questions regarding personal data or our privacy practices, please contact us atcompliance@mozilla.com.If youre in the UK or EEA, you can also contact our Data Protection Officer atdpo@mozilla.com, or by mail at:Bird & Bird DPO Services SRLAvenue Louise 235 b 11050 BrusselsBelgiumWe respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws, and we may need to ask you for additional information to confirm your identity before we can proceed with your request.Please note that, when you request deletion of your Firefox data, it will be deleted within 30 days of the request (with the exception of Interaction Data, which has a standard retention period of 90 days and is automatically deleted at the end of this period).Your choices:You can update your data collection settings forDesktopandMobileat any time.Firefox also providesGlobal Privacy Control(GPC), which you can enable to automatically notify websites not to sell or share information about your browsing session on that website. Specific retention periods may also depend on the sensitivity of the data, the context of its collection, your settings and preferences, and our legal or contractual obligations to retain or delete your data, such as for fraud prevention, regulatory compliance, or service continuity. Specific retention periods may also depend on the sensitivity of the data, the context of its collection, your settings and preferences, and our legal or contractual obligations to retain or delete your data, such as for fraud prevention, regulatory compliance, or service continuity. Once the retention period expires we securely delete your data, unless otherwise required by law. If you have any other questions regarding personal data or our privacy practices, please contact us atcompliance@mozilla.com.If youre in the UK or EEA, you can also contact our Data Protection Officer atdpo@mozilla.com, or by mail at:Bird & Bird DPO Services SRLAvenue Louise 235 b 11050 BrusselsBelgiumWe respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws, and we may need to ask you for additional information to confirm your identity before we can proceed with your request.Please note that, when you request deletion of your Firefox data, it will be deleted within 30 days of the request (with the exception of Interaction Data, which has a standard retention period of 90 days and is automatically deleted at the end of this period).Your choices:You can update your data collection settings forDesktopandMobileat any time.Firefox also providesGlobal Privacy Control(GPC), which you can enable to automatically notify websites not to sell or share information about your browsing session on that website. If you have any other questions regarding personal data or our privacy practices, please contact us atcompliance@mozilla.com.If youre in the UK or EEA, you can also contact our Data Protection Officer atdpo@mozilla.com, or by mail at:Bird & Bird DPO Services SRLAvenue Louise 235 b 11050 BrusselsBelgiumWe respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws, and we may need to ask you for additional information to confirm your identity before we can proceed with your request.Please note that, when you request deletion of your Firefox data, it will be deleted within 30 days of the request (with the exception of Interaction Data, which has a standard retention period of 90 days and is automatically deleted at the end of this period). Please note that, when you request deletion of your Firefox data, it will be deleted within 30 days of the request (with the exception of Interaction Data, which has a standard retention period of 90 days and is automatically deleted at the end of this period)."
    ]
  },
  {
    "title": "Article 5 - User Rights",
    "paragraphs": [
      "We utilize privacy preserving technologies such that Mozilla only learns that someone, somewhere, performed a search relating to a particular category, without knowing who.Learn moreabout how we categorize searches, including how to opt out.Mozilla may also receive location-related keywords from your search (such as when you search for Boston) and share this with our partners to provide recommended and sponsored content. If you do not want to receive product recommendations and sponsored content, you can opt out of this feature under Review Checker settings at any time.More details, including how to adjust your data settings:You can read more information aboutHow to use Firefox Review Checkerand how we implement privacy preserving tech such asOHTTP.To provide and enable add-ons (addons.mozilla.org)You can install add-ons from addons.mozilla.org (AMO) or from the Firefox Add-ons Manager, which is accessible from the Firefox menu button in the toolbar. You can change your settings at any time.More information, including how to adjust your data settings:You canlearn moreabout the studies youre enrolled in and opt out of all (or a specific) studies at any time, and opt into experimental features throughFirefox Labs. Where Firefox is pre-installed on your device, technical and interaction data (your device type and whether Firefox is used) will be sent to our marketing partners, and shared with Mozilla.More details, including how to adjust your data settings:Learn more about whatCampaign Measurement datais collected and shared, and how to opt out. We may also retain data for extended periods of time on a de-identified or aggregated basis.Your rights and choicesYour rights:As a Firefox user, you have the right to:Be informed about what data we process about you, why and who its shared with (thats this Notice! Wed prefer it if you contact us first (viadpo@mozilla.com), but you can also reach out to your relevantEU data protection authority, or search for (and contact) your local data protection authorityTo make any of the above requests regarding your personal data, please contact us (Mozilla Corporation) through ourData Subject Access Request Portal; we will never discriminate against anyone for exercising their privacy rights. It may also be used to indicate an opt-out of targeted advertising or general request to limit the sale or sharing of your personal data in those jurisdictions, as well as in jurisdictions such as the EU, UK, Nevada, Utah and Virginia.What happens with international data transfers?Mozilla (and our servers) are based in the United States. Data processed by each add-on is governed by their own Privacy Policy.Learnhow to remove or enable add-ons.You can also review thePrivacy Noticefor theadd-ons website.To maintain and improve features, performance and stabilityTechnical dataLocationSettings dataUnique identifiersSystem performance dataInteraction dataBrowsing dataContractto ensure that Firefox remains operational.Legitimate interestin performing research and measures to improve features, performance and stability.Consentwhen you choose to send us crash reports, which may include browsing data.You canlearn moreabout the studies youre enrolled in and opt out of all (or a specific) studies at any time, and opt into experimental features throughFirefox Labs.To improve securityTechnical dataLocationSettings dataUnique identifiersSystem performance dataBrowsing data (for DNS over HTTPs only)Compliance with lawin securing personal data as required under applicable privacy and cybersecurity regulations.Legitimate interestin providing additional security measures for all our users and enhancing the overall security of the internet (such as our anti-fingerprinting work).Learn more about ourUpgrades and add-ons blocklist,Googles Safe Browsing Service,OHTTP,To understand usage of FirefoxTechnical dataLocationSettings dataUnique identifiersInteraction dataContent dataSystem performance dataLanguage preferenceLegitimate interestin understanding how Firefox is used, enabling improvements and performing business functions such as usage reporting and forecasting.Consent, where required under applicable law (e.g. jurisdictions which require consent to receive marketing communications).Learn more about whatCampaign Measurement datais collected and shared, and how to opt out. Mozilla only collects the data necessary to measure and improve our marketing campaigns.To pseudonymize, de-identify, aggregate or anonymize data.All data typesLegitimate interestin taking privacy-enhancing measures prior to performing analytics or sharing data with partners.To communicate with you.Unique identifiersInteraction dataContact dataContent dataLanguage preferenceLegitimate interestin letting you know about improvements or changes to our products or services, as well as reviewing and responding to questions or other requests.To comply with applicable laws, and identify and prevent harmful, unauthorized or illegal activity.All data typesCompliance with lawin responding to data subject rights requests, responding to law enforcement requests, managing and protecting our (and our users) rights, property and/or safety.Legitimate interest, where compliance is not appropriate, in supporting legal or regulatory processes or requests, preventing fraud and managing and protecting our (and our users) rights, property and/or safety.Learn more about how we respond tolawful requests.Privacy Policies for Search ProvidersGoogleMicrosoft (Bing)DuckDuckGoAmazon.comeBay.comWikipedia How is your data used?To provide you with the Firefox browserMozilla collectscertain data, like technical and settings data, to provide the core functionality of the Firefox browser and associated services, distinguish your device from others, remember and respect your settings, and provide you with default features such asNew Tab,PDF editing,password managerandTotal Cookie Protection. We utilize privacy preserving technologies such that Mozilla only learns that someone, somewhere, performed a search relating to a particular category, without knowing who.Learn moreabout how we categorize searches, including how to opt out.Mozilla may also receive location-related keywords from your search (such as when you search for Boston) and share this with our partners to provide recommended and sponsored content. If you do not want to receive product recommendations and sponsored content, you can opt out of this feature under Review Checker settings at any time.More details, including how to adjust your data settings:You can read more information aboutHow to use Firefox Review Checkerand how we implement privacy preserving tech such asOHTTP.To provide and enable add-ons (addons.mozilla.org)You can install add-ons from addons.mozilla.org (AMO) or from the Firefox Add-ons Manager, which is accessible from the Firefox menu button in the toolbar. You can change your settings at any time.More information, including how to adjust your data settings:You canlearn moreabout the studies youre enrolled in and opt out of all (or a specific) studies at any time, and opt into experimental features throughFirefox Labs. Where Firefox is pre-installed on your device, technical and interaction data (your device type and whether Firefox is used) will be sent to our marketing partners, and shared with Mozilla.More details, including how to adjust your data settings:Learn more about whatCampaign Measurement datais collected and shared, and how to opt out. Mozilla requires a valid Legal Process to compel the disclosure of Specific User data to a government.Responding to requests to exercise privacy rights, such as your right to access or delete your personal data.Identifying, investigating and addressing potential fraudulent activities, or other harmful activities such as illegal activities, cyberattacks or intellectual property infringement (including filing or defending legal claims).Performing internal compliance and security activities, such as audits and enterprise security management. We utilize privacy preserving technologies such that Mozilla only learns that someone, somewhere, performed a search relating to a particular category, without knowing who.Learn moreabout how we categorize searches, including how to opt out.Mozilla may also receive location-related keywords from your search (such as when you search for Boston) and share this with our partners to provide recommended and sponsored content. We utilize privacy preserving technologies such that Mozilla only learns that someone, somewhere, performed a search relating to a particular category, without knowing who.Learn moreabout how we categorize searches, including how to opt out. If you do not want to receive product recommendations and sponsored content, you can opt out of this feature under Review Checker settings at any time.More details, including how to adjust your data settings:You can read more information aboutHow to use Firefox Review Checkerand how we implement privacy preserving tech such asOHTTP. If you do not want to receive product recommendations and sponsored content, you can opt out of this feature under Review Checker settings at any time. You can change your settings at any time.More information, including how to adjust your data settings:You canlearn moreabout the studies youre enrolled in and opt out of all (or a specific) studies at any time, and opt into experimental features throughFirefox Labs. More information, including how to adjust your data settings:You canlearn moreabout the studies youre enrolled in and opt out of all (or a specific) studies at any time, and opt into experimental features throughFirefox Labs. More information, including how to adjust your data settings: You canlearn moreabout the studies youre enrolled in and opt out of all (or a specific) studies at any time, and opt into experimental features throughFirefox Labs. Forsome Firefox users, Firefox routes DNS requests to a resolver service that has agreed to Mozillasstrict privacy standards for resolvers. Where Firefox is pre-installed on your device, technical and interaction data (your device type and whether Firefox is used) will be sent to our marketing partners, and shared with Mozilla.More details, including how to adjust your data settings:Learn more about whatCampaign Measurement datais collected and shared, and how to opt out. More details, including how to adjust your data settings:Learn more about whatCampaign Measurement datais collected and shared, and how to opt out. More details, including how to adjust your data settings: Learn more about whatCampaign Measurement datais collected and shared, and how to opt out. Mozilla requires a valid Legal Process to compel the disclosure of Specific User data to a government.Responding to requests to exercise privacy rights, such as your right to access or delete your personal data.Identifying, investigating and addressing potential fraudulent activities, or other harmful activities such as illegal activities, cyberattacks or intellectual property infringement (including filing or defending legal claims).Performing internal compliance and security activities, such as audits and enterprise security management. Responding to requests to exercise privacy rights, such as your right to access or delete your personal data. Your rights and choicesYour rights:As a Firefox user, you have the right to:Be informed about what data we process about you, why and who its shared with (thats this Notice! Wed prefer it if you contact us first (viadpo@mozilla.com), but you can also reach out to your relevantEU data protection authority, or search for (and contact) your local data protection authorityTo make any of the above requests regarding your personal data, please contact us (Mozilla Corporation) through ourData Subject Access Request Portal; we will never discriminate against anyone for exercising their privacy rights. It may also be used to indicate an opt-out of targeted advertising or general request to limit the sale or sharing of your personal data in those jurisdictions, as well as in jurisdictions such as the EU, UK, Nevada, Utah and Virginia. Your rights and choices Your rights:As a Firefox user, you have the right to:Be informed about what data we process about you, why and who its shared with (thats this Notice! Wed prefer it if you contact us first (viadpo@mozilla.com), but you can also reach out to your relevantEU data protection authority, or search for (and contact) your local data protection authorityTo make any of the above requests regarding your personal data, please contact us (Mozilla Corporation) through ourData Subject Access Request Portal; we will never discriminate against anyone for exercising their privacy rights. Wed prefer it if you contact us first (viadpo@mozilla.com), but you can also reach out to your relevantEU data protection authority, or search for (and contact) your local data protection authority To make any of the above requests regarding your personal data, please contact us (Mozilla Corporation) through ourData Subject Access Request Portal; we will never discriminate against anyone for exercising their privacy rights. If youre in the UK or EEA, you can also contact our Data Protection Officer atdpo@mozilla.com, or by mail at: Bird & Bird DPO Services SRLAvenue Louise 235 b 11050 BrusselsBelgium We respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws, and we may need to ask you for additional information to confirm your identity before we can proceed with your request. It may also be used to indicate an opt-out of targeted advertising or general request to limit the sale or sharing of your personal data in those jurisdictions, as well as in jurisdictions such as the EU, UK, Nevada, Utah and Virginia. It may also be used to indicate an opt-out of targeted advertising or general request to limit the sale or sharing of your personal data in those jurisdictions, as well as in jurisdictions such as the EU, UK, Nevada, Utah and Virginia. Data processed by each add-on is governed by their own Privacy Policy.Learnhow to remove or enable add-ons.You can also review thePrivacy Noticefor theadd-ons website.To maintain and improve features, performance and stabilityTechnical dataLocationSettings dataUnique identifiersSystem performance dataInteraction dataBrowsing dataContractto ensure that Firefox remains operational.Legitimate interestin performing research and measures to improve features, performance and stability.Consentwhen you choose to send us crash reports, which may include browsing data.You canlearn moreabout the studies youre enrolled in and opt out of all (or a specific) studies at any time, and opt into experimental features throughFirefox Labs.To improve securityTechnical dataLocationSettings dataUnique identifiersSystem performance dataBrowsing data (for DNS over HTTPs only)Compliance with lawin securing personal data as required under applicable privacy and cybersecurity regulations.Legitimate interestin providing additional security measures for all our users and enhancing the overall security of the internet (such as our anti-fingerprinting work).Learn more about ourUpgrades and add-ons blocklist,Googles Safe Browsing Service,OHTTP,To understand usage of FirefoxTechnical dataLocationSettings dataUnique identifiersInteraction dataContent dataSystem performance dataLanguage preferenceLegitimate interestin understanding how Firefox is used, enabling improvements and performing business functions such as usage reporting and forecasting.Consent, where required under applicable law (e.g. jurisdictions which require consent to receive marketing communications).Learn more about whatCampaign Measurement datais collected and shared, and how to opt out. Mozilla only collects the data necessary to measure and improve our marketing campaigns.To pseudonymize, de-identify, aggregate or anonymize data.All data typesLegitimate interestin taking privacy-enhancing measures prior to performing analytics or sharing data with partners.To communicate with you.Unique identifiersInteraction dataContact dataContent dataLanguage preferenceLegitimate interestin letting you know about improvements or changes to our products or services, as well as reviewing and responding to questions or other requests.To comply with applicable laws, and identify and prevent harmful, unauthorized or illegal activity.All data typesCompliance with lawin responding to data subject rights requests, responding to law enforcement requests, managing and protecting our (and our users) rights, property and/or safety.Legitimate interest, where compliance is not appropriate, in supporting legal or regulatory processes or requests, preventing fraud and managing and protecting our (and our users) rights, property and/or safety.Learn more about how we respond tolawful requests. You canlearn moreabout the studies youre enrolled in and opt out of all (or a specific) studies at any time, and opt into experimental features throughFirefox Labs. Learn more about whatCampaign Measurement datais collected and shared, and how to opt out. Unique identifiersInteraction dataContact dataContent dataLanguage preference Legitimate interestin letting you know about improvements or changes to our products or services, as well as reviewing and responding to questions or other requests. Compliance with lawin responding to data subject rights requests, responding to law enforcement requests, managing and protecting our (and our users) rights, property and/or safety.Legitimate interest, where compliance is not appropriate, in supporting legal or regulatory processes or requests, preventing fraud and managing and protecting our (and our users) rights, property and/or safety. Learn more about how we respond tolawful requests."
    ]
  },
  {
    "title": "Article 6 - Security",
    "paragraphs": [
      "How is your data used?To provide you with the Firefox browserMozilla collectscertain data, like technical and settings data, to provide the core functionality of the Firefox browser and associated services, distinguish your device from others, remember and respect your settings, and provide you with default features such asNew Tab,PDF editing,password managerandTotal Cookie Protection. You can alsolearn moreabout the technical and interaction data we process, including how to turn it off.To improve securityBecause maintaining the latest version of Firefox helps keep you safe against vulnerabilities, desktop versions of Firefox regularly connect to Mozillas servers (or another service that you used to install Firefox) to check for software updates; updates for Android and iOS versions of Firefox are managed by Googles Play Store and Apples App Store, respectively.We also process technical data and settings data to protect against malicious add-ons. This provides added protection from privacy leaks to local networks and also from certain DNS security attacks. We have contractual protections in place, so that the entities receiving personal data are contractually obligated to handle the data in accordance with Mozillas instructions.AuthoritiesMozilla requires a validLegal Processto compel the disclosure of specific user data to a government. Where appropriate, we ensure we have appropriate mechanisms in place (such asstandard contractual clausesapproved by the European Commission and other relevant authorities) to protect your personal data. You can contactdpo@mozilla.comfor information on the safeguards implemented for international transfers, or for copies of the relevant standard contractual clauses.Applicability (Firefox version) and changesApplicabilityThis Privacy Notice is for the most recent general release version of Firefox distributed by Mozilla. If you have not made any specific choices, these will be the default settings.Enhanced Tracking Protection settings, cookie settings, permissions (location, camera, microphone), toolbar customization.LocationWe infer your location from your IP address at the level of your country, city, or region.Country code, city.Precise LocationYour precise location (within a few feet or meters).Precise location.Language preferenceYour inferred or preferred language (if you provide it in settings) for interacting with our services.Language.Unique identifiersThese are unique identifiers, which may be created at various times to manage your interactions with the service.Client_id, session_id, cookie identifiers.System performance dataThis is data about how the services are operating on your device.Memory usage, page rendering speed.Interaction dataThis is data about how you engage with our services, such as how many tabs you have open or what youve clicked on.Click counts, impression data, attribution data, how many searches performed, time on page, ad and sponsored tile clicks.Browsing dataThis is information about websites and URLs youve visited. You can alsolearn moreabout the technical and interaction data we process, including how to turn it off.To improve securityBecause maintaining the latest version of Firefox helps keep you safe against vulnerabilities, desktop versions of Firefox regularly connect to Mozillas servers (or another service that you used to install Firefox) to check for software updates; updates for Android and iOS versions of Firefox are managed by Googles Play Store and Apples App Store, respectively.We also process technical data and settings data to protect against malicious add-ons. This provides added protection from privacy leaks to local networks and also from certain DNS security attacks. To provide you with the Firefox browserMozilla collectscertain data, like technical and settings data, to provide the core functionality of the Firefox browser and associated services, distinguish your device from others, remember and respect your settings, and provide you with default features such asNew Tab,PDF editing,password managerandTotal Cookie Protection. To provide you with the Firefox browser Mozilla collectscertain data, like technical and settings data, to provide the core functionality of the Firefox browser and associated services, distinguish your device from others, remember and respect your settings, and provide you with default features such asNew Tab,PDF editing,password managerandTotal Cookie Protection. To improve securityBecause maintaining the latest version of Firefox helps keep you safe against vulnerabilities, desktop versions of Firefox regularly connect to Mozillas servers (or another service that you used to install Firefox) to check for software updates; updates for Android and iOS versions of Firefox are managed by Googles Play Store and Apples App Store, respectively.We also process technical data and settings data to protect against malicious add-ons. This provides added protection from privacy leaks to local networks and also from certain DNS security attacks. We also process technical data and settings data to protect against malicious add-ons. This provides added protection from privacy leaks to local networks and also from certain DNS security attacks. We also process interaction data related to these communications to better understand who has received our service-related announcements (such as new features, updates or security alerts). We also process interaction data related to these communications to better understand who has received our service-related announcements (such as new features, updates or security alerts). Performing internal compliance and security activities, such as audits and enterprise security management. We have contractual protections in place, so that the entities receiving personal data are contractually obligated to handle the data in accordance with Mozillas instructions.AuthoritiesMozilla requires a validLegal Processto compel the disclosure of specific user data to a government. We have contractual protections in place, so that the entities receiving personal data are contractually obligated to handle the data in accordance with Mozillas instructions. Where appropriate, we ensure we have appropriate mechanisms in place (such asstandard contractual clausesapproved by the European Commission and other relevant authorities) to protect your personal data. You can contactdpo@mozilla.comfor information on the safeguards implemented for international transfers, or for copies of the relevant standard contractual clauses. Where appropriate, we ensure we have appropriate mechanisms in place (such asstandard contractual clausesapproved by the European Commission and other relevant authorities) to protect your personal data. You can contactdpo@mozilla.comfor information on the safeguards implemented for international transfers, or for copies of the relevant standard contractual clauses. If you have not made any specific choices, these will be the default settings.Enhanced Tracking Protection settings, cookie settings, permissions (location, camera, microphone), toolbar customization.LocationWe infer your location from your IP address at the level of your country, city, or region.Country code, city.Precise LocationYour precise location (within a few feet or meters).Precise location.Language preferenceYour inferred or preferred language (if you provide it in settings) for interacting with our services.Language.Unique identifiersThese are unique identifiers, which may be created at various times to manage your interactions with the service.Client_id, session_id, cookie identifiers.System performance dataThis is data about how the services are operating on your device.Memory usage, page rendering speed.Interaction dataThis is data about how you engage with our services, such as how many tabs you have open or what youve clicked on.Click counts, impression data, attribution data, how many searches performed, time on page, ad and sponsored tile clicks.Browsing dataThis is information about websites and URLs youve visited. Enhanced Tracking Protection settings, cookie settings, permissions (location, camera, microphone), toolbar customization. To enable add-ons (addons.mozilla.org, AMO), including offering personalized suggestions Technical dataLocationSettings dataUnique identifiersInteraction dataSearch data Legitimate interestin providing and understanding usage of the AMO infrastructure, including reviewing add-ons and blocking those known to cause security, stability or performance issues.Consent, when you choose to enable a specific Mozilla provided add-on. Legitimate interestin providing and understanding usage of the AMO infrastructure, including reviewing add-ons and blocking those known to cause security, stability or performance issues. Technical dataLocationSettings dataUnique identifiersSystem performance dataBrowsing data (for DNS over HTTPs only) System performance data Browsing data (for DNS over HTTPs only) Compliance with lawin securing personal data as required under applicable privacy and cybersecurity regulations.Legitimate interestin providing additional security measures for all our users and enhancing the overall security of the internet (such as our anti-fingerprinting work). Compliance with lawin securing personal data as required under applicable privacy and cybersecurity regulations. Legitimate interestin providing additional security measures for all our users and enhancing the overall security of the internet (such as our anti-fingerprinting work)."
    ]
  },
  {
    "title": "Article 7 - Cookies",
    "paragraphs": [
      "You can update your data collection settings forDesktopandMobileat any time.To adapt Firefox to your needsFirefox processes a variety of personal data in a way that does not leave your device, such as browsing history, web form data, temporary internet files, and cookies. We also collect technical and interaction data on usage of add-ons, to help improve Firefox.When you visit theAMO website, Mozilla collects technical and interaction data about your usage of the site in accordance with ourMozilla Websites, Communications and Cookiesnotice.More details, including how to adjust your data settings:Learnhow to remove or enable add-ons. when non-essential cookies are used), or where users engage with surveys or voluntarily submit other information.You can update your data collection settings forDesktopandMobileat any time (note that deselecting Allow Firefox to send technical and interaction data to Mozilla will not impact theDaily Usage Ping). You can update your data collection settings forDesktopandMobileat any time.To adapt Firefox to your needsFirefox processes a variety of personal data in a way that does not leave your device, such as browsing history, web form data, temporary internet files, and cookies. We also collect technical and interaction data on usage of add-ons, to help improve Firefox.When you visit theAMO website, Mozilla collects technical and interaction data about your usage of the site in accordance with ourMozilla Websites, Communications and Cookiesnotice.More details, including how to adjust your data settings:Learnhow to remove or enable add-ons. To adapt Firefox to your needsFirefox processes a variety of personal data in a way that does not leave your device, such as browsing history, web form data, temporary internet files, and cookies. To adapt Firefox to your needs Firefox processes a variety of personal data in a way that does not leave your device, such as browsing history, web form data, temporary internet files, and cookies. We also collect technical and interaction data on usage of add-ons, to help improve Firefox.When you visit theAMO website, Mozilla collects technical and interaction data about your usage of the site in accordance with ourMozilla Websites, Communications and Cookiesnotice.More details, including how to adjust your data settings:Learnhow to remove or enable add-ons. When you visit theAMO website, Mozilla collects technical and interaction data about your usage of the site in accordance with ourMozilla Websites, Communications and Cookiesnotice. when non-essential cookies are used), or where users engage with surveys or voluntarily submit other information.You can update your data collection settings forDesktopandMobileat any time (note that deselecting Allow Firefox to send technical and interaction data to Mozilla will not impact theDaily Usage Ping). To provide you with the Firefox browser Technical dataLocationLanguage preferenceSettings dataUnique identifiersInteraction data Contractto provide you with the necessary functionality for Firefox to operate.Legitimate interestin providing additional functionality, accessibility services and a more personalized experience. when non-essential cookies are used), or where users engage with surveys or voluntarily submit other information. when non-essential cookies are used), or where users engage with surveys or voluntarily submit other information."
    ]
  },
  {
    "title": "Article 9 - International Transfer",
    "paragraphs": [
      "What happens with international data transfers?Mozilla (and our servers) are based in the United States. What happens with international data transfers?"
    ]
  },
  {
    "title": "Article 10 - Contact Information",
    "paragraphs": [
      "To provide Mozilla accountsIf you sign up for a Mozilla account, we process additional information alongside the data set out in this Notice, such as account details, contact information and sync data, in accordance with theMozilla Accounts Privacy Notice. To provide Mozilla accounts If you sign up for a Mozilla account, we process additional information alongside the data set out in this Notice, such as account details, contact information and sync data, in accordance with theMozilla Accounts Privacy Notice. If you have any other questions regarding personal data or our privacy practices, please contact us atcompliance@mozilla.com. This could include categories of browsing data (travel, shopping, social media), top level domains (example.com) or specific web pages visited.Browsing category, Top Level Domains (TLDs), specific URLs.Search dataThis is data about the search category, search keywords or search query of terms searched for.Search category (Food, Travel), keywords (Boston), search term (current weather in Boston).ContentWhen you provide it to us, we may process data such as uploaded images or survey responses.Uploaded image, bookmarks, comments, survey responses.Contact dataWhen you provide it to us, we may process data about how to contact you.Email address, phone number. When you provide it to us, we may process data about how to contact you. Email address, phone number."
    ]
  },
  {
    "title": "Article 11 - General",
    "paragraphs": [
      "At Mozilla, we believe that privacy is fundamental to a healthy internetThats why we build Firefox, and all our products, to give you greater control over the information you share online and the information you share with us. Then, we explain how you can exercise choices about how we process your information. At Mozilla, we believe that privacy is fundamental to a healthy internet Thats why we build Firefox, and all our products, to give you greater control over the information you share online and the information you share with us. Then, we explain how you can exercise choices about how we process your information. You can further customize your Firefox experience by adjusting yourcontrols, buttons, and toolbarsand addingfeatures with add-ons.Some Firefox features, like automatedtranslationfor web pages andalt-text suggestions when you upload images in your PDFs, are powered by artificial intelligence (AI) based on small language models downloaded to your device. This means the data stays on your device and is not sent to Mozillas servers unless it says otherwise in this Notice. If you choose to allow it, your precise location may also be processed for location-related functionality for websites like Google Maps; this data is only accessed from your device by the website(s) you choose to enable it for  it is not sent to Mozilla's servers.More details, including how to adjust your data settings:Data processed on your device remains in your control. You canmanage your browsing dataand yourlocal storage settings, or update yourlocation permissionsat any time.To provide and improve search functionalityWhen you perform a search in Firefox, your search query, device data and location data will be processed by your default search engine (according to theirapplicable Privacy Notice) to provide your search results and search suggestions.Firefox also shows its ownsearch suggestionsbased on information stored on your local device (including recent search terms, open tabs, and previously visited URLs). These suggestions may include sponsored suggestions from Mozillas partners, relevant content from common internet resources (such as Wikipedia), or relevant URLs that are popular in your country. Mozilla processes certain technical and interaction data, such as how many searches you perform, how many sponsored suggestions you see and whether you interact with them. Mozilla's partners receive de-identified information about interactions with the suggestions they've served. You can enable or disableSearch suggestionsat any time.Depending on your location, Mozilla derives the high level category (e.g., travel, shopping) of your search from keywords in that query, in order to understand the types and number of searches being made. Where this occurs, Mozilla cannot associate the keyword search with an individual user once the search suggestion has been served and partners are never able to associate search suggestions with an individual user. Some of that information may be shared with our partners on a de-identified and/or aggregated basis. for mobile vs desktop), language, and relevant location. Mozilla collects technical and interaction data, such as the position, size, views and clicks on New Tab content or ads, to understand how people are interacting with our content and to personalize future content, including sponsored content. If you opt in to using Review Checker, Mozilla will process information about the website and the product identifier of the products you view using our privacy preserving technology calledOHTTP. OHTTP combines encryption and a third party intermediary server, helping prevent Mozilla from linking you or your device to the products you have viewed. We also collect technical and interaction data on how this feature is used to help improve Firefox.By opting in to using Review Checker you also agree to be shown product recommendations and sponsored content. We process your search queries in the Add-ons Manager to be able to provide you with suggested add-ons. If you choose to install any add-ons, Firefox will process technical, location and settings data, and periodically connect with Mozillas servers to install and apply the correct updates to your add-ons. You can also review thePrivacy Noticefor theadd-ons website.To maintain and improve features, performance and stabilityMozilla runsstudieswithin Firefox and makes certainexperimental featuresavailable through Firefox Labs to test different features and ideas before theyre made available to all Firefox users or become part of the core Firefox offering  this allows us to make more informed decisions about what our users want and need. This research uses technical, system performance, location, settings and interaction data.We also need to process data to keep Firefox operational, improve features and performance, and identify, troubleshoot and diagnose issues. This allows us to measure how people access and use our services, which helps improve our business and the functionality of Firefox.More details, including how to adjust your data settings:You can update your data collection settings forDesktopandMobileat any time (note that deselecting Allow Firefox to send technical and interaction data to Mozilla will not impact theDaily Usage Ping). This Daily Usage Ping solely provides us with de-identified information that a user is using Firefox and is not tied to any other data about you and can be opted out in the settings.To market our servicesWhen you allow us to do so, Firefox sends Mozilla data about the website domain or specific advertising campaign (if any) that referred you to our download page to help us understand and improve our marketing efforts. Firefox also shares information with our marketing partners to measure and improve these campaigns; what information is specifically shared varies (depending on how you discovered Firefox and your operating system) but generally includes how you were referred to our download page and whether you actively use Firefox. Note: Firefox does not share information like your browsing history, search queries, or saved passwords with marketing technology partners. Mozilla only collects the data necessary to measure and improve our marketing campaigns.To pseudonymize, de-identify, aggregate or anonymize dataAs part of the activities outlined above, such as understanding usage of Firefox and measuring our marketing, we may create pseudonymous, de-identified, aggregated or anonymized data. You may also reach out to us directly, such as toreport a broken site within Firefox. In those instances we may need to disclose the personal data set out in this Notice to law enforcement, government authorities, or similar entities to comply with applicable laws, and to identify and prevent harmful, unauthorized or illegal activity.ResearchersWhen we are fulfilling ourmissionof being open. GPC operates as a Do Not Sell mechanism in some US states such as California, Colorado and Connecticut. If you obtain Firefox elsewhere, or are running an older version, your copy of Firefox may contain different privacy characteristics.Mozillas pre-release versions of Firefox (which are distributed through channels such as Nightly, Beta, Developer Edition and TestFlight) are development platforms frequently updated with experimental features and studies. In addition to the data collection described in this Privacy Notice, these versions by default may send certain types of web activity and crash data to Mozilla (and in some cases to our partners).ChangesWe may need to change this policy and our notices, in which case the updates will be posted online and we will update the effective date of this notice. If the changes are substantive, we will also announce the update more prominently through Mozilla's usual channels for such announcements, such as blog posts and forums.Types of Data DefinedData TypeDescriptionExamples for Firefox usersTechnical dataThis is information about the hardware you are accessing our services from (such as your desktop computer, smartphone or tablet), its configurations and its connection to Firefox.Device type, operating system, IP address, ISP (Internet Service Provider).SettingsThese are your preferences or settings as to how the services are provided, such as your privacy preferences or toolbar settings. You can update your data collection settings forDesktopandMobileat any time. You can also learn more abouttranslationandadding alt-text to images in PDFs.To adapt Firefox to your needsAny data typeLegitimate interestin making the data on your device work for you.Consentwhere you choose to allow websites (like Google Maps) with access to your precise location to enable location-related functionality.Data processed on your device remains in your control. You can manage yourlocal storage settingsorclear your browsing historyat any time.To provide and improve search functionalityTechnical dataLocationLanguage preferenceSettings dataUnique identifiersSystem performance dataInteraction dataSearch dataLegitimate interestin providing and improving search functionality, as well as a more personalized search experience and sponsored results.Consentwhen you choose to opt into an enhanced search experience and share additional personal data.You can update yourSearch settingsandSearch suggestion features, at any time, and learn more about how wecategorize searches.To serve relevant content and advertising on Firefox New TabTechnical dataLocationLanguage preferenceSettings dataUnique identifiersSystem performance dataInteraction dataSearch dataLegitimate interestin providing you content that youre interested in and making sure that the ads you see are relevant (which supports our ability to provide our products and services).You can read more information abouthow to manage your New Tab pageincluding yourdata settings. This Daily Usage Ping solely provides us with de-identified information that a user is using Firefox and is not tied to any other data about you and can be opted out in the settings.To market our services.Technical dataLocationLanguage preferenceSettings dataUnique identifiersInteraction dataBrowsing dataSystem performance dataLegitimate interestin promoting our products and services, including sending marketing communications and measuring and improving our marketing campaigns.Consent, where required under applicable law (e.g. Note: Firefox does not share information like your browsing history, search queries, or saved passwords with marketing technology partners. You can further customize your Firefox experience by adjusting yourcontrols, buttons, and toolbarsand addingfeatures with add-ons.Some Firefox features, like automatedtranslationfor web pages andalt-text suggestions when you upload images in your PDFs, are powered by artificial intelligence (AI) based on small language models downloaded to your device. This means the data stays on your device and is not sent to Mozillas servers unless it says otherwise in this Notice. If you choose to allow it, your precise location may also be processed for location-related functionality for websites like Google Maps; this data is only accessed from your device by the website(s) you choose to enable it for  it is not sent to Mozilla's servers.More details, including how to adjust your data settings:Data processed on your device remains in your control. You canmanage your browsing dataand yourlocal storage settings, or update yourlocation permissionsat any time.To provide and improve search functionalityWhen you perform a search in Firefox, your search query, device data and location data will be processed by your default search engine (according to theirapplicable Privacy Notice) to provide your search results and search suggestions.Firefox also shows its ownsearch suggestionsbased on information stored on your local device (including recent search terms, open tabs, and previously visited URLs). These suggestions may include sponsored suggestions from Mozillas partners, relevant content from common internet resources (such as Wikipedia), or relevant URLs that are popular in your country. Mozilla processes certain technical and interaction data, such as how many searches you perform, how many sponsored suggestions you see and whether you interact with them. Mozilla's partners receive de-identified information about interactions with the suggestions they've served. You can enable or disableSearch suggestionsat any time.Depending on your location, Mozilla derives the high level category (e.g., travel, shopping) of your search from keywords in that query, in order to understand the types and number of searches being made. Where this occurs, Mozilla cannot associate the keyword search with an individual user once the search suggestion has been served and partners are never able to associate search suggestions with an individual user. Some of that information may be shared with our partners on a de-identified and/or aggregated basis. for mobile vs desktop), language, and relevant location. Mozilla collects technical and interaction data, such as the position, size, views and clicks on New Tab content or ads, to understand how people are interacting with our content and to personalize future content, including sponsored content. If you opt in to using Review Checker, Mozilla will process information about the website and the product identifier of the products you view using our privacy preserving technology calledOHTTP. OHTTP combines encryption and a third party intermediary server, helping prevent Mozilla from linking you or your device to the products you have viewed. We also collect technical and interaction data on how this feature is used to help improve Firefox.By opting in to using Review Checker you also agree to be shown product recommendations and sponsored content. We process your search queries in the Add-ons Manager to be able to provide you with suggested add-ons. If you choose to install any add-ons, Firefox will process technical, location and settings data, and periodically connect with Mozillas servers to install and apply the correct updates to your add-ons. You can also review thePrivacy Noticefor theadd-ons website.To maintain and improve features, performance and stabilityMozilla runsstudieswithin Firefox and makes certainexperimental featuresavailable through Firefox Labs to test different features and ideas before theyre made available to all Firefox users or become part of the core Firefox offering  this allows us to make more informed decisions about what our users want and need. This research uses technical, system performance, location, settings and interaction data.We also need to process data to keep Firefox operational, improve features and performance, and identify, troubleshoot and diagnose issues. This allows us to measure how people access and use our services, which helps improve our business and the functionality of Firefox.More details, including how to adjust your data settings:You can update your data collection settings forDesktopandMobileat any time (note that deselecting Allow Firefox to send technical and interaction data to Mozilla will not impact theDaily Usage Ping). This Daily Usage Ping solely provides us with de-identified information that a user is using Firefox and is not tied to any other data about you and can be opted out in the settings.To market our servicesWhen you allow us to do so, Firefox sends Mozilla data about the website domain or specific advertising campaign (if any) that referred you to our download page to help us understand and improve our marketing efforts. Firefox also shares information with our marketing partners to measure and improve these campaigns; what information is specifically shared varies (depending on how you discovered Firefox and your operating system) but generally includes how you were referred to our download page and whether you actively use Firefox. Note: Firefox does not share information like your browsing history, search queries, or saved passwords with marketing technology partners. Mozilla only collects the data necessary to measure and improve our marketing campaigns.To pseudonymize, de-identify, aggregate or anonymize dataAs part of the activities outlined above, such as understanding usage of Firefox and measuring our marketing, we may create pseudonymous, de-identified, aggregated or anonymized data. You may also reach out to us directly, such as toreport a broken site within Firefox. How is your data used? You can further customize your Firefox experience by adjusting yourcontrols, buttons, and toolbarsand addingfeatures with add-ons.Some Firefox features, like automatedtranslationfor web pages andalt-text suggestions when you upload images in your PDFs, are powered by artificial intelligence (AI) based on small language models downloaded to your device. You can update your data collection settings forDesktopandMobileat any time. You can further customize your Firefox experience by adjusting yourcontrols, buttons, and toolbarsand addingfeatures with add-ons. Some Firefox features, like automatedtranslationfor web pages andalt-text suggestions when you upload images in your PDFs, are powered by artificial intelligence (AI) based on small language models downloaded to your device. You can update your data collection settings forDesktopandMobileat any time. You can update your data collection settings forDesktopandMobileat any time. This means the data stays on your device and is not sent to Mozillas servers unless it says otherwise in this Notice. If you choose to allow it, your precise location may also be processed for location-related functionality for websites like Google Maps; this data is only accessed from your device by the website(s) you choose to enable it for  it is not sent to Mozilla's servers.More details, including how to adjust your data settings:Data processed on your device remains in your control. You canmanage your browsing dataand yourlocal storage settings, or update yourlocation permissionsat any time. This means the data stays on your device and is not sent to Mozillas servers unless it says otherwise in this Notice. If you choose to allow it, your precise location may also be processed for location-related functionality for websites like Google Maps; this data is only accessed from your device by the website(s) you choose to enable it for  it is not sent to Mozilla's servers. More details, including how to adjust your data settings:Data processed on your device remains in your control. You canmanage your browsing dataand yourlocal storage settings, or update yourlocation permissionsat any time. More details, including how to adjust your data settings: Data processed on your device remains in your control. You canmanage your browsing dataand yourlocal storage settings, or update yourlocation permissionsat any time. To provide and improve search functionalityWhen you perform a search in Firefox, your search query, device data and location data will be processed by your default search engine (according to theirapplicable Privacy Notice) to provide your search results and search suggestions.Firefox also shows its ownsearch suggestionsbased on information stored on your local device (including recent search terms, open tabs, and previously visited URLs). These suggestions may include sponsored suggestions from Mozillas partners, relevant content from common internet resources (such as Wikipedia), or relevant URLs that are popular in your country. Mozilla processes certain technical and interaction data, such as how many searches you perform, how many sponsored suggestions you see and whether you interact with them. Mozilla's partners receive de-identified information about interactions with the suggestions they've served. You can enable or disableSearch suggestionsat any time.Depending on your location, Mozilla derives the high level category (e.g., travel, shopping) of your search from keywords in that query, in order to understand the types and number of searches being made. Where this occurs, Mozilla cannot associate the keyword search with an individual user once the search suggestion has been served and partners are never able to associate search suggestions with an individual user. Some of that information may be shared with our partners on a de-identified and/or aggregated basis. See our Data and Firefox Suggestblog postfor more details.More details, including how to adjust your data settings:You can update yourSearch settingsandSearch suggestion features, at any time, and learn more about how wecategorize searches. To provide and improve search functionality When you perform a search in Firefox, your search query, device data and location data will be processed by your default search engine (according to theirapplicable Privacy Notice) to provide your search results and search suggestions. Firefox also shows its ownsearch suggestionsbased on information stored on your local device (including recent search terms, open tabs, and previously visited URLs). These suggestions may include sponsored suggestions from Mozillas partners, relevant content from common internet resources (such as Wikipedia), or relevant URLs that are popular in your country. Mozilla processes certain technical and interaction data, such as how many searches you perform, how many sponsored suggestions you see and whether you interact with them. Mozilla's partners receive de-identified information about interactions with the suggestions they've served. You can enable or disableSearch suggestionsat any time. Depending on your location, Mozilla derives the high level category (e.g., travel, shopping) of your search from keywords in that query, in order to understand the types and number of searches being made. Mozilla may also receive location-related keywords from your search (such as when you search for Boston) and share this with our partners to provide recommended and sponsored content. Where this occurs, Mozilla cannot associate the keyword search with an individual user once the search suggestion has been served and partners are never able to associate search suggestions with an individual user. You can remove this functionality at any time by turning off Sponsored Suggestions  more information on how to do this is available in the relevantFirefox Supportpage. Some of that information may be shared with our partners on a de-identified and/or aggregated basis. See our Data and Firefox Suggestblog postfor more details. More details, including how to adjust your data settings:You can update yourSearch settingsandSearch suggestion features, at any time, and learn more about how wecategorize searches. More details, including how to adjust your data settings: You can update yourSearch settingsandSearch suggestion features, at any time, and learn more about how wecategorize searches. for mobile vs desktop), language, and relevant location. Mozilla collects technical and interaction data, such as the position, size, views and clicks on New Tab content or ads, to understand how people are interacting with our content and to personalize future content, including sponsored content. for mobile vs desktop), language, and relevant location. Mozilla collects technical and interaction data, such as the position, size, views and clicks on New Tab content or ads, to understand how people are interacting with our content and to personalize future content, including sponsored content. This data may be shared with our advertising partners on a de-identified or aggregated basis. In some instances, when ads are enabled on New Tab, additional browsing data may also be processed locally on your device to measure the effectiveness of those ads; such data will only be shared with Mozilla and/or our advertising partners via our privacy-preserving technologies on an aggregated and/or de-identified basis. More details, including how to adjust your data settings:You can read more information abouthow to manage your New Tab pageincluding yourdata settings. More details, including how to adjust your data settings: You can read more information abouthow to manage your New Tab pageincluding yourdata settings. If you choose to enable a chatbot in the sidebar and/or through a shortcut, Mozilla does not have access to your conversations or the underlying content you input into the selected chatbot. More details, including how to adjust your data settings:You can read more about how tomanageorremoveAI chatbots in Firefox. More details, including how to adjust your data settings: You can read more about how tomanageorremoveAI chatbots in Firefox. To provide Review Checker, including serving sponsored contentReview Checker is a Firefox feature that helps you determine whether reviews are reliable when you shop online with sites like Amazon.com, BestBuy.com and Walmart.com. If you opt in to using Review Checker, Mozilla will process information about the website and the product identifier of the products you view using our privacy preserving technology calledOHTTP. OHTTP combines encryption and a third party intermediary server, helping prevent Mozilla from linking you or your device to the products you have viewed. We also collect technical and interaction data on how this feature is used to help improve Firefox.By opting in to using Review Checker you also agree to be shown product recommendations and sponsored content. To provide Review Checker, including serving sponsored content Review Checker is a Firefox feature that helps you determine whether reviews are reliable when you shop online with sites like Amazon.com, BestBuy.com and Walmart.com. If you opt in to using Review Checker, Mozilla will process information about the website and the product identifier of the products you view using our privacy preserving technology calledOHTTP. OHTTP combines encryption and a third party intermediary server, helping prevent Mozilla from linking you or your device to the products you have viewed. We also collect technical and interaction data on how this feature is used to help improve Firefox. By opting in to using Review Checker you also agree to be shown product recommendations and sponsored content. More details, including how to adjust your data settings:You can read more information aboutHow to use Firefox Review Checkerand how we implement privacy preserving tech such asOHTTP. More details, including how to adjust your data settings: You can read more information aboutHow to use Firefox Review Checkerand how we implement privacy preserving tech such asOHTTP. To provide and enable add-ons (addons.mozilla.org)You can install add-ons from addons.mozilla.org (AMO) or from the Firefox Add-ons Manager, which is accessible from the Firefox menu button in the toolbar. We process your search queries in the Add-ons Manager to be able to provide you with suggested add-ons. If you choose to install any add-ons, Firefox will process technical, location and settings data, and periodically connect with Mozillas servers to install and apply the correct updates to your add-ons. You can also review thePrivacy Noticefor theadd-ons website. To provide and enable add-ons (addons.mozilla.org) You can install add-ons from addons.mozilla.org (AMO) or from the Firefox Add-ons Manager, which is accessible from the Firefox menu button in the toolbar. We process your search queries in the Add-ons Manager to be able to provide you with suggested add-ons. If you choose to install any add-ons, Firefox will process technical, location and settings data, and periodically connect with Mozillas servers to install and apply the correct updates to your add-ons. We also collect technical and interaction data on usage of add-ons, to help improve Firefox. More details, including how to adjust your data settings:Learnhow to remove or enable add-ons. You can also review thePrivacy Noticefor theadd-ons website. More details, including how to adjust your data settings: Learnhow to remove or enable add-ons. You can also review thePrivacy Noticefor theadd-ons website. To maintain and improve features, performance and stabilityMozilla runsstudieswithin Firefox and makes certainexperimental featuresavailable through Firefox Labs to test different features and ideas before theyre made available to all Firefox users or become part of the core Firefox offering  this allows us to make more informed decisions about what our users want and need. This research uses technical, system performance, location, settings and interaction data.We also need to process data to keep Firefox operational, improve features and performance, and identify, troubleshoot and diagnose issues. You can alsolearn moreabout the technical and interaction data we process, including how to turn it off. To maintain and improve features, performance and stability Mozilla runsstudieswithin Firefox and makes certainexperimental featuresavailable through Firefox Labs to test different features and ideas before theyre made available to all Firefox users or become part of the core Firefox offering  this allows us to make more informed decisions about what our users want and need. This research uses technical, system performance, location, settings and interaction data. We also need to process data to keep Firefox operational, improve features and performance, and identify, troubleshoot and diagnose issues. On Desktop and Android, if Firefox encounters an unexpected issue, theMozilla Crash Reporterwill also ask if you wish to send us additional information, which may include sites that were open at the time of the crash and other browsing data. You can change your settings at any time. You can alsolearn moreabout the technical and interaction data we process, including how to turn it off. You can alsolearn moreabout the technical and interaction data we process, including how to turn it off. More details, including how to adjust your data settings:Upgrades and add-ons blocklist,Googles Safe Browsing Service,OHTTP, More details, including how to adjust your data settings: Upgrades and add-ons blocklist,Googles Safe Browsing Service,OHTTP, To understand usage of FirefoxWe processdatato better understand how you engage with our services, such as how much you use Firefox, your language preference, how often you use our search tools or interact with search suggestions, how fast pages load for you and how many ads orCAPTCHAsyou see. This allows us to measure how people access and use our services, which helps improve our business and the functionality of Firefox.More details, including how to adjust your data settings:You can update your data collection settings forDesktopandMobileat any time (note that deselecting Allow Firefox to send technical and interaction data to Mozilla will not impact theDaily Usage Ping). This Daily Usage Ping solely provides us with de-identified information that a user is using Firefox and is not tied to any other data about you and can be opted out in the settings. To understand usage of Firefox We processdatato better understand how you engage with our services, such as how much you use Firefox, your language preference, how often you use our search tools or interact with search suggestions, how fast pages load for you and how many ads orCAPTCHAsyou see. This allows us to measure how people access and use our services, which helps improve our business and the functionality of Firefox. More details, including how to adjust your data settings:You can update your data collection settings forDesktopandMobileat any time (note that deselecting Allow Firefox to send technical and interaction data to Mozilla will not impact theDaily Usage Ping). This Daily Usage Ping solely provides us with de-identified information that a user is using Firefox and is not tied to any other data about you and can be opted out in the settings. More details, including how to adjust your data settings: You can update your data collection settings forDesktopandMobileat any time (note that deselecting Allow Firefox to send technical and interaction data to Mozilla will not impact theDaily Usage Ping). This Daily Usage Ping solely provides us with de-identified information that a user is using Firefox and is not tied to any other data about you and can be opted out in the settings. To market our servicesWhen you allow us to do so, Firefox sends Mozilla data about the website domain or specific advertising campaign (if any) that referred you to our download page to help us understand and improve our marketing efforts. Firefox also shares information with our marketing partners to measure and improve these campaigns; what information is specifically shared varies (depending on how you discovered Firefox and your operating system) but generally includes how you were referred to our download page and whether you actively use Firefox. Note: Firefox does not share information like your browsing history, search queries, or saved passwords with marketing technology partners. Mozilla only collects the data necessary to measure and improve our marketing campaigns. To market our services When you allow us to do so, Firefox sends Mozilla data about the website domain or specific advertising campaign (if any) that referred you to our download page to help us understand and improve our marketing efforts. Firefox also shares information with our marketing partners to measure and improve these campaigns; what information is specifically shared varies (depending on how you discovered Firefox and your operating system) but generally includes how you were referred to our download page and whether you actively use Firefox. Where Firefox is pre-installed on your device, technical and interaction data (your device type and whether Firefox is used) will be sent to our marketing partners, and shared with Mozilla. Note: Firefox does not share information like your browsing history, search queries, or saved passwords with marketing technology partners. Mozilla only collects the data necessary to measure and improve our marketing campaigns. Note: Firefox does not share information like your browsing history, search queries, or saved passwords with marketing technology partners. Mozilla only collects the data necessary to measure and improve our marketing campaigns. To pseudonymize, de-identify, aggregate or anonymize dataAs part of the activities outlined above, such as understanding usage of Firefox and measuring our marketing, we may create pseudonymous, de-identified, aggregated or anonymized data. To pseudonymize, de-identify, aggregate or anonymize data As part of the activities outlined above, such as understanding usage of Firefox and measuring our marketing, we may create pseudonymous, de-identified, aggregated or anonymized data. To communicate with youDepending on your settings (and whether or not you have a Mozilla account), we may communicate with you via in-product messaging, send you communications (including marketing-related communications), or ask you to participate in research / surveys, or respond to customer support communications. You may also reach out to us directly, such as toreport a broken site within Firefox. To communicate with you Depending on your settings (and whether or not you have a Mozilla account), we may communicate with you via in-product messaging, send you communications (including marketing-related communications), or ask you to participate in research / surveys, or respond to customer support communications. You may also reach out to us directly, such as toreport a broken site within Firefox. Mozilla requires a valid Legal Process to compel the disclosure of Specific User data to a government. Identifying, investigating and addressing potential fraudulent activities, or other harmful activities such as illegal activities, cyberattacks or intellectual property infringement (including filing or defending legal claims). In those instances we may need to disclose the personal data set out in this Notice to law enforcement, government authorities, or similar entities to comply with applicable laws, and to identify and prevent harmful, unauthorized or illegal activity.ResearchersWhen we are fulfilling ourmissionof being open. We may also need to disclose personal data as part of a corporate transaction, such as a merger, acquisition, sale of assets or similar transaction. How is your data shared? Mozilla requires a validLegal Processto compel the disclosure of specific user data to a government. In those instances we may need to disclose the personal data set out in this Notice to law enforcement, government authorities, or similar entities to comply with applicable laws, and to identify and prevent harmful, unauthorized or illegal activity. When we are fulfilling ourmissionof being open. We sometimes release information to make our products better and foster an open web, but when we do, we will do so in a de-identified or aggregatedformat. We may also need to disclose personal data as part of a corporate transaction, such as a merger, acquisition, sale of assets or similar transaction. We may also retain data for extended periods of time on a de-identified or aggregated basis. How long is your data kept? We may also retain data for extended periods of time on a de-identified or aggregated basis. GPC operates as a Do Not Sell mechanism in some US states such as California, Colorado and Connecticut. As a Firefox user, you have the right to: Be informed about what data we process about you, why and who its shared with (thats this Notice!) Your choices:You can update your data collection settings forDesktopandMobileat any time.Firefox also providesGlobal Privacy Control(GPC), which you can enable to automatically notify websites not to sell or share information about your browsing session on that website. GPC operates as a Do Not Sell mechanism in some US states such as California, Colorado and Connecticut. You can update your data collection settings forDesktopandMobileat any time. Firefox also providesGlobal Privacy Control(GPC), which you can enable to automatically notify websites not to sell or share information about your browsing session on that website. GPC operates as a Do Not Sell mechanism in some US states such as California, Colorado and Connecticut. Mozilla (and our servers) are based in the United States. Applicability (Firefox version) and changesApplicabilityThis Privacy Notice is for the most recent general release version of Firefox distributed by Mozilla. If you obtain Firefox elsewhere, or are running an older version, your copy of Firefox may contain different privacy characteristics.Mozillas pre-release versions of Firefox (which are distributed through channels such as Nightly, Beta, Developer Edition and TestFlight) are development platforms frequently updated with experimental features and studies. In addition to the data collection described in this Privacy Notice, these versions by default may send certain types of web activity and crash data to Mozilla (and in some cases to our partners).ChangesWe may need to change this policy and our notices, in which case the updates will be posted online and we will update the effective date of this notice. If the changes are substantive, we will also announce the update more prominently through Mozilla's usual channels for such announcements, such as blog posts and forums. Applicability (Firefox version) and changes ApplicabilityThis Privacy Notice is for the most recent general release version of Firefox distributed by Mozilla. If you obtain Firefox elsewhere, or are running an older version, your copy of Firefox may contain different privacy characteristics.Mozillas pre-release versions of Firefox (which are distributed through channels such as Nightly, Beta, Developer Edition and TestFlight) are development platforms frequently updated with experimental features and studies. In addition to the data collection described in this Privacy Notice, these versions by default may send certain types of web activity and crash data to Mozilla (and in some cases to our partners). This Privacy Notice is for the most recent general release version of Firefox distributed by Mozilla. If you obtain Firefox elsewhere, or are running an older version, your copy of Firefox may contain different privacy characteristics. Mozillas pre-release versions of Firefox (which are distributed through channels such as Nightly, Beta, Developer Edition and TestFlight) are development platforms frequently updated with experimental features and studies. In addition to the data collection described in this Privacy Notice, these versions by default may send certain types of web activity and crash data to Mozilla (and in some cases to our partners). ChangesWe may need to change this policy and our notices, in which case the updates will be posted online and we will update the effective date of this notice. If the changes are substantive, we will also announce the update more prominently through Mozilla's usual channels for such announcements, such as blog posts and forums. We may need to change this policy and our notices, in which case the updates will be posted online and we will update the effective date of this notice. If the changes are substantive, we will also announce the update more prominently through Mozilla's usual channels for such announcements, such as blog posts and forums. Types of Data DefinedData TypeDescriptionExamples for Firefox usersTechnical dataThis is information about the hardware you are accessing our services from (such as your desktop computer, smartphone or tablet), its configurations and its connection to Firefox.Device type, operating system, IP address, ISP (Internet Service Provider).SettingsThese are your preferences or settings as to how the services are provided, such as your privacy preferences or toolbar settings. Types of Data Defined This is information about the hardware you are accessing our services from (such as your desktop computer, smartphone or tablet), its configurations and its connection to Firefox. Device type, operating system, IP address, ISP (Internet Service Provider). These are your preferences or settings as to how the services are provided, such as your privacy preferences or toolbar settings. If you have not made any specific choices, these will be the default settings. We infer your location from your IP address at the level of your country, city, or region. Your precise location (within a few feet or meters). Your inferred or preferred language (if you provide it in settings) for interacting with our services. These are unique identifiers, which may be created at various times to manage your interactions with the service. Client_id, session_id, cookie identifiers. System performance data This is data about how the services are operating on your device. Memory usage, page rendering speed. This is data about how you engage with our services, such as how many tabs you have open or what youve clicked on. Click counts, impression data, attribution data, how many searches performed, time on page, ad and sponsored tile clicks. This is information about websites and URLs youve visited. This could include categories of browsing data (travel, shopping, social media), top level domains (example.com) or specific web pages visited. Browsing category, Top Level Domains (TLDs), specific URLs. This is data about the search category, search keywords or search query of terms searched for. Search category (Food, Travel), keywords (Boston), search term (current weather in Boston). When you provide it to us, we may process data such as uploaded images or survey responses. Uploaded image, bookmarks, comments, survey responses. You can update your data collection settings forDesktopandMobileat any time. You can also learn more abouttranslationandadding alt-text to images in PDFs.To adapt Firefox to your needsAny data typeLegitimate interestin making the data on your device work for you.Consentwhere you choose to allow websites (like Google Maps) with access to your precise location to enable location-related functionality.Data processed on your device remains in your control. You can manage yourlocal storage settingsorclear your browsing historyat any time.To provide and improve search functionalityTechnical dataLocationLanguage preferenceSettings dataUnique identifiersSystem performance dataInteraction dataSearch dataLegitimate interestin providing and improving search functionality, as well as a more personalized search experience and sponsored results.Consentwhen you choose to opt into an enhanced search experience and share additional personal data.You can update yourSearch settingsandSearch suggestion features, at any time, and learn more about how wecategorize searches.To serve relevant content and advertising on Firefox New TabTechnical dataLocationLanguage preferenceSettings dataUnique identifiersSystem performance dataInteraction dataSearch dataLegitimate interestin providing you content that youre interested in and making sure that the ads you see are relevant (which supports our ability to provide our products and services).You can read more information abouthow to manage your New Tab pageincluding yourdata settings. This Daily Usage Ping solely provides us with de-identified information that a user is using Firefox and is not tied to any other data about you and can be opted out in the settings.To market our services.Technical dataLocationLanguage preferenceSettings dataUnique identifiersInteraction dataBrowsing dataSystem performance dataLegitimate interestin promoting our products and services, including sending marketing communications and measuring and improving our marketing campaigns.Consent, where required under applicable law (e.g. Note: Firefox does not share information like your browsing history, search queries, or saved passwords with marketing technology partners. Contractto provide you with the necessary functionality for Firefox to operate. Legitimate interestin providing additional functionality, accessibility services and a more personalized experience. You can update your data collection settings forDesktopandMobileat any time. You can also learn more abouttranslationandadding alt-text to images in PDFs. To adapt Firefox to your needs Legitimate interestin making the data on your device work for you.Consentwhere you choose to allow websites (like Google Maps) with access to your precise location to enable location-related functionality. Legitimate interestin making the data on your device work for you. Consentwhere you choose to allow websites (like Google Maps) with access to your precise location to enable location-related functionality. Data processed on your device remains in your control. You can manage yourlocal storage settingsorclear your browsing historyat any time. To provide and improve search functionality Technical dataLocationLanguage preferenceSettings dataUnique identifiersSystem performance dataInteraction dataSearch data System performance data Legitimate interestin providing and improving search functionality, as well as a more personalized search experience and sponsored results.Consentwhen you choose to opt into an enhanced search experience and share additional personal data. Legitimate interestin providing and improving search functionality, as well as a more personalized search experience and sponsored results. Consentwhen you choose to opt into an enhanced search experience and share additional personal data. You can update yourSearch settingsandSearch suggestion features, at any time, and learn more about how wecategorize searches. To serve relevant content and advertising on Firefox New Tab Technical dataLocationLanguage preferenceSettings dataUnique identifiersSystem performance dataInteraction dataSearch data System performance data Legitimate interestin providing you content that youre interested in and making sure that the ads you see are relevant (which supports our ability to provide our products and services). You can read more information abouthow to manage your New Tab pageincluding yourdata settings. To provide Mozilla Accounts See ourMozilla Accounts Privacy Notice To provide AI Chatbots Technical dataLocationSettings dataUnique identifiersInteraction data Consent, when you choose to enable an AI Chatbot. You can read more about how tomanageorremoveAI chatbots in Firefox. To provide Review Checker, including serving sponsored content Technical dataSettings dataUnique identifiersInteraction dataBrowsing data Consent, when you choose to enable Review Checker. You can read more information aboutHow to use Firefox Review Checkerand how we implement privacy preserving tech such asOHTTP. Data processed by each add-on is governed by their own Privacy Policy. Consent, when you choose to enable a specific Mozilla provided add-on. Data processed by each add-on is governed by their own Privacy Policy. Learnhow to remove or enable add-ons.You can also review thePrivacy Noticefor theadd-ons website. Learnhow to remove or enable add-ons. You can also review thePrivacy Noticefor theadd-ons website. To maintain and improve features, performance and stability Technical dataLocationSettings dataUnique identifiersSystem performance dataInteraction dataBrowsing data System performance data Contractto ensure that Firefox remains operational.Legitimate interestin performing research and measures to improve features, performance and stability.Consentwhen you choose to send us crash reports, which may include browsing data. Contractto ensure that Firefox remains operational. Legitimate interestin performing research and measures to improve features, performance and stability. Consentwhen you choose to send us crash reports, which may include browsing data. Learn more about ourUpgrades and add-ons blocklist,Googles Safe Browsing Service,OHTTP, To understand usage of Firefox Technical dataLocationSettings dataUnique identifiersInteraction dataContent dataSystem performance dataLanguage preference System performance data Legitimate interestin understanding how Firefox is used, enabling improvements and performing business functions such as usage reporting and forecasting.Consent, where required under applicable law (e.g. Legitimate interestin understanding how Firefox is used, enabling improvements and performing business functions such as usage reporting and forecasting. Consent, where required under applicable law (e.g. You can update your data collection settings forDesktopandMobileat any time (note that deselecting Allow Firefox to send technical and interaction data to Mozilla will not impact theDaily Usage Ping). This Daily Usage Ping solely provides us with de-identified information that a user is using Firefox and is not tied to any other data about you and can be opted out in the settings. To market our services. Technical dataLocationLanguage preferenceSettings dataUnique identifiersInteraction dataBrowsing dataSystem performance data System performance data Legitimate interestin promoting our products and services, including sending marketing communications and measuring and improving our marketing campaigns.Consent, where required under applicable law (e.g. jurisdictions which require consent to receive marketing communications). Legitimate interestin promoting our products and services, including sending marketing communications and measuring and improving our marketing campaigns. Consent, where required under applicable law (e.g. jurisdictions which require consent to receive marketing communications). Note: Firefox does not share information like your browsing history, search queries, or saved passwords with marketing technology partners. Mozilla only collects the data necessary to measure and improve our marketing campaigns. To pseudonymize, de-identify, aggregate or anonymize data. Legitimate interestin taking privacy-enhancing measures prior to performing analytics or sharing data with partners. To communicate with you. To comply with applicable laws, and identify and prevent harmful, unauthorized or illegal activity. Privacy Policies for Search ProvidersGoogleMicrosoft (Bing)DuckDuckGoAmazon.comeBay.comWikipedia Privacy Policies for Search Providers"
    ]
  }
]