[
  {
    "title": "Article 1 - Data Collection",
    "paragraphs": [
      "The following Oracle privacy policies are tailored for the different ways your Personal Information may be collected, used, shared and processed by different Oracle lines of business:TheOracle General Privacy Policyaddresses information we collect in connection with your use of Oracle websites, mobile applications, and social media pages that link to the General Privacy Policy, your interactions with Oracle during in-person meetings at Oracle facilities or at Oracle events, and in the context of other online or offline sales and marketing activities.TheOracle Services Privacy Policydescribes our privacy and security practices that apply when handling (i) services personal information in order to perform Consulting, Technical Support, Cloud and other services on behalf of Oracle customers; and (ii) personal information contained in systems operation data generated by the interaction of (end-)users of these services with Oracle systems and networks.TheOracle Recruiting Privacy Policyaddresses information we may collect in connection with Oracles online and offline recruiting efforts.TheOracle Facilities and Physical Security Privacy Policyaddresses the processing of personal information by Oracle through the use of Facial Recognition technology as part of our safety and security measures in select Oracle campuses and facilities in the United States.TheCustomer Data Research and Development Privacy Policydescribes Oracles processing of personal information in connection with Oracles artificial intelligence and machine learning activities in order to analyze, develop, and improve Oracle products and services, and for security and compliance purposes.TheOracle Life Sciences Healthcare Research Privacy Policyaddresses the processing of personal information by Oracle Life Sciences to facilitate Oracle health research activities.TheOracle Restaurants eStore Privacy Policydescribes Oracles processing of personal information in connection with Oracles provision of the Oracle Restaurants eStore Products and Services.TheDyn Internet Performance Tools Privacy Policyprovides information on the collection, use, sharing and processing of personal information by Oracle in connection with Dyns Recursive DNS service, Updater Client, Gauge web browser extension, and RUM beacons.TheOracle Advertising Privacy Policyhas been decommissioned. The following Oracle privacy policies are tailored for the different ways your Personal Information may be collected, used, shared and processed by different Oracle lines of business:TheOracle General Privacy Policyaddresses information we collect in connection with your use of Oracle websites, mobile applications, and social media pages that link to the General Privacy Policy, your interactions with Oracle during in-person meetings at Oracle facilities or at Oracle events, and in the context of other online or offline sales and marketing activities.TheOracle Services Privacy Policydescribes our privacy and security practices that apply when handling (i) services personal information in order to perform Consulting, Technical Support, Cloud and other services on behalf of Oracle customers; and (ii) personal information contained in systems operation data generated by the interaction of (end-)users of these services with Oracle systems and networks.TheOracle Recruiting Privacy Policyaddresses information we may collect in connection with Oracles online and offline recruiting efforts.TheOracle Facilities and Physical Security Privacy Policyaddresses the processing of personal information by Oracle through the use of Facial Recognition technology as part of our safety and security measures in select Oracle campuses and facilities in the United States.TheCustomer Data Research and Development Privacy Policydescribes Oracles processing of personal information in connection with Oracles artificial intelligence and machine learning activities in order to analyze, develop, and improve Oracle products and services, and for security and compliance purposes.TheOracle Life Sciences Healthcare Research Privacy Policyaddresses the processing of personal information by Oracle Life Sciences to facilitate Oracle health research activities.TheOracle Restaurants eStore Privacy Policydescribes Oracles processing of personal information in connection with Oracles provision of the Oracle Restaurants eStore Products and Services.TheDyn Internet Performance Tools Privacy Policyprovides information on the collection, use, sharing and processing of personal information by Oracle in connection with Dyns Recursive DNS service, Updater Client, Gauge web browser extension, and RUM beacons.TheOracle Advertising Privacy Policyhas been decommissioned. The following Oracle privacy policies are tailored for the different ways your Personal Information may be collected, used, shared and processed by different Oracle lines of business: TheOracle General Privacy Policyaddresses information we collect in connection with your use of Oracle websites, mobile applications, and social media pages that link to the General Privacy Policy, your interactions with Oracle during in-person meetings at Oracle facilities or at Oracle events, and in the context of other online or offline sales and marketing activities."
    ]
  },
  {
    "title": "Article 2 - Data Usage",
    "paragraphs": [
      "TheOracle Facilities and Physical Security Privacy Policyaddresses the processing of personal information by Oracle through the use of Facial Recognition technology as part of our safety and security measures in select Oracle campuses and facilities in the United States. TheCustomer Data Research and Development Privacy Policydescribes Oracles processing of personal information in connection with Oracles artificial intelligence and machine learning activities in order to analyze, develop, and improve Oracle products and services, and for security and compliance purposes. TheOracle Life Sciences Healthcare Research Privacy Policyaddresses the processing of personal information by Oracle Life Sciences to facilitate Oracle health research activities. TheOracle Restaurants eStore Privacy Policydescribes Oracles processing of personal information in connection with Oracles provision of the Oracle Restaurants eStore Products and Services. TheDyn Internet Performance Tools Privacy Policyprovides information on the collection, use, sharing and processing of personal information by Oracle in connection with Dyns Recursive DNS service, Updater Client, Gauge web browser extension, and RUM beacons."
    ]
  },
  {
    "title": "Article 5 - User Rights",
    "paragraphs": [
      "The Oracle Advertising opt out tool is no longer available because Oracle does not obtain, use, or disclose personal information for Oracle Advertising services.Pursuant to the E.U. General Data Protection Regulation (GDPR), California Consumer Privacy Act (CCPA), and other applicable laws and regulations, individuals may have data subject rights enabling them to request to access, delete, correct, remove or limit the use, or receive a copy of their personal information in Oracles possession or for which Oracle is otherwise responsible. If you would like to exercise your rights, please refer to the applicable privacy policy above or visit thePrivacy Choicestab for more information. The Oracle Advertising opt out tool is no longer available because Oracle does not obtain, use, or disclose personal information for Oracle Advertising services.Pursuant to the E.U. General Data Protection Regulation (GDPR), California Consumer Privacy Act (CCPA), and other applicable laws and regulations, individuals may have data subject rights enabling them to request to access, delete, correct, remove or limit the use, or receive a copy of their personal information in Oracles possession or for which Oracle is otherwise responsible. If you would like to exercise your rights, please refer to the applicable privacy policy above or visit thePrivacy Choicestab for more information. The Oracle Advertising opt out tool is no longer available because Oracle does not obtain, use, or disclose personal information for Oracle Advertising services. General Data Protection Regulation (GDPR), California Consumer Privacy Act (CCPA), and other applicable laws and regulations, individuals may have data subject rights enabling them to request to access, delete, correct, remove or limit the use, or receive a copy of their personal information in Oracles possession or for which Oracle is otherwise responsible. If you would like to exercise your rights, please refer to the applicable privacy policy above or visit thePrivacy Choicestab for more information."
    ]
  },
  {
    "title": "Article 6 - Security",
    "paragraphs": [
      "TheOracle Services Privacy Policydescribes our privacy and security practices that apply when handling (i) services personal information in order to perform Consulting, Technical Support, Cloud and other services on behalf of Oracle customers; and (ii) personal information contained in systems operation data generated by the interaction of (end-)users of these services with Oracle systems and networks."
    ]
  },
  {
    "title": "Article 10 - Contact Information",
    "paragraphs": [
      "Skip to contentAccessibility PolicyCountryCloud AccountSign in to CloudSign Up for Free Cloud TierOracle AccountSign-InCreate an AccountHelpSign OutContact SalesMenuMenu Skip to contentAccessibility Policy CountryCloud AccountSign in to CloudSign Up for Free Cloud TierOracle AccountSign-InCreate an AccountHelpSign OutContact SalesMenuMenu CountryCloud AccountSign in to CloudSign Up for Free Cloud TierOracle AccountSign-InCreate an AccountHelpSign OutContact SalesMenuMenu Cloud AccountSign in to CloudSign Up for Free Cloud TierOracle AccountSign-InCreate an AccountHelpSign Out Cloud AccountSign in to CloudSign Up for Free Cloud TierOracle AccountSign-InCreate an AccountHelpSign Out Cloud AccountSign in to CloudSign Up for Free Cloud Tier Oracle respects your preferences concerning the collection and use of your Personal Information."
    ]
  },
  {
    "title": "Article 11 - General",
    "paragraphs": [
      "Oracle no longer provides Oracle Advertising services and solutions as of September 30, 2024. Oracle respects your preferences concerning the collection and use of your Personal Information. Oracle no longer provides Oracle Advertising services and solutions as of September 30, 2024. Oracle respects your preferences concerning the collection and use of your Personal Information. TheOracle Recruiting Privacy Policyaddresses information we may collect in connection with Oracles online and offline recruiting efforts. TheOracle Advertising Privacy Policyhas been decommissioned. Oracle no longer provides Oracle Advertising services and solutions as of September 30, 2024."
    ]
  }
]