[
  {
    "title": "Article 2 - Data Usage",
    "paragraphs": [
      "The data controller or business (each as defined under applicable data protection laws) is the entity that has the control over the purposes and means by which the data processing is performed. The data processor or service provider (each as defined under applicable data protection laws) is the entity that processes the Personal Information for the data controller, for the data controllers specific purposes, and as otherwise permitted under applicable data protection laws. The data controller or business (each as defined under applicable data protection laws) is the entity that has the control over the purposes and means by which the data processing is performed. The data processor or service provider (each as defined under applicable data protection laws) is the entity that processes the Personal Information for the data controller, for the data controllers specific purposes, and as otherwise permitted under applicable data protection laws."
    ]
  },
  {
    "title": "Article 11 - General",
    "paragraphs": [
      "PayPal, Inc. (we, our, us, PayPal) provides this Privacy Statement to describe our use of your Personal Information when you use your PayPal account, Xoom account, visit our websites, or apply for, or use our Services, like Braintree and Zettle. This Privacy Statement does not apply to Excluded Services, such as Venmo and Hyperwallet.We encourage you to read this Privacy Statement and to use it to help you make informed decisions.Certain capitalized terms that are not otherwise defined in the Statement are explained in theDefinitionssection below.We revise this Privacy Statement from time to time to reflect changes to our business, Services, or applicable laws. If the revised version requires notice in accordance with applicable law, we will provide you with 30 days prior notice by posting notice of the change on the \"Policy Updates\" or \"Privacy Statement\" page of our website, otherwise the revised Privacy Statement will be effective as of the published effective date. If you are a new User or are receiving this Privacy Statement for the first time and there is an upcoming change described on thePolicy Updatesor Privacy Statement page at the time you receive this Privacy Statement, such upcoming change will apply to you on the indicated effective date.For most of our Services, we act as a data controller or business, however there are some products and features where PayPal may also act as a data processor or service provider when providing services to our Partners and Merchants. PayPal, Inc. (we, our, us, PayPal) provides this Privacy Statement to describe our use of your Personal Information when you use your PayPal account, Xoom account, visit our websites, or apply for, or use our Services, like Braintree and Zettle. This Privacy Statement does not apply to Excluded Services, such as Venmo and Hyperwallet. We encourage you to read this Privacy Statement and to use it to help you make informed decisions. Certain capitalized terms that are not otherwise defined in the Statement are explained in theDefinitionssection below. We revise this Privacy Statement from time to time to reflect changes to our business, Services, or applicable laws. If the revised version requires notice in accordance with applicable law, we will provide you with 30 days prior notice by posting notice of the change on the \"Policy Updates\" or \"Privacy Statement\" page of our website, otherwise the revised Privacy Statement will be effective as of the published effective date. If you are a new User or are receiving this Privacy Statement for the first time and there is an upcoming change described on thePolicy Updatesor Privacy Statement page at the time you receive this Privacy Statement, such upcoming change will apply to you on the indicated effective date. For most of our Services, we act as a data controller or business, however there are some products and features where PayPal may also act as a data processor or service provider when providing services to our Partners and Merchants."
    ]
  }
]