[
  {
    "article_number": 13,
    "article_title": "Information to be provided where personal data are collected from the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "An overview of data protection. General information. The following information will provide you with an easy to navigate overview of what will happen with your personal data when you visit our website The term personal data comprises all data that can be used to personally identify you For detailed information about the subject matter of data protection, please consult our Data Protection Declaration, which we have included beneath this copy.Data recording on our website. Who is the responsible party for the recording of data on this website (i.e the controller)?The data on this website is processed by the operator of the website, whose contact information is available under section Imprint on this website.How do we record your data?We collect your data as a result of your sharing of your data with us",
          "similarity_score": 0.6746
        },
        {
          "matched_policy_passage": "The term personal data comprises all data that can be used to personally identify you For detailed information about the subject matter of data protection, please consult our Data Protection Declaration, which we have included beneath this copy.Data recording on our website. Who is the responsible party for the recording of data on this website (i.e the controller)?The data on this website is processed by the operator of the website, whose contact information is available under section Imprint on this website.How do we record your data?We collect your data as a result of your sharing of your data with us This may, for instance be information you enter into our contact form.Our IT systems automatically record other data when you visit our website",
          "similarity_score": 0.7305
        },
        {
          "matched_policy_passage": "For detailed information about the subject matter of data protection, please consult our Data Protection Declaration, which we have included beneath this copy.Data recording on our website. Who is the responsible party for the recording of data on this website (i.e the controller)?The data on this website is processed by the operator of the website, whose contact information is available under section Imprint on this website.How do we record your data?We collect your data as a result of your sharing of your data with us This may, for instance be information you enter into our contact form.Our IT systems automatically record other data when you visit our website This data comprises primarily technical information (e.g",
          "similarity_score": 0.6719
        },
        {
          "matched_policy_passage": "the controller)?The data on this website is processed by the operator of the website, whose contact information is available under section Imprint on this website.How do we record your data?We collect your data as a result of your sharing of your data with us This may, for instance be information you enter into our contact form.Our IT systems automatically record other data when you visit our website This data comprises primarily technical information (e.g web browser, operating system or time the site was accessed)",
          "similarity_score": 0.6862
        },
        {
          "matched_policy_passage": "It is not always possible to completely protect data against third party access.Information about the responsible party (referred to as the controller in the GDPR)The data processing controller on this website is:own. Cloud Gmb. HRathsbergstr 1790411 Nürnberg. Germany. Phone: +49 911 14888690Email: hello[at]owncloud[dot]com. The controller is the natural person or legal entity that single-handedly or jointly with others makes decisions as to the purposes of and resources for the processing of personal data (e.g names, email addresses, etc ).Revocation of your consent to the processing of data. A wide range of data processing transactions are possible only subject to your express consent",
          "similarity_score": 0.6647
        },
        {
          "matched_policy_passage": "The term personal data comprises all data that can be used to personally identify you For detailed information about the subject matter of data protection, please consult our Data Protection Declaration, which we have included beneath this copy Data recording on our website Who is the responsible party for the recording of data on this website (i.e the controller)?The data on this website is processed by the operator of the website, whose contact information is available under section Imprint on this website",
          "similarity_score": 0.7697
        },
        {
          "matched_policy_passage": "For detailed information about the subject matter of data protection, please consult our Data Protection Declaration, which we have included beneath this copy Data recording on our website Who is the responsible party for the recording of data on this website (i.e the controller)?The data on this website is processed by the operator of the website, whose contact information is available under section Imprint on this website How do we record your data?We collect your data as a result of your sharing of your data with us",
          "similarity_score": 0.6653
        },
        {
          "matched_policy_passage": "the controller)?The data on this website is processed by the operator of the website, whose contact information is available under section Imprint on this website How do we record your data?We collect your data as a result of your sharing of your data with us This may, for instance be information you enter into our contact form Our IT systems automatically record other data when you visit our website",
          "similarity_score": 0.6712
        },
        {
          "matched_policy_passage": "through email communications) may be prone to security gaps It is not always possible to completely protect data against third party access Information about the responsible party (referred to as the controller in the GDPR) The data processing controller on this website is: own. Cloud Gmb. HRathsbergstr 1790411 Nürnberg. Germany Phone: +49 911 14888690Email: hello[at]owncloud[dot]com The controller is the natural person or legal entity that single-handedly or jointly with others makes decisions as to the purposes of and resources for the processing of personal data (e.g",
          "similarity_score": 0.6628
        },
        {
          "matched_policy_passage": "It is not always possible to completely protect data against third party access Information about the responsible party (referred to as the controller in the GDPR) The data processing controller on this website is: own. Cloud Gmb. HRathsbergstr 1790411 Nürnberg. Germany Phone: +49 911 14888690Email: hello[at]owncloud[dot]com The controller is the natural person or legal entity that single-handedly or jointly with others makes decisions as to the purposes of and resources for the processing of personal data (e.g names, email addresses, etc.)",
          "similarity_score": 0.6455
        }
      ],
      "10.": [
        {
          "matched_policy_passage": "Right to data portability You have the right to demand that we hand over any data we automatically process on the basis of your consent or in order to fulfil a contract be handed over to you or a third party in a commonly used, machine readable format If you should demand the direct transfer of the data to another controller, this will be done only if it is technically feasible SSL and/or TLS encryption For security reasons and to protect the transmission of confidential content, such as purchase orders or inquiries you submit to us as the website operator, this website uses either an SSL or a TLS encryption program You can recognize an encrypted connection by checking whether the address line of the browser switches from http:// to https:// and also by the appearance of the lock icon in the browser line",
          "similarity_score": 0.6187
        }
      ],
      "13.": [
        {
          "matched_policy_passage": "Scope and purpose of the collection of data. If you submit a job application to us, we will process any affiliated personal data (e.g contact and communications data, application documents, notes taken during job interviews, etc ), if they are required to make a decision concerning the establishment or an employment relationship The legal grounds for the aforementioned are 26 Federal Data Protection Act (BDSG-neu) according to German Law (Negotiation of an Employment Relationship), Art",
          "similarity_score": 0.6068
        }
      ]
    }
  },
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "This data comprises primarily technical information (e.g web browser, operating system or time the site was accessed) This information is recorded automatically when you access our website.What are the purposes we use your data for?A portion of the information is generated to guarantee the error free provision of the website Other data may be used to analyze your user patterns.What rights do you have as far as your information is concerned?You have the right to receive information about the source, recipients and purposes of your archived personal data at any time without having to pay a fee for such disclosures",
          "similarity_score": 0.6296
        },
        {
          "matched_policy_passage": "This also applies to any profiling based on these provisions To determine the legal basis, on which any processing of data is based, please consult this Data Protection Declaration If you log an objection, we will no longer process your affected personal data, unless we are in a position to present compelling protection worthy grounds for the processing of your data, that outweigh your interests, rights and freedoms or if the purpose of the processing is the claiming, exercising or defense of legal entitlements (objection pursuant to Art 21 Sect. 1 GDPR).If your personal data is being processed in order to engage in direct advertising, you have the right to at any time object to the processing of your affected personal data for the purposes of such advertising",
          "similarity_score": 0.7077
        },
        {
          "matched_policy_passage": "If you log an objection, we will no longer process your affected personal data, unless we are in a position to present compelling protection worthy grounds for the processing of your data, that outweigh your interests, rights and freedoms or if the purpose of the processing is the claiming, exercising or defense of legal entitlements (objection pursuant to Art 21 Sect. 1 GDPR).If your personal data is being processed in order to engage in direct advertising, you have the right to at any time object to the processing of your affected personal data for the purposes of such advertising This also applies to profiling to the extent that it is affiliated with such direct advertising If you object, your personal data will subsequently no longer be used for direct advertising purposes (objection pursuant to Art",
          "similarity_score": 0.6691
        },
        {
          "matched_policy_passage": "This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation.The information you have entered into the contact form shall remain with us until you ask us to eradicate the data, revoke your consent to the archiving of data or if the purpose for which the information is being archived no longer exists (e.g after we have concluded our response to your inquiry) This shall be without prejudice to any mandatory legal provisions in particular retention periods.Request by email, telephone or fax. If you contact us by email, telephone or fax, your request, including all resulting personal data (name, request) will be stored and processed by us for the purpose of processing your request We do not pass these data on without your consent.The processing of these data is based on Art",
          "similarity_score": 0.6224
        },
        {
          "matched_policy_passage": "To do so, all you are required to do is sent us an informal notification via email This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation.The data recorded during the registration process shall be stored by us as long as you are registered on our website Subsequently, such data shall be deleted This shall be without prejudice to mandatory statutory retention obligations",
          "similarity_score": 0.6206
        },
        {
          "matched_policy_passage": "This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation.The data recorded during the registration process shall be stored by us as long as you are registered on our website Subsequently, such data shall be deleted This shall be without prejudice to mandatory statutory retention obligations Analysis tools and advertising. Google Analytics. Parts of this website use functions of the web analysis service Google Analytics",
          "similarity_score": 0.6605
        },
        {
          "matched_policy_passage": "If it should be foreseeable that the retention of your data will be necessary after the retention period has expired (e.g due to imminent or pending litigation), the data shall not be deleted until the data have become irrelevant This shall be without prejudice to any other statutory retention periods Our social media appearances. Data processing through social networks. We maintain publicly available profiles in social networks",
          "similarity_score": 0.6078
        },
        {
          "matched_policy_passage": "due to imminent or pending litigation), the data shall not be deleted until the data have become irrelevant This shall be without prejudice to any other statutory retention periods Our social media appearances. Data processing through social networks. We maintain publicly available profiles in social networks The individual social networks we use can be found below.Social networks such as Facebook, Linked. In etc",
          "similarity_score": 0.6008
        },
        {
          "matched_policy_passage": "What are the purposes we use your data for?A portion of the information is generated to guarantee the error free provision of the website Other data may be used to analyze your user patterns What rights do you have as far as your information is concerned?You have the right to receive information about the source, recipients and purposes of your archived personal data at any time without having to pay a fee for such disclosures You also have the right to demand that your data are rectified, blocked or eradicated",
          "similarity_score": 0.6557
        },
        {
          "matched_policy_passage": "If you log an objection, we will no longer process your affected personal data, unless we are in a position to present compelling protection worthy grounds for the processing of your data, that outweigh your interests, rights and freedoms or if the purpose of the processing is the claiming, exercising or defense of legal entitlements (objection pursuant to Art If your personal data is being processed in order to engage in direct advertising, you have the right to at any time object to the processing of your affected personal data for the purposes of such advertising This also applies to profiling to the extent that it is affiliated with such direct advertising If you object, your personal data will subsequently no longer be used for direct advertising purposes (objection pursuant to Art",
          "similarity_score": 0.62
        },
        {
          "matched_policy_passage": "This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation The information you have entered into the contact form shall remain with us until you ask us to eradicate the data, revoke your consent to the archiving of data or if the purpose for which the information is being archived no longer exists (e.g after we have concluded our response to your inquiry) This shall be without prejudice to any mandatory legal provisions in particular retention periods",
          "similarity_score": 0.6823
        },
        {
          "matched_policy_passage": "The information you have entered into the contact form shall remain with us until you ask us to eradicate the data, revoke your consent to the archiving of data or if the purpose for which the information is being archived no longer exists (e.g after we have concluded our response to your inquiry) This shall be without prejudice to any mandatory legal provisions in particular retention periods Request by email, telephone or fax If you contact us by email, telephone or fax, your request, including all resulting personal data (name, request) will be stored and processed by us for the purpose of processing your request",
          "similarity_score": 0.6474
        },
        {
          "matched_policy_passage": "This shall be without prejudice to any mandatory legal provisions in particular retention periods Request by email, telephone or fax If you contact us by email, telephone or fax, your request, including all resulting personal data (name, request) will be stored and processed by us for the purpose of processing your request We do not pass these data on without your consent The processing of these data is based on Art",
          "similarity_score": 0.6343
        },
        {
          "matched_policy_passage": "This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation The data recorded during the registration process shall be stored by us as long as you are registered on our website Subsequently, such data shall be deleted This shall be without prejudice to mandatory statutory retention obligations",
          "similarity_score": 0.6803
        },
        {
          "matched_policy_passage": "The data recorded during the registration process shall be stored by us as long as you are registered on our website Subsequently, such data shall be deleted This shall be without prejudice to mandatory statutory retention obligations Analysis tools and advertising Parts of this website use functions of the web analysis service Google Analytics",
          "similarity_score": 0.6265
        },
        {
          "matched_policy_passage": "YOU HAVE THE OPTION TO OBJECT TO THIS STORAGE/RETENTION OF YOUR DATA IF YOU HAVE LEGITIMATE INTERESTS TO DO SO THAT OUTWEIGH OUR INTERESTS Once the retention period has expired, the data will be deleted, unless we are subject to any other statutory retention obligations or if any other legal grounds exist to continue to store the data If it should be foreseeable that the retention of your data will be necessary after the retention period has expired (e.g due to imminent or pending litigation), the data shall not be deleted until the data have become irrelevant",
          "similarity_score": 0.6104
        }
      ],
      "1.": [
        {
          "matched_policy_passage": "You also have the right to log a complaint with the competent supervising agency.Moreover, under certain circumstances, you have the right to demand the restriction of the processing of your personal data For details, please consult the Data Protection Declaration under section Right to Restriction of Data Processing.Analysis tools and tools provided by third parties. There is a possibility that your browsing patterns will be statistically analyzed when your visit our website Such analyses are performed primarily with cookies and with what we refer to as analysis programs As a rule, the analyses of your browsing patterns are conducted anonymously; i.e",
          "similarity_score": 0.6199
        },
        {
          "matched_policy_passage": "Below, we will brief you on the scope, purpose and use of the personal data collected from you in conjunction with the application process We assure you that the collection, processing and use of your data will occur in compliance with the applicable data privacy rights and all other statutory provisions and that your data will always be treated as strictly confidential.Scope and purpose of the collection of data. If you submit a job application to us, we will process any affiliated personal data (e.g contact and communications data, application documents, notes taken during job interviews, etc ), if they are required to make a decision concerning the establishment or an employment relationship",
          "similarity_score": 0.6598
        },
        {
          "matched_policy_passage": "Below, we will brief you on the scope, purpose and use of the personal data collected from you in conjunction with the application process We assure you that the collection, processing and use of your data will occur in compliance with the applicable data privacy rights and all other statutory provisions and that your data will always be treated as strictly confidential Scope and purpose of the collection of data. If you submit a job application to us, we will process any affiliated personal data (e.g contact and communications data, application documents, notes taken during job interviews, etc",
          "similarity_score": 0.6447
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "web browser, operating system or time the site was accessed) This information is recorded automatically when you access our website.What are the purposes we use your data for?A portion of the information is generated to guarantee the error free provision of the website Other data may be used to analyze your user patterns.What rights do you have as far as your information is concerned?You have the right to receive information about the source, recipients and purposes of your archived personal data at any time without having to pay a fee for such disclosures You also have the right to demand that your data are rectified, blocked or eradicated",
          "similarity_score": 0.6309
        },
        {
          "matched_policy_passage": "This information is recorded automatically when you access our website.What are the purposes we use your data for?A portion of the information is generated to guarantee the error free provision of the website Other data may be used to analyze your user patterns.What rights do you have as far as your information is concerned?You have the right to receive information about the source, recipients and purposes of your archived personal data at any time without having to pay a fee for such disclosures You also have the right to demand that your data are rectified, blocked or eradicated Please do not hesitate to contact us at any time under the address disclosed in section Imprint on this website if you have questions about this or any other data protection related issues",
          "similarity_score": 0.6453
        },
        {
          "matched_policy_passage": "If you have questions about this subject matter or any other questions about personal data, please do not hesitate to contact us at any time at the address provided in section Imprint.Right to demand processing restrictions. You have the right to demand the imposition of restrictions as far as the processing of your personal data is concerned To do so, you may contact us at any time at the address provided in section Imprint The right to demand restriction of processing applies in the following cases:In the event that you should dispute the correctness of your data archived by us, we will usually need some time to verify this claim During the time that this investigation is ongoing, you have the right to demand that we restrict the processing of your personal data.If the processing of your personal data was/is conducted in an unlawful manner, you have the option to demand the restriction of the processing of your data in lieu of demanding the eradication of this data.If we do not need your personal data any longer and you need it to exercise, defend or claim legal entitlements, you have the right to demand the restriction of the processing of your personal data instead of its eradication.If you have raised an objection pursuant to Art",
          "similarity_score": 0.625
        },
        {
          "matched_policy_passage": "Other data may be used to analyze your user patterns What rights do you have as far as your information is concerned?You have the right to receive information about the source, recipients and purposes of your archived personal data at any time without having to pay a fee for such disclosures You also have the right to demand that your data are rectified, blocked or eradicated Please do not hesitate to contact us at any time under the address disclosed in section Imprint on this website if you have questions about this or any other data protection related issues",
          "similarity_score": 0.7093
        },
        {
          "matched_policy_passage": "If the SSL or TLS encryption is activated, data you transmit to us cannot be read by third parties Information about, blockage, rectification and eradication of data Within the scope of the applicable statutory provisions, you have the right to at any time demand information about your archived personal data, their source and recipients as well as the purpose of the processing of your data You may also have a right to have your data rectified, blocked or eradicated If you have questions about this subject matter or any other questions about personal data, please do not hesitate to contact us at any time at the address provided in section Imprint",
          "similarity_score": 0.621
        },
        {
          "matched_policy_passage": "Information about, blockage, rectification and eradication of data Within the scope of the applicable statutory provisions, you have the right to at any time demand information about your archived personal data, their source and recipients as well as the purpose of the processing of your data You may also have a right to have your data rectified, blocked or eradicated If you have questions about this subject matter or any other questions about personal data, please do not hesitate to contact us at any time at the address provided in section Imprint Right to demand processing restrictions You have the right to demand the imposition of restrictions as far as the processing of your personal data is concerned",
          "similarity_score": 0.7262
        },
        {
          "matched_policy_passage": "You may also have a right to have your data rectified, blocked or eradicated If you have questions about this subject matter or any other questions about personal data, please do not hesitate to contact us at any time at the address provided in section Imprint Right to demand processing restrictions You have the right to demand the imposition of restrictions as far as the processing of your personal data is concerned To do so, you may contact us at any time at the address provided in section Imprint",
          "similarity_score": 0.6035
        },
        {
          "matched_policy_passage": "If you have questions about this subject matter or any other questions about personal data, please do not hesitate to contact us at any time at the address provided in section Imprint Right to demand processing restrictions You have the right to demand the imposition of restrictions as far as the processing of your personal data is concerned To do so, you may contact us at any time at the address provided in section Imprint The right to demand restriction of processing applies in the following cases: In the event that you should dispute the correctness of your data archived by us, we will usually need some time to verify this claim",
          "similarity_score": 0.633
        }
      ]
    }
  },
  {
    "article_number": 77,
    "article_title": "Right to lodge a complaint with a supervisory authority",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Other data may be used to analyze your user patterns.What rights do you have as far as your information is concerned?You have the right to receive information about the source, recipients and purposes of your archived personal data at any time without having to pay a fee for such disclosures You also have the right to demand that your data are rectified, blocked or eradicated Please do not hesitate to contact us at any time under the address disclosed in section Imprint on this website if you have questions about this or any other data protection related issues You also have the right to log a complaint with the competent supervising agency.Moreover, under certain circumstances, you have the right to demand the restriction of the processing of your personal data",
          "similarity_score": 0.7115
        },
        {
          "matched_policy_passage": "You also have the right to demand that your data are rectified, blocked or eradicated Please do not hesitate to contact us at any time under the address disclosed in section Imprint on this website if you have questions about this or any other data protection related issues You also have the right to log a complaint with the competent supervising agency.Moreover, under certain circumstances, you have the right to demand the restriction of the processing of your personal data For details, please consult the Data Protection Declaration under section Right to Restriction of Data Processing.Analysis tools and tools provided by third parties. There is a possibility that your browsing patterns will be statistically analyzed when your visit our website",
          "similarity_score": 0.6688
        },
        {
          "matched_policy_passage": "This also applies to profiling to the extent that it is affiliated with such direct advertising If you object, your personal data will subsequently no longer be used for direct advertising purposes (objection pursuant to Art 21 Sect. 2 GDPR).Right to log a complaint with the competent supervisory agency. In the event of violations of the GDPR, data subjects are entitled to log a complaint with a supervisory agency, in particular in the member state where they usually maintain their domicile, place of work or at the place where the alleged violation occurred The right to log a complaint is in effect regardless of any other administrative or court proceedings available as legal recourses.Right to data portability. You have the right to demand that we hand over any data we automatically process on the basis of your consent or in order to fulfil a contract be handed over to you or a third party in a commonly used, machine readable format",
          "similarity_score": 0.7352
        },
        {
          "matched_policy_passage": "If you object, your personal data will subsequently no longer be used for direct advertising purposes (objection pursuant to Art 21 Sect. 2 GDPR).Right to log a complaint with the competent supervisory agency. In the event of violations of the GDPR, data subjects are entitled to log a complaint with a supervisory agency, in particular in the member state where they usually maintain their domicile, place of work or at the place where the alleged violation occurred The right to log a complaint is in effect regardless of any other administrative or court proceedings available as legal recourses.Right to data portability. You have the right to demand that we hand over any data we automatically process on the basis of your consent or in order to fulfil a contract be handed over to you or a third party in a commonly used, machine readable format If you should demand the direct transfer of the data to another controller, this will be done only if it is technically feasible.SSL and/or TLS encryption. For security reasons and to protect the transmission of confidential content, such as purchase orders or inquiries you submit to us as the website operator, this website uses either an SSL or a TLS encryption program",
          "similarity_score": 0.7634
        },
        {
          "matched_policy_passage": "21 Sect. 2 GDPR).Right to log a complaint with the competent supervisory agency. In the event of violations of the GDPR, data subjects are entitled to log a complaint with a supervisory agency, in particular in the member state where they usually maintain their domicile, place of work or at the place where the alleged violation occurred The right to log a complaint is in effect regardless of any other administrative or court proceedings available as legal recourses.Right to data portability. You have the right to demand that we hand over any data we automatically process on the basis of your consent or in order to fulfil a contract be handed over to you or a third party in a commonly used, machine readable format If you should demand the direct transfer of the data to another controller, this will be done only if it is technically feasible.SSL and/or TLS encryption. For security reasons and to protect the transmission of confidential content, such as purchase orders or inquiries you submit to us as the website operator, this website uses either an SSL or a TLS encryption program You can recognize an encrypted connection by checking whether the address line of the browser switches from http:// to https:// and also by the appearance of the lock icon in the browser line.If the SSL or TLS encryption is activated, data you transmit to us cannot be read by third parties.Information about, blockage, rectification and eradication of data. Within the scope of the applicable statutory provisions, you have the right to at any time demand information about your archived personal data, their source and recipients as well as the purpose of the processing of your data",
          "similarity_score": 0.7549
        },
        {
          "matched_policy_passage": "The right to log a complaint is in effect regardless of any other administrative or court proceedings available as legal recourses.Right to data portability. You have the right to demand that we hand over any data we automatically process on the basis of your consent or in order to fulfil a contract be handed over to you or a third party in a commonly used, machine readable format If you should demand the direct transfer of the data to another controller, this will be done only if it is technically feasible.SSL and/or TLS encryption. For security reasons and to protect the transmission of confidential content, such as purchase orders or inquiries you submit to us as the website operator, this website uses either an SSL or a TLS encryption program You can recognize an encrypted connection by checking whether the address line of the browser switches from http:// to https:// and also by the appearance of the lock icon in the browser line.If the SSL or TLS encryption is activated, data you transmit to us cannot be read by third parties.Information about, blockage, rectification and eradication of data. Within the scope of the applicable statutory provisions, you have the right to at any time demand information about your archived personal data, their source and recipients as well as the purpose of the processing of your data You may also have a right to have your data rectified, blocked or eradicated",
          "similarity_score": 0.7043
        },
        {
          "matched_policy_passage": "What rights do you have as far as your information is concerned?You have the right to receive information about the source, recipients and purposes of your archived personal data at any time without having to pay a fee for such disclosures You also have the right to demand that your data are rectified, blocked or eradicated Please do not hesitate to contact us at any time under the address disclosed in section Imprint on this website if you have questions about this or any other data protection related issues You also have the right to log a complaint with the competent supervising agency",
          "similarity_score": 0.6982
        },
        {
          "matched_policy_passage": "You also have the right to demand that your data are rectified, blocked or eradicated Please do not hesitate to contact us at any time under the address disclosed in section Imprint on this website if you have questions about this or any other data protection related issues You also have the right to log a complaint with the competent supervising agency Moreover, under certain circumstances, you have the right to demand the restriction of the processing of your personal data",
          "similarity_score": 0.7103
        },
        {
          "matched_policy_passage": "Please do not hesitate to contact us at any time under the address disclosed in section Imprint on this website if you have questions about this or any other data protection related issues You also have the right to log a complaint with the competent supervising agency Moreover, under certain circumstances, you have the right to demand the restriction of the processing of your personal data For details, please consult the Data Protection Declaration under section Right to Restriction of Data Processing",
          "similarity_score": 0.6681
        },
        {
          "matched_policy_passage": "You also have the right to log a complaint with the competent supervising agency Moreover, under certain circumstances, you have the right to demand the restriction of the processing of your personal data For details, please consult the Data Protection Declaration under section Right to Restriction of Data Processing Analysis tools and tools provided by third parties There is a possibility that your browsing patterns will be statistically analyzed when your visit our website",
          "similarity_score": 0.7266
        },
        {
          "matched_policy_passage": "If your personal data is being processed in order to engage in direct advertising, you have the right to at any time object to the processing of your affected personal data for the purposes of such advertising This also applies to profiling to the extent that it is affiliated with such direct advertising If you object, your personal data will subsequently no longer be used for direct advertising purposes (objection pursuant to Art Right to log a complaint with the competent supervisory agency In the event of violations of the GDPR, data subjects are entitled to log a complaint with a supervisory agency, in particular in the member state where they usually maintain their domicile, place of work or at the place where the alleged violation occurred",
          "similarity_score": 0.711
        },
        {
          "matched_policy_passage": "This also applies to profiling to the extent that it is affiliated with such direct advertising If you object, your personal data will subsequently no longer be used for direct advertising purposes (objection pursuant to Art Right to log a complaint with the competent supervisory agency In the event of violations of the GDPR, data subjects are entitled to log a complaint with a supervisory agency, in particular in the member state where they usually maintain their domicile, place of work or at the place where the alleged violation occurred The right to log a complaint is in effect regardless of any other administrative or court proceedings available as legal recourses",
          "similarity_score": 0.7807
        },
        {
          "matched_policy_passage": "If you object, your personal data will subsequently no longer be used for direct advertising purposes (objection pursuant to Art Right to log a complaint with the competent supervisory agency In the event of violations of the GDPR, data subjects are entitled to log a complaint with a supervisory agency, in particular in the member state where they usually maintain their domicile, place of work or at the place where the alleged violation occurred The right to log a complaint is in effect regardless of any other administrative or court proceedings available as legal recourses Right to data portability You have the right to demand that we hand over any data we automatically process on the basis of your consent or in order to fulfil a contract be handed over to you or a third party in a commonly used, machine readable format",
          "similarity_score": 0.8157
        },
        {
          "matched_policy_passage": "Right to log a complaint with the competent supervisory agency In the event of violations of the GDPR, data subjects are entitled to log a complaint with a supervisory agency, in particular in the member state where they usually maintain their domicile, place of work or at the place where the alleged violation occurred The right to log a complaint is in effect regardless of any other administrative or court proceedings available as legal recourses Right to data portability You have the right to demand that we hand over any data we automatically process on the basis of your consent or in order to fulfil a contract be handed over to you or a third party in a commonly used, machine readable format If you should demand the direct transfer of the data to another controller, this will be done only if it is technically feasible",
          "similarity_score": 0.8229
        },
        {
          "matched_policy_passage": "The right to log a complaint is in effect regardless of any other administrative or court proceedings available as legal recourses Right to data portability You have the right to demand that we hand over any data we automatically process on the basis of your consent or in order to fulfil a contract be handed over to you or a third party in a commonly used, machine readable format If you should demand the direct transfer of the data to another controller, this will be done only if it is technically feasible SSL and/or TLS encryption For security reasons and to protect the transmission of confidential content, such as purchase orders or inquiries you submit to us as the website operator, this website uses either an SSL or a TLS encryption program",
          "similarity_score": 0.7211
        }
      ]
    }
  },
  {
    "article_number": 89,
    "article_title": "Safeguards and derogations relating to processing for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Please do not hesitate to contact us at any time under the address disclosed in section Imprint on this website if you have questions about this or any other data protection related issues You also have the right to log a complaint with the competent supervising agency.Moreover, under certain circumstances, you have the right to demand the restriction of the processing of your personal data For details, please consult the Data Protection Declaration under section Right to Restriction of Data Processing.Analysis tools and tools provided by third parties. There is a possibility that your browsing patterns will be statistically analyzed when your visit our website Such analyses are performed primarily with cookies and with what we refer to as analysis programs",
          "similarity_score": 0.6309
        },
        {
          "matched_policy_passage": "The analysis processes initiated by the social networks may be based on divergent legal bases to be specified by the operators of the social networks (e.g consent within the meaning of Art a GDPR).Responsibility and assertion of rights. If you visit one of our social media sites (e.g., Facebook), we, together with the operator of the social media platform, are responsible for the data processing operations triggered during this visit You can in principle protect your rights (information, correction, deletion, limitation of processing, data portability and complaint) vis-à-vis us as well as vis-à-vis the operator of the respective social media portal (e.g",
          "similarity_score": 0.6376
        }
      ]
    }
  },
  {
    "article_number": 70,
    "article_title": "Tasks of the Board",
    "matches": {
      "24.": [
        {
          "matched_policy_passage": "the browsing patterns cannot be traced back to you.You have the option to object to such analyses or you can prevent their performance by not using certain tools For detailed information about the tools and about your options to object, please consult our Data Protection Declaration below General information and mandatory information. Data protection. The operators of this website and its pages take the protection of your personal data very seriously Hence, we handle your personal data as confidential information and in compliance with the statutory data protection regulations and this Data Protection Declaration.Whenever you use this website, a variety of personal information will be collected",
          "similarity_score": 0.6512
        },
        {
          "matched_policy_passage": "For detailed information about the tools and about your options to object, please consult our Data Protection Declaration below General information and mandatory information. Data protection. The operators of this website and its pages take the protection of your personal data very seriously Hence, we handle your personal data as confidential information and in compliance with the statutory data protection regulations and this Data Protection Declaration.Whenever you use this website, a variety of personal information will be collected Personal data comprises data that can be used to personally identify you",
          "similarity_score": 0.7029
        },
        {
          "matched_policy_passage": "An overview of data protection The following information will provide you with an easy to navigate overview of what will happen with your personal data when you visit our website The term personal data comprises all data that can be used to personally identify you For detailed information about the subject matter of data protection, please consult our Data Protection Declaration, which we have included beneath this copy Data recording on our website Who is the responsible party for the recording of data on this website (i.e",
          "similarity_score": 0.6327
        },
        {
          "matched_policy_passage": "For detailed information about the tools and about your options to object, please consult our Data Protection Declaration below General information and mandatory information The operators of this website and its pages take the protection of your personal data very seriously Hence, we handle your personal data as confidential information and in compliance with the statutory data protection regulations and this Data Protection Declaration Whenever you use this website, a variety of personal information will be collected",
          "similarity_score": 0.6985
        },
        {
          "matched_policy_passage": "General information and mandatory information The operators of this website and its pages take the protection of your personal data very seriously Hence, we handle your personal data as confidential information and in compliance with the statutory data protection regulations and this Data Protection Declaration Whenever you use this website, a variety of personal information will be collected Personal data comprises data that can be used to personally identify you",
          "similarity_score": 0.6235
        }
      ]
    }
  },
  {
    "article_number": 47,
    "article_title": "Binding corporate rules",
    "matches": {
      "9.": [
        {
          "matched_policy_passage": "General information and mandatory information. Data protection. The operators of this website and its pages take the protection of your personal data very seriously Hence, we handle your personal data as confidential information and in compliance with the statutory data protection regulations and this Data Protection Declaration.Whenever you use this website, a variety of personal information will be collected Personal data comprises data that can be used to personally identify you This Data Protection Declaration explains which data we collect as well as the purposes we use this data for",
          "similarity_score": 0.7041
        },
        {
          "matched_policy_passage": "You have the option to object to such analyses or you can prevent their performance by not using certain tools For detailed information about the tools and about your options to object, please consult our Data Protection Declaration below General information and mandatory information The operators of this website and its pages take the protection of your personal data very seriously Hence, we handle your personal data as confidential information and in compliance with the statutory data protection regulations and this Data Protection Declaration",
          "similarity_score": 0.6936
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "To determine the legal basis, on which any processing of data is based, please consult this Data Protection Declaration If you log an objection, we will no longer process your affected personal data, unless we are in a position to present compelling protection worthy grounds for the processing of your data, that outweigh your interests, rights and freedoms or if the purpose of the processing is the claiming, exercising or defense of legal entitlements (objection pursuant to Art 21 Sect. 1 GDPR).If your personal data is being processed in order to engage in direct advertising, you have the right to at any time object to the processing of your affected personal data for the purposes of such advertising This also applies to profiling to the extent that it is affiliated with such direct advertising",
          "similarity_score": 0.7412
        },
        {
          "matched_policy_passage": "To determine the legal basis, on which any processing of data is based, please consult this Data Protection Declaration If you log an objection, we will no longer process your affected personal data, unless we are in a position to present compelling protection worthy grounds for the processing of your data, that outweigh your interests, rights and freedoms or if the purpose of the processing is the claiming, exercising or defense of legal entitlements (objection pursuant to Art If your personal data is being processed in order to engage in direct advertising, you have the right to at any time object to the processing of your affected personal data for the purposes of such advertising This also applies to profiling to the extent that it is affiliated with such direct advertising",
          "similarity_score": 0.7541
        }
      ]
    }
  },
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "Hence, we handle your personal data as confidential information and in compliance with the statutory data protection regulations and this Data Protection Declaration.Whenever you use this website, a variety of personal information will be collected Personal data comprises data that can be used to personally identify you This Data Protection Declaration explains which data we collect as well as the purposes we use this data for It also explains how, and for which purpose the information is collected.We herewith advise you that the transmission of data via the Internet (i.e",
          "similarity_score": 0.6611
        },
        {
          "matched_policy_passage": "Personal data comprises data that can be used to personally identify you This Data Protection Declaration explains which data we collect as well as the purposes we use this data for It also explains how, and for which purpose the information is collected.We herewith advise you that the transmission of data via the Internet (i.e through email communications) may be prone to security gaps",
          "similarity_score": 0.6886
        },
        {
          "matched_policy_passage": "Hence, we handle your personal data as confidential information and in compliance with the statutory data protection regulations and this Data Protection Declaration Whenever you use this website, a variety of personal information will be collected Personal data comprises data that can be used to personally identify you This Data Protection Declaration explains which data we collect as well as the purposes we use this data for",
          "similarity_score": 0.6889
        },
        {
          "matched_policy_passage": "Whenever you use this website, a variety of personal information will be collected Personal data comprises data that can be used to personally identify you This Data Protection Declaration explains which data we collect as well as the purposes we use this data for It also explains how, and for which purpose the information is collected",
          "similarity_score": 0.6931
        },
        {
          "matched_policy_passage": "Personal data comprises data that can be used to personally identify you This Data Protection Declaration explains which data we collect as well as the purposes we use this data for It also explains how, and for which purpose the information is collected We herewith advise you that the transmission of data via the Internet (i.e",
          "similarity_score": 0.7133
        }
      ]
    }
  },
  {
    "article_number": 34,
    "article_title": "Communication of a personal data breach to the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "This Data Protection Declaration explains which data we collect as well as the purposes we use this data for It also explains how, and for which purpose the information is collected.We herewith advise you that the transmission of data via the Internet (i.e through email communications) may be prone to security gaps It is not always possible to completely protect data against third party access.Information about the responsible party (referred to as the controller in the GDPR)The data processing controller on this website is:own. Cloud Gmb. HRathsbergstr",
          "similarity_score": 0.6355
        },
        {
          "matched_policy_passage": "This Data Protection Declaration explains which data we collect as well as the purposes we use this data for It also explains how, and for which purpose the information is collected We herewith advise you that the transmission of data via the Internet (i.e through email communications) may be prone to security gaps",
          "similarity_score": 0.6327
        },
        {
          "matched_policy_passage": "It also explains how, and for which purpose the information is collected We herewith advise you that the transmission of data via the Internet (i.e through email communications) may be prone to security gaps It is not always possible to completely protect data against third party access",
          "similarity_score": 0.6273
        },
        {
          "matched_policy_passage": "We herewith advise you that the transmission of data via the Internet (i.e through email communications) may be prone to security gaps It is not always possible to completely protect data against third party access Information about the responsible party (referred to as the controller in the GDPR) The data processing controller on this website is: own. Cloud Gmb. HRathsbergstr",
          "similarity_score": 0.6293
        }
      ]
    }
  },
  {
    "article_number": 19,
    "article_title": "Notification obligation regarding rectification or erasure of personal data or restriction of processing",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "It also explains how, and for which purpose the information is collected.We herewith advise you that the transmission of data via the Internet (i.e through email communications) may be prone to security gaps It is not always possible to completely protect data against third party access.Information about the responsible party (referred to as the controller in the GDPR)The data processing controller on this website is:own. Cloud Gmb. HRathsbergstr 1790411 Nürnberg. Germany. Phone: +49 911 14888690Email: hello[at]owncloud[dot]com. The controller is the natural person or legal entity that single-handedly or jointly with others makes decisions as to the purposes of and resources for the processing of personal data (e.g",
          "similarity_score": 0.676
        },
        {
          "matched_policy_passage": "b GDPR, if your request is related to the execution of a contract or if it is necessary to carry out pre-contractual measures In all other cases, the processing is based on your consent (Art 6 Sect. 1 a GDPR) and/or on our legitimate interests (Art. 6 Sect. 1 lit f GDPR), since we have a legitimate interest in the effective processing of requests addressed to us.The data sent by you to us via contact requests remain with us until you request us to delete, revoke your consent to the storage or the purpose for the data storage lapses (e.g",
          "similarity_score": 0.6056
        },
        {
          "matched_policy_passage": "6 Sect. 1 a GDPR) and/or on our legitimate interests (Art. 6 Sect. 1 lit f GDPR), since we have a legitimate interest in the effective processing of requests addressed to us.The data sent by you to us via contact requests remain with us until you request us to delete, revoke your consent to the storage or the purpose for the data storage lapses (e.g after completion of your request) Mandatory statutory provisions in particular statutory retention periods remain unaffected.Registration on this website. You have the option to register on our website to be able to use additional website functions",
          "similarity_score": 0.6058
        },
        {
          "matched_policy_passage": "f GDPR), since we have a legitimate interest in the effective processing of requests addressed to us.The data sent by you to us via contact requests remain with us until you request us to delete, revoke your consent to the storage or the purpose for the data storage lapses (e.g after completion of your request) Mandatory statutory provisions in particular statutory retention periods remain unaffected.Registration on this website. You have the option to register on our website to be able to use additional website functions We shall use the data you enter only for the purpose of using the respective offer or service you have registered for",
          "similarity_score": 0.6194
        },
        {
          "matched_policy_passage": "Information about the responsible party (referred to as the controller in the GDPR) The data processing controller on this website is: own. Cloud Gmb. HRathsbergstr 1790411 Nürnberg. Germany Phone: +49 911 14888690Email: hello[at]owncloud[dot]com The controller is the natural person or legal entity that single-handedly or jointly with others makes decisions as to the purposes of and resources for the processing of personal data (e.g names, email addresses, etc.) Revocation of your consent to the processing of data A wide range of data processing transactions are possible only subject to your express consent",
          "similarity_score": 0.6825
        }
      ]
    }
  },
  {
    "article_number": 37,
    "article_title": "Designation of the data protection officer",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "through email communications) may be prone to security gaps It is not always possible to completely protect data against third party access.Information about the responsible party (referred to as the controller in the GDPR)The data processing controller on this website is:own. Cloud Gmb. HRathsbergstr 1790411 Nürnberg. Germany. Phone: +49 911 14888690Email: hello[at]owncloud[dot]com. The controller is the natural person or legal entity that single-handedly or jointly with others makes decisions as to the purposes of and resources for the processing of personal data (e.g names, email addresses, etc",
          "similarity_score": 0.6821
        }
      ]
    }
  },
  {
    "article_number": 14,
    "article_title": "Information to be provided where personal data have not been obtained from the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "1790411 Nürnberg. Germany. Phone: +49 911 14888690Email: hello[at]owncloud[dot]com. The controller is the natural person or legal entity that single-handedly or jointly with others makes decisions as to the purposes of and resources for the processing of personal data (e.g names, email addresses, etc ).Revocation of your consent to the processing of data. A wide range of data processing transactions are possible only subject to your express consent You can also revoke at any time any consent you have already given us",
          "similarity_score": 0.6776
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "names, email addresses, etc ).Revocation of your consent to the processing of data. A wide range of data processing transactions are possible only subject to your express consent You can also revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email",
          "similarity_score": 0.6111
        },
        {
          "matched_policy_passage": "We will not share this information without your consent.Hence, the processing of the data entered into the contact form occurs exclusively based on your consent (Art You have the right to revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation.The information you have entered into the contact form shall remain with us until you ask us to eradicate the data, revoke your consent to the archiving of data or if the purpose for which the information is being archived no longer exists (e.g",
          "similarity_score": 0.6455
        },
        {
          "matched_policy_passage": "You have the right to revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation.The data recorded during the registration process shall be stored by us as long as you are registered on our website Subsequently, such data shall be deleted",
          "similarity_score": 0.6449
        },
        {
          "matched_policy_passage": "names, email addresses, etc.) Revocation of your consent to the processing of data A wide range of data processing transactions are possible only subject to your express consent You can also revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email",
          "similarity_score": 0.6146
        },
        {
          "matched_policy_passage": "Revocation of your consent to the processing of data A wide range of data processing transactions are possible only subject to your express consent You can also revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation",
          "similarity_score": 0.6197
        },
        {
          "matched_policy_passage": "We shall process the data entered during the registration process on the basis of your consent (Art You have the right to revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation",
          "similarity_score": 0.6565
        },
        {
          "matched_policy_passage": "You have the right to revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation The data recorded during the registration process shall be stored by us as long as you are registered on our website",
          "similarity_score": 0.6082
        }
      ],
      "2.": [
        {
          "matched_policy_passage": ").Revocation of your consent to the processing of data. A wide range of data processing transactions are possible only subject to your express consent You can also revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation.Right to object to the collection of data in special cases; right to object to direct advertising (Art",
          "similarity_score": 0.6419
        },
        {
          "matched_policy_passage": "In order to achieve this, server log files must be recorded.Contact form. If you submit inquiries to us via our contact form, the information provided in the contact form as well as any contact information provided therein will be stored by us in order to handle your inquiry and in the event that we have further questions We will not share this information without your consent.Hence, the processing of the data entered into the contact form occurs exclusively based on your consent (Art You have the right to revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email",
          "similarity_score": 0.6114
        },
        {
          "matched_policy_passage": "), if they are required to make a decision concerning the establishment or an employment relationship The legal grounds for the aforementioned are 26 Federal Data Protection Act (BDSG-neu) according to German Law (Negotiation of an Employment Relationship), Art b GDPR (General Contract Negotiations) and provided you have given us your consent Art You may revoke any consent given at any time",
          "similarity_score": 0.6346
        },
        {
          "matched_policy_passage": "We will not share this information without your consent Hence, the processing of the data entered into the contact form occurs exclusively based on your consent (Art You have the right to revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email",
          "similarity_score": 0.643
        },
        {
          "matched_policy_passage": "Hence, the processing of the data entered into the contact form occurs exclusively based on your consent (Art You have the right to revoke at any time any consent you have already given us To do so, all you are required to do is sent us an informal notification via email This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation",
          "similarity_score": 0.6509
        }
      ]
    }
  },
  {
    "article_number": 86,
    "article_title": "Processing and public access to official documents",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "To do so, all you are required to do is sent us an informal notification via email This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation.Right to object to the collection of data in special cases; right to object to direct advertising (Art 21 GDPR)In the event that data are processed on the basis of Art. 6 Sect. 1 lit e or f GDPR, you have the right to at any time object to the processing of your personal data based on grounds arising from your unique situation",
          "similarity_score": 0.6287
        }
      ]
    }
  },
  {
    "article_number": 16,
    "article_title": "Right to rectification",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation.Right to object to the collection of data in special cases; right to object to direct advertising (Art 21 GDPR)In the event that data are processed on the basis of Art. 6 Sect. 1 lit e or f GDPR, you have the right to at any time object to the processing of your personal data based on grounds arising from your unique situation This also applies to any profiling based on these provisions",
          "similarity_score": 0.6878
        },
        {
          "matched_policy_passage": "This shall be without prejudice to the lawfulness of any data collection that occurred prior to your revocation Right to object to the collection of data in special cases; right to object to direct advertising (Art 21 GDPR) In the event that data are processed on the basis of Art. 6 Sect. 1 lit e or f GDPR, you have the right to at any time object to the processing of your personal data based on grounds arising from your unique situation",
          "similarity_score": 0.6809
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "12.": [
        {
          "matched_policy_passage": "21 GDPR)In the event that data are processed on the basis of Art. 6 Sect. 1 lit e or f GDPR, you have the right to at any time object to the processing of your personal data based on grounds arising from your unique situation This also applies to any profiling based on these provisions To determine the legal basis, on which any processing of data is based, please consult this Data Protection Declaration",
          "similarity_score": 0.6712
        },
        {
          "matched_policy_passage": "e or f GDPR, you have the right to at any time object to the processing of your personal data based on grounds arising from your unique situation This also applies to any profiling based on these provisions To determine the legal basis, on which any processing of data is based, please consult this Data Protection Declaration If you log an objection, we will no longer process your affected personal data, unless we are in a position to present compelling protection worthy grounds for the processing of your data, that outweigh your interests, rights and freedoms or if the purpose of the processing is the claiming, exercising or defense of legal entitlements (objection pursuant to Art",
          "similarity_score": 0.6881
        },
        {
          "matched_policy_passage": "This shall be without prejudice to any mandatory legal provisions in particular retention periods.Request by email, telephone or fax. If you contact us by email, telephone or fax, your request, including all resulting personal data (name, request) will be stored and processed by us for the purpose of processing your request We do not pass these data on without your consent.The processing of these data is based on Art b GDPR, if your request is related to the execution of a contract or if it is necessary to carry out pre-contractual measures In all other cases, the processing is based on your consent (Art",
          "similarity_score": 0.6408
        },
        {
          "matched_policy_passage": "We do not pass these data on without your consent.The processing of these data is based on Art b GDPR, if your request is related to the execution of a contract or if it is necessary to carry out pre-contractual measures In all other cases, the processing is based on your consent (Art 6 Sect. 1 a GDPR) and/or on our legitimate interests (Art. 6 Sect. 1 lit",
          "similarity_score": 0.6192
        },
        {
          "matched_policy_passage": "21 GDPR) In the event that data are processed on the basis of Art. 6 Sect. 1 lit e or f GDPR, you have the right to at any time object to the processing of your personal data based on grounds arising from your unique situation This also applies to any profiling based on these provisions To determine the legal basis, on which any processing of data is based, please consult this Data Protection Declaration",
          "similarity_score": 0.6712
        },
        {
          "matched_policy_passage": "The processing of these data is based on Art b GDPR, if your request is related to the execution of a contract or if it is necessary to carry out pre-contractual measures In all other cases, the processing is based on your consent (Art 6 Sect. 1 a GDPR) and/or on our legitimate interests (Art. 6 Sect. 1 lit",
          "similarity_score": 0.6027
        },
        {
          "matched_policy_passage": "We assure you that the collection, processing and use of your data will occur in compliance with the applicable data privacy rights and all other statutory provisions and that your data will always be treated as strictly confidential Scope and purpose of the collection of data. If you submit a job application to us, we will process any affiliated personal data (e.g contact and communications data, application documents, notes taken during job interviews, etc ), if they are required to make a decision concerning the establishment or an employment relationship",
          "similarity_score": 0.6603
        }
      ],
      "2.": [
        {
          "matched_policy_passage": "If you submit inquiries to us via our contact form, the information provided in the contact form as well as any contact information provided therein will be stored by us in order to handle your inquiry and in the event that we have further questions We will not share this information without your consent Hence, the processing of the data entered into the contact form occurs exclusively based on your consent (Art You have the right to revoke at any time any consent you have already given us",
          "similarity_score": 0.6108
        },
        {
          "matched_policy_passage": "We do not pass these data on without your consent The processing of these data is based on Art b GDPR, if your request is related to the execution of a contract or if it is necessary to carry out pre-contractual measures In all other cases, the processing is based on your consent (Art",
          "similarity_score": 0.6493
        },
        {
          "matched_policy_passage": "In all other cases, the processing is based on your consent (Art 6 Sect. 1 a GDPR) and/or on our legitimate interests (Art. 6 Sect. 1 lit f GDPR), since we have a legitimate interest in the effective processing of requests addressed to us The data sent by you to us via contact requests remain with us until you request us to delete, revoke your consent to the storage or the purpose for the data storage lapses (e.g",
          "similarity_score": 0.6485
        },
        {
          "matched_policy_passage": "You may revoke any consent given at any time Within our company, your personal data will only be shared with individuals who are involved in the processing of your job application If your job application should result in your recruitment, the data you have submitted will be archived on the grounds of 26 Federal Data Protection Act (BDSG-neu) and Art b GDPR for the purpose of implementing the employment relationship in our data processing system",
          "similarity_score": 0.6436
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "Contract data processing. We have executed a contract data processing agreement with Google and are implementing the stringent provisions of the German data protection agencies to the fullest when using Google Analytics Demographic parameters provided by Google Analytics. This website uses the function demographic parameters provided by Google Analytics It makes it possible to generate reports providing information on the age, gender and interests of website visitors The sources of this information are interest-related advertising by Google as well as visitor data obtained from third party providers",
          "similarity_score": 0.6073
        }
      ]
    }
  },
  {
    "article_number": 21,
    "article_title": "Right to object",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "21 Sect. 1 GDPR).If your personal data is being processed in order to engage in direct advertising, you have the right to at any time object to the processing of your affected personal data for the purposes of such advertising This also applies to profiling to the extent that it is affiliated with such direct advertising If you object, your personal data will subsequently no longer be used for direct advertising purposes (objection pursuant to Art 21 Sect. 2 GDPR).Right to log a complaint with the competent supervisory agency. In the event of violations of the GDPR, data subjects are entitled to log a complaint with a supervisory agency, in particular in the member state where they usually maintain their domicile, place of work or at the place where the alleged violation occurred",
          "similarity_score": 0.6504
        },
        {
          "matched_policy_passage": "Right to object to the collection of data in special cases; right to object to direct advertising (Art 21 GDPR) In the event that data are processed on the basis of Art. 6 Sect. 1 lit e or f GDPR, you have the right to at any time object to the processing of your personal data based on grounds arising from your unique situation This also applies to any profiling based on these provisions",
          "similarity_score": 0.6557
        }
      ]
    }
  },
  {
    "article_number": 18,
    "article_title": "Right to restriction of processing",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "You may also have a right to have your data rectified, blocked or eradicated If you have questions about this subject matter or any other questions about personal data, please do not hesitate to contact us at any time at the address provided in section Imprint.Right to demand processing restrictions. You have the right to demand the imposition of restrictions as far as the processing of your personal data is concerned To do so, you may contact us at any time at the address provided in section Imprint The right to demand restriction of processing applies in the following cases:In the event that you should dispute the correctness of your data archived by us, we will usually need some time to verify this claim",
          "similarity_score": 0.6265
        },
        {
          "matched_policy_passage": "To do so, you may contact us at any time at the address provided in section Imprint The right to demand restriction of processing applies in the following cases:In the event that you should dispute the correctness of your data archived by us, we will usually need some time to verify this claim During the time that this investigation is ongoing, you have the right to demand that we restrict the processing of your personal data.If the processing of your personal data was/is conducted in an unlawful manner, you have the option to demand the restriction of the processing of your data in lieu of demanding the eradication of this data.If we do not need your personal data any longer and you need it to exercise, defend or claim legal entitlements, you have the right to demand the restriction of the processing of your personal data instead of its eradication.If you have raised an objection pursuant to Art 21 Sect. 1 GDPR, your rights and our rights will have to be weighed against each other",
          "similarity_score": 0.7105
        },
        {
          "matched_policy_passage": "The right to demand restriction of processing applies in the following cases:In the event that you should dispute the correctness of your data archived by us, we will usually need some time to verify this claim During the time that this investigation is ongoing, you have the right to demand that we restrict the processing of your personal data.If the processing of your personal data was/is conducted in an unlawful manner, you have the option to demand the restriction of the processing of your data in lieu of demanding the eradication of this data.If we do not need your personal data any longer and you need it to exercise, defend or claim legal entitlements, you have the right to demand the restriction of the processing of your personal data instead of its eradication.If you have raised an objection pursuant to Art 21 Sect. 1 GDPR, your rights and our rights will have to be weighed against each other As long as it has not been determined whose interests prevail, you have the right to demand a restriction of the processing of your personal data.If you have restricted the processing of your personal data, these data with the exception of their archiving may be processed only subject to your consent or to claim, exercise or defend legal entitlements or to protect the rights of other natural persons or legal entities or for important public interest reasons cited by the European Union or a member state of the EU.Rejection of unsolicited emails. We herewith object to the use of contact information published in conjunction with the mandatory information to be provided in section Imprint to send us promotional and information material that we have not expressly requested",
          "similarity_score": 0.759
        },
        {
          "matched_policy_passage": "During the time that this investigation is ongoing, you have the right to demand that we restrict the processing of your personal data.If the processing of your personal data was/is conducted in an unlawful manner, you have the option to demand the restriction of the processing of your data in lieu of demanding the eradication of this data.If we do not need your personal data any longer and you need it to exercise, defend or claim legal entitlements, you have the right to demand the restriction of the processing of your personal data instead of its eradication.If you have raised an objection pursuant to Art 21 Sect. 1 GDPR, your rights and our rights will have to be weighed against each other As long as it has not been determined whose interests prevail, you have the right to demand a restriction of the processing of your personal data.If you have restricted the processing of your personal data, these data with the exception of their archiving may be processed only subject to your consent or to claim, exercise or defend legal entitlements or to protect the rights of other natural persons or legal entities or for important public interest reasons cited by the European Union or a member state of the EU.Rejection of unsolicited emails. We herewith object to the use of contact information published in conjunction with the mandatory information to be provided in section Imprint to send us promotional and information material that we have not expressly requested The operators of this website and its pages reserve the express right to take legal action in the event of the unsolicited sending of promotional information, for instance via SPAM messages",
          "similarity_score": 0.7657
        },
        {
          "matched_policy_passage": "This also applies to any profiling based on these provisions To determine the legal basis, on which any processing of data is based, please consult this Data Protection Declaration If you log an objection, we will no longer process your affected personal data, unless we are in a position to present compelling protection worthy grounds for the processing of your data, that outweigh your interests, rights and freedoms or if the purpose of the processing is the claiming, exercising or defense of legal entitlements (objection pursuant to Art If your personal data is being processed in order to engage in direct advertising, you have the right to at any time object to the processing of your affected personal data for the purposes of such advertising",
          "similarity_score": 0.7285
        },
        {
          "matched_policy_passage": "Right to demand processing restrictions You have the right to demand the imposition of restrictions as far as the processing of your personal data is concerned To do so, you may contact us at any time at the address provided in section Imprint The right to demand restriction of processing applies in the following cases: In the event that you should dispute the correctness of your data archived by us, we will usually need some time to verify this claim During the time that this investigation is ongoing, you have the right to demand that we restrict the processing of your personal data",
          "similarity_score": 0.6621
        },
        {
          "matched_policy_passage": "To do so, you may contact us at any time at the address provided in section Imprint The right to demand restriction of processing applies in the following cases: In the event that you should dispute the correctness of your data archived by us, we will usually need some time to verify this claim During the time that this investigation is ongoing, you have the right to demand that we restrict the processing of your personal data If the processing of your personal data was/is conducted in an unlawful manner, you have the option to demand the restriction of the processing of your data in lieu of demanding the eradication of this data",
          "similarity_score": 0.7097
        },
        {
          "matched_policy_passage": "The right to demand restriction of processing applies in the following cases: In the event that you should dispute the correctness of your data archived by us, we will usually need some time to verify this claim During the time that this investigation is ongoing, you have the right to demand that we restrict the processing of your personal data If the processing of your personal data was/is conducted in an unlawful manner, you have the option to demand the restriction of the processing of your data in lieu of demanding the eradication of this data If we do not need your personal data any longer and you need it to exercise, defend or claim legal entitlements, you have the right to demand the restriction of the processing of your personal data instead of its eradication",
          "similarity_score": 0.7618
        },
        {
          "matched_policy_passage": "During the time that this investigation is ongoing, you have the right to demand that we restrict the processing of your personal data If the processing of your personal data was/is conducted in an unlawful manner, you have the option to demand the restriction of the processing of your data in lieu of demanding the eradication of this data If we do not need your personal data any longer and you need it to exercise, defend or claim legal entitlements, you have the right to demand the restriction of the processing of your personal data instead of its eradication If you have raised an objection pursuant to Art",
          "similarity_score": 0.758
        },
        {
          "matched_policy_passage": "If the processing of your personal data was/is conducted in an unlawful manner, you have the option to demand the restriction of the processing of your data in lieu of demanding the eradication of this data If we do not need your personal data any longer and you need it to exercise, defend or claim legal entitlements, you have the right to demand the restriction of the processing of your personal data instead of its eradication If you have raised an objection pursuant to Art 21 Sect. 1 GDPR, your rights and our rights will have to be weighed against each other",
          "similarity_score": 0.7762
        }
      ],
      "6.": [
        {
          "matched_policy_passage": "21 Sect. 1 GDPR, your rights and our rights will have to be weighed against each other As long as it has not been determined whose interests prevail, you have the right to demand a restriction of the processing of your personal data.If you have restricted the processing of your personal data, these data with the exception of their archiving may be processed only subject to your consent or to claim, exercise or defend legal entitlements or to protect the rights of other natural persons or legal entities or for important public interest reasons cited by the European Union or a member state of the EU.Rejection of unsolicited emails. We herewith object to the use of contact information published in conjunction with the mandatory information to be provided in section Imprint to send us promotional and information material that we have not expressly requested The operators of this website and its pages reserve the express right to take legal action in the event of the unsolicited sending of promotional information, for instance via SPAM messages Recording of data on our website. Cookies. In some instances, our website and its pages use so-called cookies",
          "similarity_score": 0.6848
        },
        {
          "matched_policy_passage": "As long as it has not been determined whose interests prevail, you have the right to demand a restriction of the processing of your personal data.If you have restricted the processing of your personal data, these data with the exception of their archiving may be processed only subject to your consent or to claim, exercise or defend legal entitlements or to protect the rights of other natural persons or legal entities or for important public interest reasons cited by the European Union or a member state of the EU.Rejection of unsolicited emails. We herewith object to the use of contact information published in conjunction with the mandatory information to be provided in section Imprint to send us promotional and information material that we have not expressly requested The operators of this website and its pages reserve the express right to take legal action in the event of the unsolicited sending of promotional information, for instance via SPAM messages Recording of data on our website. Cookies. In some instances, our website and its pages use so-called cookies Cookies do not cause any damage to your computer and do not contain viruses",
          "similarity_score": 0.7016
        },
        {
          "matched_policy_passage": "As long as it has not been determined whose interests prevail, you have the right to demand a restriction of the processing of your personal data If you have restricted the processing of your personal data, these data with the exception of their archiving may be processed only subject to your consent or to claim, exercise or defend legal entitlements or to protect the rights of other natural persons or legal entities or for important public interest reasons cited by the European Union or a member state of the EU Rejection of unsolicited emails We herewith object to the use of contact information published in conjunction with the mandatory information to be provided in section Imprint to send us promotional and information material that we have not expressly requested The operators of this website and its pages reserve the express right to take legal action in the event of the unsolicited sending of promotional information, for instance via SPAM messages",
          "similarity_score": 0.7105
        },
        {
          "matched_policy_passage": "If you have restricted the processing of your personal data, these data with the exception of their archiving may be processed only subject to your consent or to claim, exercise or defend legal entitlements or to protect the rights of other natural persons or legal entities or for important public interest reasons cited by the European Union or a member state of the EU Rejection of unsolicited emails We herewith object to the use of contact information published in conjunction with the mandatory information to be provided in section Imprint to send us promotional and information material that we have not expressly requested The operators of this website and its pages reserve the express right to take legal action in the event of the unsolicited sending of promotional information, for instance via SPAM messages Recording of data on our website In some instances, our website and its pages use so-called cookies",
          "similarity_score": 0.6833
        }
      ]
    }
  },
  {
    "article_number": 17,
    "article_title": "Right to erasure (‘right to be forgotten’)",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "In all other cases, the processing is based on your consent (Art 6 Sect. 1 a GDPR) and/or on our legitimate interests (Art. 6 Sect. 1 lit f GDPR), since we have a legitimate interest in the effective processing of requests addressed to us.The data sent by you to us via contact requests remain with us until you request us to delete, revoke your consent to the storage or the purpose for the data storage lapses (e.g after completion of your request)",
          "similarity_score": 0.6356
        }
      ]
    }
  },
  {
    "article_number": 38,
    "article_title": "Position of the data protection officer",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "via email, via postal services on by submitting the online job application form) Below, we will brief you on the scope, purpose and use of the personal data collected from you in conjunction with the application process We assure you that the collection, processing and use of your data will occur in compliance with the applicable data privacy rights and all other statutory provisions and that your data will always be treated as strictly confidential.Scope and purpose of the collection of data. If you submit a job application to us, we will process any affiliated personal data (e.g contact and communications data, application documents, notes taken during job interviews, etc",
          "similarity_score": 0.6012
        }
      ]
    }
  },
  {
    "article_number": 45,
    "article_title": "Transfers on the basis of an adequacy decision",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "We assure you that the collection, processing and use of your data will occur in compliance with the applicable data privacy rights and all other statutory provisions and that your data will always be treated as strictly confidential.Scope and purpose of the collection of data. If you submit a job application to us, we will process any affiliated personal data (e.g contact and communications data, application documents, notes taken during job interviews, etc ), if they are required to make a decision concerning the establishment or an employment relationship The legal grounds for the aforementioned are 26 Federal Data Protection Act (BDSG-neu) according to German Law (Negotiation of an Employment Relationship), Art",
          "similarity_score": 0.6966
        }
      ]
    }
  },
  {
    "article_number": 80,
    "article_title": "Representation of data subjects",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "consent within the meaning of Art a GDPR).Responsibility and assertion of rights. If you visit one of our social media sites (e.g., Facebook), we, together with the operator of the social media platform, are responsible for the data processing operations triggered during this visit You can in principle protect your rights (information, correction, deletion, limitation of processing, data portability and complaint) vis-à-vis us as well as vis-à-vis the operator of the respective social media portal (e.g Facebook).Please note that despite the shared responsibility with the social media portal operators, we do not have full influence on the data processing operations of the social media portals",
          "similarity_score": 0.6071
        },
        {
          "matched_policy_passage": "If you have raised an objection pursuant to Art 21 Sect. 1 GDPR, your rights and our rights will have to be weighed against each other As long as it has not been determined whose interests prevail, you have the right to demand a restriction of the processing of your personal data If you have restricted the processing of your personal data, these data with the exception of their archiving may be processed only subject to your consent or to claim, exercise or defend legal entitlements or to protect the rights of other natural persons or legal entities or for important public interest reasons cited by the European Union or a member state of the EU",
          "similarity_score": 0.694
        }
      ]
    }
  },
  {
    "article_number": 23,
    "article_title": "Restrictions",
    "matches": {
      "20.": [
        {
          "matched_policy_passage": "Moreover, under certain circumstances, you have the right to demand the restriction of the processing of your personal data For details, please consult the Data Protection Declaration under section Right to Restriction of Data Processing Analysis tools and tools provided by third parties There is a possibility that your browsing patterns will be statistically analyzed when your visit our website Such analyses are performed primarily with cookies and with what we refer to as analysis programs",
          "similarity_score": 0.6589
        }
      ],
      "10.": [
        {
          "matched_policy_passage": "21 Sect. 1 GDPR, your rights and our rights will have to be weighed against each other As long as it has not been determined whose interests prevail, you have the right to demand a restriction of the processing of your personal data If you have restricted the processing of your personal data, these data with the exception of their archiving may be processed only subject to your consent or to claim, exercise or defend legal entitlements or to protect the rights of other natural persons or legal entities or for important public interest reasons cited by the European Union or a member state of the EU Rejection of unsolicited emails We herewith object to the use of contact information published in conjunction with the mandatory information to be provided in section Imprint to send us promotional and information material that we have not expressly requested",
          "similarity_score": 0.6834
        }
      ]
    }
  },
  {
    "article_number": 22,
    "article_title": "Automated individual decision-making, including profiling",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "1790411 Nürnberg. Germany Phone: +49 911 14888690Email: hello[at]owncloud[dot]com The controller is the natural person or legal entity that single-handedly or jointly with others makes decisions as to the purposes of and resources for the processing of personal data (e.g names, email addresses, etc.) Revocation of your consent to the processing of data A wide range of data processing transactions are possible only subject to your express consent You can also revoke at any time any consent you have already given us",
          "similarity_score": 0.6475
        }
      ]
    }
  },
  {
    "article_number": 1,
    "article_title": "Subject-matter and objectives",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "If we do not need your personal data any longer and you need it to exercise, defend or claim legal entitlements, you have the right to demand the restriction of the processing of your personal data instead of its eradication If you have raised an objection pursuant to Art 21 Sect. 1 GDPR, your rights and our rights will have to be weighed against each other As long as it has not been determined whose interests prevail, you have the right to demand a restriction of the processing of your personal data",
          "similarity_score": 0.6535
        }
      ]
    }
  },
  {
    "article_number": 9,
    "article_title": "Processing of special categories of personal data",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "The legal grounds for the aforementioned are 26 Federal Data Protection Act (BDSG-neu) according to German Law (Negotiation of an Employment Relationship), Art b GDPR (General Contract Negotiations) and provided you have given us your consent Art You may revoke any consent given at any time Within our company, your personal data will only be shared with individuals who are involved in the processing of your job application",
          "similarity_score": 0.6353
        }
      ]
    }
  },
  {
    "article_number": 25,
    "article_title": "Data protection by design and by default",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "The analysis processes initiated by the social networks may be based on divergent legal bases to be specified by the operators of the social networks (e.g consent within the meaning of Art Responsibility and assertion of rights. If you visit one of our social media sites (e.g., Facebook), we, together with the operator of the social media platform, are responsible for the data processing operations triggered during this visit You can in principle protect your rights (information, correction, deletion, limitation of processing, data portability and complaint) vis-à-vis us as well as vis-à-vis the operator of the respective social media portal (e.g",
          "similarity_score": 0.6199
        }
      ]
    }
  }
]