[
  {
    "article_number": 45,
    "article_title": "Transfers on the basis of an adequacy decision",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We have data processing agreements with both of them.To manage our job applications, we use software from rexx systems Gmb. H We also have a data processing agreement with this company.Third countries. Data is transferred to third countries in adherence to the legally regulated admissibility requirements We will not transfer your data to a third country if it does not serve the purpose of performing our contract with you; if we have no consent from you; if the transfer is not necessary to assert, exercise or defend legal claims; and if there are no other exceptions We will only transfer your data to a third country if there is an adequacy decision in accordance with Art",
          "similarity_score": 0.6824
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "You can also request that we transfer the data directly to a third party, if technically feasible.Right to object:You can object to the processing of your personal data unless there are compelling legitimate reasons for the processing.Right not to be subject to automated decision-making:We do not make any automated decisions regarding your application If we did, you would have the right not to be evaluated solely by algorithms.If you would like to make use of any of these rights, please contact our data protection officer directly.Making complaints to the relevant data protection authority. If you believe that we are violating any data protection laws by processing personal data, you also have the right to make a complaint to the data supervisory authority who is responsible for our company.However, we encourage you to first contact our data protection officer.We always strive to resolve any possible disagreements as quickly and smoothly as possible so that we can avoid conflicts.Voluntary nature of data provision. There is no statutory obligation for you to provide your data to Hetzner Online Gmb. H However, you cannot use some of our services if you do not provide your data to us Your decision to provide us with your personal data is completely voluntary.Using the Feedbacktool1",
          "similarity_score": 0.6796
        }
      ]
    }
  },
  {
    "article_number": 48,
    "article_title": "Transfers or disclosures not authorised by Union law",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We also have a data processing agreement with this company.Third countries. Data is transferred to third countries in adherence to the legally regulated admissibility requirements We will not transfer your data to a third country if it does not serve the purpose of performing our contract with you; if we have no consent from you; if the transfer is not necessary to assert, exercise or defend legal claims; and if there are no other exceptions We will only transfer your data to a third country if there is an adequacy decision in accordance with Art 45 GDPR or appropriate safeguards in accordance with Art. 46 GDPR.Other categories of recipients. State authorities and courts. Where do we process your data?We process your data exclusively in our data centers in Germany and in Finland.Using the Ask AI chatbot1",
          "similarity_score": 0.789
        },
        {
          "matched_policy_passage": "We will not transfer your data to a third country if it does not serve the purpose of performing our contract with you; if we have no consent from you; if the transfer is not necessary to assert, exercise or defend legal claims; and if there are no other exceptions We will only transfer your data to a third country if there is an adequacy decision in accordance with Art 45 GDPR or appropriate safeguards in accordance with Art. 46 GDPR.Other categories of recipients. State authorities and courts. Where do we process your data?We process your data exclusively in our data centers in Germany and in Finland.Using the Ask AI chatbot1 General information. We at Hetzner rely on advanced technologies to provide the best possible customer service",
          "similarity_score": 0.7319
        },
        {
          "matched_policy_passage": "We also have a data processing agreement with this company Data is transferred to third countries in adherence to the legally regulated admissibility requirements We will not transfer your data to a third country if it does not serve the purpose of performing our contract with you; if we have no consent from you; if the transfer is not necessary to assert, exercise or defend legal claims; and if there are no other exceptions We will only transfer your data to a third country if there is an adequacy decision in accordance with Art",
          "similarity_score": 0.7281
        },
        {
          "matched_policy_passage": "Data is transferred to third countries in adherence to the legally regulated admissibility requirements We will not transfer your data to a third country if it does not serve the purpose of performing our contract with you; if we have no consent from you; if the transfer is not necessary to assert, exercise or defend legal claims; and if there are no other exceptions We will only transfer your data to a third country if there is an adequacy decision in accordance with Art 45 GDPR or appropriate safeguards in accordance with Art. 46 GDPR",
          "similarity_score": 0.7699
        },
        {
          "matched_policy_passage": "We will not transfer your data to a third country if it does not serve the purpose of performing our contract with you; if we have no consent from you; if the transfer is not necessary to assert, exercise or defend legal claims; and if there are no other exceptions We will only transfer your data to a third country if there is an adequacy decision in accordance with Art 45 GDPR or appropriate safeguards in accordance with Art. 46 GDPR Other categories of recipients State authorities and courts Where do we process your data? We process your data exclusively in our data centers in Germany and in Finland. Using the Ask AI chatbot 1. General information We at Hetzner rely on advanced technologies to provide the best possible customer service",
          "similarity_score": 0.7183
        }
      ]
    }
  },
  {
    "article_number": 86,
    "article_title": "Processing and public access to official documents",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "As a company, we have a legal right to obtain general customer information to use in customer accounts We also use customers' data for communication purposes If any of the providers below request users for consent for processing their data, the legal basis for data pracessing is Art a. GDPR.For detailed information about the data processing operations of the providers below, as well as their opt-out options, please check the links that we have listed below.Facebook:Provider: Meta Platforms Ireland Limited, 4 Grand Canal Square, Grand Canal Harbour Dublin 2, Ireland.Privacy policy:https://www.facebook.com/about/privacy/Opt-Out:https://www.facebook.com/settings?tab=ads.X (former Twitter):Provider: Twitter International Unlimited Company, One Cumberland Place, Fenian Street Dublin 2, D02 AX07 Ireland.Privacy policy:https://twitter.com/privacy. Opt-Out:https://help.twitter.com/safety-and-security/privacy-controls-for-tailored-ads. Instagram:Provider: Meta Platforms Ireland Limited, 4 Grand Canal Square, Grand Canal Harbour Dublin 2, Ireland.Privacy policy:https://instagram.com/about/legal/privacy/Opt-Out:https://instagram.com/about/legal/privacy/Youtube:Provider: Google Ireland Limited, Gordon House, 4 Barrow St, Dublin, D04 E5W5, Ireland.Privacy policy:https://policies.google.com/privacy. Opt-Out:https://adssettings.google.com/authenticated. Surveys. We conduct surveys in order to constantly improve ourselves and our products",
          "similarity_score": 0.6022
        },
        {
          "matched_policy_passage": "We use the Lime. Survey tool (https://www.limesurvey.org/) for the survey.If personal data is collected as part of the survey, it is processed and stored directly by the provider You can access the company's data protection information via the following link:https://www.limesurvey.org/privacy-policy. What rights do I have when it comes to my data?The GDPR grants you the following rights regarding your data:Right of access:You can request information at any time about whether and which personal data we process about you.Right to rectification:If the data we have stored about you is incorrect or incomplete, you can request its correction or completion.Right to erasure (\"right to be forgotten\"):You can request the deletion of your data if it is no longer required for its original purpose However, please note that immediate deletion may not be possible in some cases due to legal or contractual retention obligations.Right to restriction of processing:If, for example, you dispute the accuracy of your data or believe that the processing is unlawful, you can request that we restrict the processing of your data.Right to data portability:You have the right to receive your data in a structured, commonly used, and machine-readable format You can also request that we transfer the data directly to a third party, if technically feasible.Right to object:You can object to the processing of your personal data unless there are compelling legitimate reasons for the processing.Right not to be subject to automated decision-making:We do not make any automated decisions regarding your application",
          "similarity_score": 0.6064
        },
        {
          "matched_policy_passage": "You can access the company's data protection information via the following link:https://www.limesurvey.org/privacy-policy. What rights do I have when it comes to my data?The GDPR grants you the following rights regarding your data:Right of access:You can request information at any time about whether and which personal data we process about you.Right to rectification:If the data we have stored about you is incorrect or incomplete, you can request its correction or completion.Right to erasure (\"right to be forgotten\"):You can request the deletion of your data if it is no longer required for its original purpose However, please note that immediate deletion may not be possible in some cases due to legal or contractual retention obligations.Right to restriction of processing:If, for example, you dispute the accuracy of your data or believe that the processing is unlawful, you can request that we restrict the processing of your data.Right to data portability:You have the right to receive your data in a structured, commonly used, and machine-readable format You can also request that we transfer the data directly to a third party, if technically feasible.Right to object:You can object to the processing of your personal data unless there are compelling legitimate reasons for the processing.Right not to be subject to automated decision-making:We do not make any automated decisions regarding your application If we did, you would have the right not to be evaluated solely by algorithms.If you would like to make use of any of these rights, please contact our data protection officer directly.Making complaints to the relevant data protection authority. If you believe that we are violating any data protection laws by processing personal data, you also have the right to make a complaint to the data supervisory authority who is responsible for our company.However, we encourage you to first contact our data protection officer.We always strive to resolve any possible disagreements as quickly and smoothly as possible so that we can avoid conflicts.Voluntary nature of data provision. There is no statutory obligation for you to provide your data to Hetzner Online Gmb. H",
          "similarity_score": 0.6013
        },
        {
          "matched_policy_passage": "As a company, we have a legal right to obtain general customer information to use in customer accounts We also use customers' data for communication purposes If any of the providers below request users for consent for processing their data, the legal basis for data pracessing is Art a. GDPR.For detailed information about the data processing operations of the providers below, as well as their opt-out options, please check the links that we have listed below",
          "similarity_score": 0.6378
        },
        {
          "matched_policy_passage": "We use the Lime. Survey tool (https://www.limesurvey.org/) for the survey.If personal data is collected as part of the survey, it is processed and stored directly by the provider You can access the company's data protection information via the following link:https://www.limesurvey.org/privacy-policy What rights do I have when it comes to my data? The GDPR grants you the following rights regarding your data: Right of access:You can request information at any time about whether and which personal data we process about you. Right to rectification:If the data we have stored about you is incorrect or incomplete, you can request its correction or completion. Right to erasure (\"right to be forgotten\"):You can request the deletion of your data if it is no longer required for its original purpose However, please note that immediate deletion may not be possible in some cases due to legal or contractual retention obligations Right to restriction of processing:If, for example, you dispute the accuracy of your data or believe that the processing is unlawful, you can request that we restrict the processing of your data",
          "similarity_score": 0.601
        }
      ]
    }
  },
  {
    "article_number": 17,
    "article_title": "Right to erasure (‘right to be forgotten’)",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "However, please note that immediate deletion may not be possible in some cases due to legal or contractual retention obligations.Right to restriction of processing:If, for example, you dispute the accuracy of your data or believe that the processing is unlawful, you can request that we restrict the processing of your data.Right to data portability:You have the right to receive your data in a structured, commonly used, and machine-readable format You can also request that we transfer the data directly to a third party, if technically feasible.Right to object:You can object to the processing of your personal data unless there are compelling legitimate reasons for the processing.Right not to be subject to automated decision-making:We do not make any automated decisions regarding your application If we did, you would have the right not to be evaluated solely by algorithms.If you would like to make use of any of these rights, please contact our data protection officer directly.Making complaints to the relevant data protection authority. If you believe that we are violating any data protection laws by processing personal data, you also have the right to make a complaint to the data supervisory authority who is responsible for our company.However, we encourage you to first contact our data protection officer.We always strive to resolve any possible disagreements as quickly and smoothly as possible so that we can avoid conflicts.Voluntary nature of data provision. There is no statutory obligation for you to provide your data to Hetzner Online Gmb. H However, you cannot use some of our services if you do not provide your data to us",
          "similarity_score": 0.7254
        },
        {
          "matched_policy_passage": "We use the collected data only to process the sweepstakes Once the sweepstakes end and the winner or winners are chosen and notified, the collected data are deleted The legal basis for this data processing is Art On our website, we use the open-source web analysis tool Matomo on our self-hosted system",
          "similarity_score": 0.608
        },
        {
          "matched_policy_passage": "However, please note that immediate deletion may not be possible in some cases due to legal or contractual retention obligations Right to restriction of processing:If, for example, you dispute the accuracy of your data or believe that the processing is unlawful, you can request that we restrict the processing of your data Right to data portability:You have the right to receive your data in a structured, commonly used, and machine-readable format You can also request that we transfer the data directly to a third party, if technically feasible",
          "similarity_score": 0.6922
        }
      ]
    }
  },
  {
    "article_number": 38,
    "article_title": "Position of the data protection officer",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "If we did, you would have the right not to be evaluated solely by algorithms.If you would like to make use of any of these rights, please contact our data protection officer directly.Making complaints to the relevant data protection authority. If you believe that we are violating any data protection laws by processing personal data, you also have the right to make a complaint to the data supervisory authority who is responsible for our company.However, we encourage you to first contact our data protection officer.We always strive to resolve any possible disagreements as quickly and smoothly as possible so that we can avoid conflicts.Voluntary nature of data provision. There is no statutory obligation for you to provide your data to Hetzner Online Gmb. H However, you cannot use some of our services if you do not provide your data to us Your decision to provide us with your personal data is completely voluntary.Using the Feedbacktool1 What data is processed?As part of the feedback process, the following personal data may be processed:Ticket number. Your feedback (The disclosure of your personal data as part of the feedback is voluntary",
          "similarity_score": 0.6928
        },
        {
          "matched_policy_passage": "Right not to be subject to automated decision-making:We do not make any automated decisions regarding your application If we did, you would have the right not to be evaluated solely by algorithms If you would like to make use of any of these rights, please contact our data protection officer directly Making complaints to the relevant data protection authority If you believe that we are violating any data protection laws by processing personal data, you also have the right to make a complaint to the data supervisory authority who is responsible for our company.However, we encourage you to first contact our data protection officer.We always strive to resolve any possible disagreements as quickly and smoothly as possible so that we can avoid conflicts",
          "similarity_score": 0.6645
        },
        {
          "matched_policy_passage": "If you would like to make use of any of these rights, please contact our data protection officer directly Making complaints to the relevant data protection authority If you believe that we are violating any data protection laws by processing personal data, you also have the right to make a complaint to the data supervisory authority who is responsible for our company.However, we encourage you to first contact our data protection officer.We always strive to resolve any possible disagreements as quickly and smoothly as possible so that we can avoid conflicts Voluntary nature of data provision There is no statutory obligation for you to provide your data to Hetzner Online Gmb. H However, you cannot use some of our services if you do not provide your data to us",
          "similarity_score": 0.6303
        },
        {
          "matched_policy_passage": "Making complaints to the relevant data protection authority If you believe that we are violating any data protection laws by processing personal data, you also have the right to make a complaint to the data supervisory authority who is responsible for our company.However, we encourage you to first contact our data protection officer.We always strive to resolve any possible disagreements as quickly and smoothly as possible so that we can avoid conflicts Voluntary nature of data provision There is no statutory obligation for you to provide your data to Hetzner Online Gmb. H However, you cannot use some of our services if you do not provide your data to us Your decision to provide us with your personal data is completely voluntary",
          "similarity_score": 0.601
        }
      ]
    }
  },
  {
    "article_number": 32,
    "article_title": "Security of processing",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "The legal basis for this data processing is Art Verification of customer details To minimize our business risk and to prevent the misuse of our services, we carry out a check based on general risk factors when new customer accounts are registered This helps us to detect potentially unusual payment behaviour at an early stage and to prevent fraudulent activities.Our system makes a prediction about how likely it is that you will meet your contractual payment obligations and use our services responsibly The result of this preliminary check may influence whether we enter into a contractual relationship with you.During the assessment, the data you provide as well as technical characteristics are processed",
          "similarity_score": 0.625
        },
        {
          "matched_policy_passage": "Verification of customer details To minimize our business risk and to prevent the misuse of our services, we carry out a check based on general risk factors when new customer accounts are registered This helps us to detect potentially unusual payment behaviour at an early stage and to prevent fraudulent activities.Our system makes a prediction about how likely it is that you will meet your contractual payment obligations and use our services responsibly The result of this preliminary check may influence whether we enter into a contractual relationship with you.During the assessment, the data you provide as well as technical characteristics are processed This data is compared with our previous experience and evaluated with the help of an external service provider for risk analysis.You have the right to request a review of the decision",
          "similarity_score": 0.6079
        }
      ]
    }
  },
  {
    "article_number": 13,
    "article_title": "Information to be provided where personal data are collected from the data subject",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "The legal basis for processing your data for the above purpose is Art Whenever you visit our websites, we automatically store certain data This includes your IP address, type and version of the browser you use, and the time, date, and website from which you come to our site Your IP address is saved in an anonymized manner",
          "similarity_score": 0.6291
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We have data processing agreements with both of them.To manage our job applications, we use software from rexx systems Gmb. H We also have a data processing agreement with this company Data is transferred to third countries in adherence to the legally regulated admissibility requirements We will not transfer your data to a third country if it does not serve the purpose of performing our contract with you; if we have no consent from you; if the transfer is not necessary to assert, exercise or defend legal claims; and if there are no other exceptions",
          "similarity_score": 0.6461
        }
      ]
    }
  },
  {
    "article_number": 18,
    "article_title": "Right to restriction of processing",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Right to restriction of processing:If, for example, you dispute the accuracy of your data or believe that the processing is unlawful, you can request that we restrict the processing of your data Right to data portability:You have the right to receive your data in a structured, commonly used, and machine-readable format You can also request that we transfer the data directly to a third party, if technically feasible Right to object:You can object to the processing of your personal data unless there are compelling legitimate reasons for the processing",
          "similarity_score": 0.7526
        }
      ]
    }
  },
  {
    "article_number": 20,
    "article_title": "Right to data portability",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "Right to data portability:You have the right to receive your data in a structured, commonly used, and machine-readable format You can also request that we transfer the data directly to a third party, if technically feasible Right to object:You can object to the processing of your personal data unless there are compelling legitimate reasons for the processing Right not to be subject to automated decision-making:We do not make any automated decisions regarding your application",
          "similarity_score": 0.6739
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "You can also request that we transfer the data directly to a third party, if technically feasible Right to object:You can object to the processing of your personal data unless there are compelling legitimate reasons for the processing Right not to be subject to automated decision-making:We do not make any automated decisions regarding your application If we did, you would have the right not to be evaluated solely by algorithms",
          "similarity_score": 0.6481
        }
      ]
    }
  },
  {
    "article_number": 21,
    "article_title": "Right to object",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "Right to object:You can object to the processing of your personal data unless there are compelling legitimate reasons for the processing Right not to be subject to automated decision-making:We do not make any automated decisions regarding your application If we did, you would have the right not to be evaluated solely by algorithms If you would like to make use of any of these rights, please contact our data protection officer directly",
          "similarity_score": 0.6903
        }
      ]
    }
  },
  {
    "article_number": 77,
    "article_title": "Right to lodge a complaint with a supervisory authority",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "If we did, you would have the right not to be evaluated solely by algorithms If you would like to make use of any of these rights, please contact our data protection officer directly Making complaints to the relevant data protection authority If you believe that we are violating any data protection laws by processing personal data, you also have the right to make a complaint to the data supervisory authority who is responsible for our company.However, we encourage you to first contact our data protection officer.We always strive to resolve any possible disagreements as quickly and smoothly as possible so that we can avoid conflicts Voluntary nature of data provision There is no statutory obligation for you to provide your data to Hetzner Online Gmb. H",
          "similarity_score": 0.6786
        }
      ]
    }
  }
]