[
  {
    "article_number": 47,
    "article_title": "Binding corporate rules",
    "matches": {
      "19.": [
        {
          "matched_policy_passage": "To do so, we employ a variety of security technologies and measures designed to help protect information from unauthorized access, use, or disclosure The measures we use are designed to provide a level of security appropriate to the risk of processing your Personal Information.For more information on Digital. Oceanâs security controls, please see the following resources:Data Processing Agreement (DPA)Certification Reports6.Data Retention. We retain your Personal Information for as long as necessary to provide you our Services, or for other legitimate business purposes such as resolving disputes, safety and security reasons, or complying with our legal obligations How long we retain Personal Information will depend on a number of factors, such as the amount, nature, and sensitivity of the information, the potential risk of harm from unauthorized use or disclosure, our purpose for processing the information, and any legal requirements.Access. If you are a registered user, you may access certain information associated with your Account by logging into our Services or emailingprivacy@digitalocean.com If you terminate your Account, any public activity on your Account prior to deletion may remain stored on our servers and may remain accessible to the public.To help protect your privacy and security, we may also take reasonable steps to verify your identity before updating or removing your information",
          "similarity_score": 0.6116
        },
        {
          "matched_policy_passage": "We respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws You can use some of the features of the Services without registering, thereby limiting the type of information that we collect You may unsubscribe from receiving certain promotional emails from us If you wish to do so, simply follow the instructions found at the end of the email",
          "similarity_score": 0.6447
        }
      ],
      "9.": [
        {
          "matched_policy_passage": "The measures we use are designed to provide a level of security appropriate to the risk of processing your Personal Information.For more information on Digital. Oceanâs security controls, please see the following resources:Data Processing Agreement (DPA)Certification Reports6.Data Retention. We retain your Personal Information for as long as necessary to provide you our Services, or for other legitimate business purposes such as resolving disputes, safety and security reasons, or complying with our legal obligations How long we retain Personal Information will depend on a number of factors, such as the amount, nature, and sensitivity of the information, the potential risk of harm from unauthorized use or disclosure, our purpose for processing the information, and any legal requirements.Access. If you are a registered user, you may access certain information associated with your Account by logging into our Services or emailingprivacy@digitalocean.com If you terminate your Account, any public activity on your Account prior to deletion may remain stored on our servers and may remain accessible to the public.To help protect your privacy and security, we may also take reasonable steps to verify your identity before updating or removing your information The information you provide us may be archived or stored periodically by us according to backup processes conducted in the ordinary course of business for disaster recovery purposes",
          "similarity_score": 0.6013
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "You can exercise this right by clicking on the âunsubscribeâ or âopt-outâ link in the marketing emails we send you To opt-out of other forms of marketing, please contact us by emailingprivacy@digitalocean.com.Right to withdraw your consent, if we have collected and processed your Personal Information with your consent Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent.Right to complain to a data protection authority about our collection and use of your Personal Information For more information, please contact your local data protection authority.We respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws.Your Choices. You can use some of the features of the Services without registering, thereby limiting the type of information that we collect.You may unsubscribe from receiving certain promotional emails from us",
          "similarity_score": 0.6394
        },
        {
          "matched_policy_passage": "To opt-out of other forms of marketing, please contact us by emailingprivacy@digitalocean.com.Right to withdraw your consent, if we have collected and processed your Personal Information with your consent Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent.Right to complain to a data protection authority about our collection and use of your Personal Information For more information, please contact your local data protection authority.We respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws.Your Choices. You can use some of the features of the Services without registering, thereby limiting the type of information that we collect.You may unsubscribe from receiving certain promotional emails from us If you wish to do so, simply follow the instructions found at the end of the email.Many browsers have an option for disabling cookies, which may prevent your browser from accepting new cookies or enable selective use of cookies",
          "similarity_score": 0.6714
        },
        {
          "matched_policy_passage": "Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent.Right to complain to a data protection authority about our collection and use of your Personal Information For more information, please contact your local data protection authority.We respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws.Your Choices. You can use some of the features of the Services without registering, thereby limiting the type of information that we collect.You may unsubscribe from receiving certain promotional emails from us If you wish to do so, simply follow the instructions found at the end of the email.Many browsers have an option for disabling cookies, which may prevent your browser from accepting new cookies or enable selective use of cookies Please note that, if you choose not to accept cookies, some features and the personalization of our Services may no longer work for you.Childrenâs Privacy. Digital. Ocean does not knowingly collect information from children under the age of 13, and children under 13 are prohibited from using our Services",
          "similarity_score": 0.7221
        },
        {
          "matched_policy_passage": "You can exercise this right by clicking on the âunsubscribeâ or âopt-outâ link in the marketing emails we send you To opt-out of other forms of marketing, please contact us by emailingprivacy@digitalocean.com Right to withdraw your consent, if we have collected and processed your Personal Information with your consent Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent",
          "similarity_score": 0.618
        },
        {
          "matched_policy_passage": "To opt-out of other forms of marketing, please contact us by emailingprivacy@digitalocean.com Right to withdraw your consent, if we have collected and processed your Personal Information with your consent Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent Right to withdraw your consent, if we have collected and processed your Personal Information with your consent",
          "similarity_score": 0.6749
        },
        {
          "matched_policy_passage": "Right to withdraw your consent, if we have collected and processed your Personal Information with your consent Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent Right to withdraw your consent, if we have collected and processed your Personal Information with your consent Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent",
          "similarity_score": 0.7603
        },
        {
          "matched_policy_passage": "Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent Right to withdraw your consent, if we have collected and processed your Personal Information with your consent Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent Right to complain to a data protection authority about our collection and use of your Personal Information",
          "similarity_score": 0.7523
        },
        {
          "matched_policy_passage": "Right to withdraw your consent, if we have collected and processed your Personal Information with your consent Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent Right to complain to a data protection authority about our collection and use of your Personal Information For more information, please contact your local data protection authority",
          "similarity_score": 0.7907
        },
        {
          "matched_policy_passage": "Withdrawing your consent will not affect the lawfulness of any processing we conducted prior to your withdrawal, nor will it affect the processing of your Personal Information conducted in reliance on lawful processing grounds other than consent Right to complain to a data protection authority about our collection and use of your Personal Information For more information, please contact your local data protection authority Right to complain to a data protection authority about our collection and use of your Personal Information",
          "similarity_score": 0.7396
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Changes to this Privacy Policy will be posted on our websites If we materially change the ways in which we use or share Personal Information previously collected from you through our Services, we will notify you through our Services, on this page, by email, or other communication.International Data Transfers. With respect to Personal Data of Data Subjects located in the EEA, Switzerland, or the United Kingdom that Customer transfers to Digital. Ocean or permits Digital. Ocean to access, the parties agree that by executing the DPA they also execute the Standard Contractual Clauses, which will be incorporated by reference and form an integral part of the DPA The parties agree that, with respect to the elements of the Standard Contractual Clauses that require the partiesâ input, Schedules 1-3 contain all the relevant information.Digital. Ocean, LLC complies with the EU-U.S. Data Privacy Framework (âEU-U.S. DPFâ), the UK Extension to the EU-U.S. DPF (âUK Extensionâ), and the Swiss-U.S. Data Privacy Framework (âSwiss-U.S. DPFâ) as set forth by the U.S. Department of Commerce Digital. Ocean has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF and from the United Kingdom (and Gibraltar) in reliance on the UK Extension",
          "similarity_score": 0.654
        },
        {
          "matched_policy_passage": "If we materially change the ways in which we use or share Personal Information previously collected from you through our Services, we will notify you through our Services, on this page, by email, or other communication.International Data Transfers. With respect to Personal Data of Data Subjects located in the EEA, Switzerland, or the United Kingdom that Customer transfers to Digital. Ocean or permits Digital. Ocean to access, the parties agree that by executing the DPA they also execute the Standard Contractual Clauses, which will be incorporated by reference and form an integral part of the DPA The parties agree that, with respect to the elements of the Standard Contractual Clauses that require the partiesâ input, Schedules 1-3 contain all the relevant information.Digital. Ocean, LLC complies with the EU-U.S. Data Privacy Framework (âEU-U.S. DPFâ), the UK Extension to the EU-U.S. DPF (âUK Extensionâ), and the Swiss-U.S. Data Privacy Framework (âSwiss-U.S. DPFâ) as set forth by the U.S. Department of Commerce Digital. Ocean has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF and from the United Kingdom (and Gibraltar) in reliance on the UK Extension Digital. Ocean has also certified to the U.S. Department of Commerce that it adheres to the Swiss-U.S. Data Privacy Framework Principles (together with the EU-U.S. Data Privacy Framework Principles, the âDPF Principlesâ) with regard to the processing of personal data received from Switzerland in reliance on the Swiss-U.S. DPF",
          "similarity_score": 0.6614
        },
        {
          "matched_policy_passage": "11.Changes to the Privacy Policy This Privacy Policy may be modified from time to time, so please review it frequently Changes to this Privacy Policy will be posted on our websites If we materially change the ways in which we use or share Personal Information previously collected from you through our Services, we will notify you through our Services, on this page, by email, or other communication 12.International Data Transfers With respect to Personal Data of Data Subjects located in the EEA, Switzerland, or the United Kingdom that Customer transfers to Digital. Ocean or permits Digital. Ocean to access, the parties agree that by executing the DPA they also execute the Standard Contractual Clauses, which will be incorporated by reference and form an integral part of the DPA",
          "similarity_score": 0.6258
        },
        {
          "matched_policy_passage": "Changes to this Privacy Policy will be posted on our websites If we materially change the ways in which we use or share Personal Information previously collected from you through our Services, we will notify you through our Services, on this page, by email, or other communication 12.International Data Transfers With respect to Personal Data of Data Subjects located in the EEA, Switzerland, or the United Kingdom that Customer transfers to Digital. Ocean or permits Digital. Ocean to access, the parties agree that by executing the DPA they also execute the Standard Contractual Clauses, which will be incorporated by reference and form an integral part of the DPA The parties agree that, with respect to the elements of the Standard Contractual Clauses that require the partiesâ input, Schedules 1-3 contain all the relevant information",
          "similarity_score": 0.645
        },
        {
          "matched_policy_passage": "If we materially change the ways in which we use or share Personal Information previously collected from you through our Services, we will notify you through our Services, on this page, by email, or other communication 12.International Data Transfers With respect to Personal Data of Data Subjects located in the EEA, Switzerland, or the United Kingdom that Customer transfers to Digital. Ocean or permits Digital. Ocean to access, the parties agree that by executing the DPA they also execute the Standard Contractual Clauses, which will be incorporated by reference and form an integral part of the DPA The parties agree that, with respect to the elements of the Standard Contractual Clauses that require the partiesâ input, Schedules 1-3 contain all the relevant information Digital. Ocean, LLC complies with the EU-U.S. Data Privacy Framework (âEU-U.S. DPFâ), the UK Extension to the EU-U.S. DPF (âUK Extensionâ), and the Swiss-U.S. Data Privacy Framework (âSwiss-U.S. DPFâ) as set forth by the U.S. Department of Commerce",
          "similarity_score": 0.655
        },
        {
          "matched_policy_passage": "12.International Data Transfers With respect to Personal Data of Data Subjects located in the EEA, Switzerland, or the United Kingdom that Customer transfers to Digital. Ocean or permits Digital. Ocean to access, the parties agree that by executing the DPA they also execute the Standard Contractual Clauses, which will be incorporated by reference and form an integral part of the DPA The parties agree that, with respect to the elements of the Standard Contractual Clauses that require the partiesâ input, Schedules 1-3 contain all the relevant information Digital. Ocean, LLC complies with the EU-U.S. Data Privacy Framework (âEU-U.S. DPFâ), the UK Extension to the EU-U.S. DPF (âUK Extensionâ), and the Swiss-U.S. Data Privacy Framework (âSwiss-U.S. DPFâ) as set forth by the U.S. Department of Commerce Digital. Ocean has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF and from the United Kingdom (and Gibraltar) in reliance on the UK Extension",
          "similarity_score": 0.6076
        }
      ]
    }
  },
  {
    "article_number": 49,
    "article_title": "Derogations for specific situations",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "Business Transfers.Information may be disclosed and otherwise transferred to any potential acquirer, successor, or assignee as part of any proposed merger, acquisition, debt financing, sale of assets, or similar transaction, or in the event of insolvency, bankruptcy, or receivership in which information is transferred to one or more third parties as one of our business assets As Required By Law and Similar Disclosures.We may also share information to (i) satisfy any applicable law, regulation, legal process, or governmental request including requests made by public authorities to meet national security or law enforcement requirements; (ii) enforce this Privacy Policy and our Terms of Service, including investigation of potential violations hereof; (iii) detect, prevent, or otherwise address fraud, security, or technical issues; (iv) respond to your requests; or (v) protect our rights, property or safety, our users and the public This includes exchanging information with other companies and organizations for fraud protection and spam/malware prevention As Required By Law and Similar Disclosures.We may also share information to (i) satisfy any applicable law, regulation, legal process, or governmental request including requests made by public authorities to meet national security or law enforcement requirements; (ii) enforce this Privacy Policy and our Terms of Service, including investigation of potential violations hereof; (iii) detect, prevent, or otherwise address fraud, security, or technical issues; (iv) respond to your requests; or (v) protect our rights, property or safety, our users and the public",
          "similarity_score": 0.6862
        }
      ]
    }
  },
  {
    "article_number": 50,
    "article_title": "International cooperation for the protection of personal data",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "As Required By Law and Similar Disclosures.We may also share information to (i) satisfy any applicable law, regulation, legal process, or governmental request including requests made by public authorities to meet national security or law enforcement requirements; (ii) enforce this Privacy Policy and our Terms of Service, including investigation of potential violations hereof; (iii) detect, prevent, or otherwise address fraud, security, or technical issues; (iv) respond to your requests; or (v) protect our rights, property or safety, our users and the public This includes exchanging information with other companies and organizations for fraud protection and spam/malware prevention As Required By Law and Similar Disclosures.We may also share information to (i) satisfy any applicable law, regulation, legal process, or governmental request including requests made by public authorities to meet national security or law enforcement requirements; (ii) enforce this Privacy Policy and our Terms of Service, including investigation of potential violations hereof; (iii) detect, prevent, or otherwise address fraud, security, or technical issues; (iv) respond to your requests; or (v) protect our rights, property or safety, our users and the public This includes exchanging information with other companies and organizations for fraud protection and spam/malware prevention",
          "similarity_score": 0.6531
        },
        {
          "matched_policy_passage": "This includes exchanging information with other companies and organizations for fraud protection and spam/malware prevention As Required By Law and Similar Disclosures.We may also share information to (i) satisfy any applicable law, regulation, legal process, or governmental request including requests made by public authorities to meet national security or law enforcement requirements; (ii) enforce this Privacy Policy and our Terms of Service, including investigation of potential violations hereof; (iii) detect, prevent, or otherwise address fraud, security, or technical issues; (iv) respond to your requests; or (v) protect our rights, property or safety, our users and the public This includes exchanging information with other companies and organizations for fraud protection and spam/malware prevention With Your Consent.We may share information with your consent",
          "similarity_score": 0.6351
        },
        {
          "matched_policy_passage": "As Required By Law and Similar Disclosures.We may also share information to (i) satisfy any applicable law, regulation, legal process, or governmental request including requests made by public authorities to meet national security or law enforcement requirements; (ii) enforce this Privacy Policy and our Terms of Service, including investigation of potential violations hereof; (iii) detect, prevent, or otherwise address fraud, security, or technical issues; (iv) respond to your requests; or (v) protect our rights, property or safety, our users and the public This includes exchanging information with other companies and organizations for fraud protection and spam/malware prevention With Your Consent.We may share information with your consent With Your Consent.We may share information with your consent",
          "similarity_score": 0.6531
        }
      ]
    }
  },
  {
    "article_number": 70,
    "article_title": "Tasks of the Board",
    "matches": {
      "15.": [
        {
          "matched_policy_passage": "To do so, we employ a variety of security technologies and measures designed to help protect information from unauthorized access, use, or disclosure The measures we use are designed to provide a level of security appropriate to the risk of processing your Personal Information For more information on Digital. Oceanâs security controls, please see the following resources: Data Processing Agreement (DPA) Data Processing Agreement (DPA) Certification Reports Certification Reports We retain your Personal Information for as long as necessary to provide you our Services, or for other legitimate business purposes such as resolving disputes, safety and security reasons, or complying with our legal obligations How long we retain Personal Information will depend on a number of factors, such as the amount, nature, and sensitivity of the information, the potential risk of harm from unauthorized use or disclosure, our purpose for processing the information, and any legal requirements",
          "similarity_score": 0.604
        },
        {
          "matched_policy_passage": "For more information on Digital. Oceanâs security controls, please see the following resources: Data Processing Agreement (DPA) Data Processing Agreement (DPA) Certification Reports Certification Reports We retain your Personal Information for as long as necessary to provide you our Services, or for other legitimate business purposes such as resolving disputes, safety and security reasons, or complying with our legal obligations How long we retain Personal Information will depend on a number of factors, such as the amount, nature, and sensitivity of the information, the potential risk of harm from unauthorized use or disclosure, our purpose for processing the information, and any legal requirements If you are a registered user, you may access certain information associated with your Account by logging into our Services or emailingprivacy@digitalocean.com If you terminate your Account, any public activity on your Account prior to deletion may remain stored on our servers and may remain accessible to the public",
          "similarity_score": 0.6007
        }
      ]
    }
  },
  {
    "article_number": 35,
    "article_title": "Data protection impact assessment",
    "matches": {
      "14.": [
        {
          "matched_policy_passage": "The measures we use are designed to provide a level of security appropriate to the risk of processing your Personal Information For more information on Digital. Oceanâs security controls, please see the following resources: Data Processing Agreement (DPA) Data Processing Agreement (DPA) Certification Reports Certification Reports We retain your Personal Information for as long as necessary to provide you our Services, or for other legitimate business purposes such as resolving disputes, safety and security reasons, or complying with our legal obligations How long we retain Personal Information will depend on a number of factors, such as the amount, nature, and sensitivity of the information, the potential risk of harm from unauthorized use or disclosure, our purpose for processing the information, and any legal requirements If you are a registered user, you may access certain information associated with your Account by logging into our Services or emailingprivacy@digitalocean.com",
          "similarity_score": 0.6224
        }
      ]
    }
  },
  {
    "article_number": 17,
    "article_title": "Right to erasure (‘right to be forgotten’)",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "All Account data will be deleted within 90 days of purging Right to object to the processing of your Personal Information, asking us to restrict the processing of your Personal Information, or requesting portability of your Personal Information Again, you can exercise these rights by emailingprivacy@digitalocean.com Right to object to the processing of your Personal Information, asking us to restrict the processing of your Personal Information, or requesting portability of your Personal Information",
          "similarity_score": 0.6179
        }
      ]
    }
  },
  {
    "article_number": 38,
    "article_title": "Position of the data protection officer",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "Right to complain to a data protection authority about our collection and use of your Personal Information For more information, please contact your local data protection authority Right to complain to a data protection authority about our collection and use of your Personal Information For more information, please contact your local data protection authority",
          "similarity_score": 0.6118
        },
        {
          "matched_policy_passage": "For more information, please contact your local data protection authority Right to complain to a data protection authority about our collection and use of your Personal Information For more information, please contact your local data protection authority We respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws",
          "similarity_score": 0.7083
        },
        {
          "matched_policy_passage": "Right to complain to a data protection authority about our collection and use of your Personal Information For more information, please contact your local data protection authority We respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws You can use some of the features of the Services without registering, thereby limiting the type of information that we collect",
          "similarity_score": 0.7374
        }
      ]
    }
  },
  {
    "article_number": 13,
    "article_title": "Information to be provided where personal data are collected from the data subject",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "For more information, please contact your local data protection authority We respond to all requests we receive from individuals wishing to exercise their data protection rights in accordance with applicable data protection laws You can use some of the features of the Services without registering, thereby limiting the type of information that we collect You may unsubscribe from receiving certain promotional emails from us",
          "similarity_score": 0.6981
        }
      ]
    }
  }
]