[
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "This can take the form of sharing a list of saved items for example.When you use the platform to share information about others, its your responsibility to ensure that each person you provide personal data about is aware that youre doing so and understands how Booking.com uses their personal data (as described in this privacy statement).Personal data we collect automatically. Whether or not you make a trip reservation, when you use our websites or mobile apps, we automatically collect certain information This includes your IP address, the dates and times of using our platform and selected information about your devices hardware and software (e.g operating system, internet browser, mobile app version, language settings) When you are redirected by a third-party website or mobile app to a Booking.com website or mobile app, we collect this as well",
          "similarity_score": 0.6071
        },
        {
          "matched_policy_passage": "You can ask us for a copy of the personal data we hold about you You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current",
          "similarity_score": 0.6005
        }
      ]
    }
  },
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "We then automatically delete the call recording unless we determine before then that it will be necessary to retain it for fraud investigation or legal purposes.K Promotion of a safe and trustworthy service and prevention of fraud. We continuously analyze and use certain personal data to prevent and detect online fraud attempts and other illegal or unwanted activities This is necessary to maintain our platform as a trustworthy environment as well as for the safety of all travelers.We use personal data for safety and security purposes, including when you report a safety concern, when others do so about you, or when we need to identify persons in connection with a user account or reservation When we do this, we may have to stop or put certain reservations on hold until weve finished our assessment",
          "similarity_score": 0.6326
        },
        {
          "matched_policy_passage": "Promotion of a safe and trustworthy service and prevention of fraud. We continuously analyze and use certain personal data to prevent and detect online fraud attempts and other illegal or unwanted activities This is necessary to maintain our platform as a trustworthy environment as well as for the safety of all travelers.We use personal data for safety and security purposes, including when you report a safety concern, when others do so about you, or when we need to identify persons in connection with a user account or reservation When we do this, we may have to stop or put certain reservations on hold until weve finished our assessment If we have concerns about serious misconduct, we may decide to cancel your upcoming reservations or to decline future reservations via our platform.In case of safety or security concerns, we may process information from publicly available sources to prevent or detect harm",
          "similarity_score": 0.6441
        },
        {
          "matched_policy_passage": "We then automatically delete the call recording unless we determine before then that it will be necessary to retain it for fraud investigation or legal purposes K. Promotion of a safe and trustworthy service and prevention of fraud K. Promotion of a safe and trustworthy service and prevention of fraud K. Promotion of a safe and trustworthy service and prevention of fraud We continuously analyze and use certain personal data to prevent and detect online fraud attempts and other illegal or unwanted activities This is necessary to maintain our platform as a trustworthy environment as well as for the safety of all travelers We use personal data for safety and security purposes, including when you report a safety concern, when others do so about you, or when we need to identify persons in connection with a user account or reservation",
          "similarity_score": 0.6057
        },
        {
          "matched_policy_passage": "In case of safety or security concerns, we may process information from publicly available sources to prevent or detect harm We cannot prevent that some of that information may contain special categories of personal data In order to detect and prevent fraud and limit other abuse of our platform, we may use your personal data and analyze your behavior on our platform to assess the risk of a certain action or transaction you are attempting to make For example, this may help us determine whether a bot is using our platform rather than a legitimate user, or to determine whether a user is making a fraudulent payment using a stolen credit card",
          "similarity_score": 0.6222
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "Before we process personal data to serve Booking.coms or a third-party's legitimate interests, Booking.com balances your rights and interests in the protection of personal data with Booking.coms rights and interests or those of the third party.The legitimate interests include, for example, avoiding financial harm from online fraud, sharing peoples experiences with prospective travelers, and keeping people informed about offers we think might be of interest.In the unlikely event Booking.com would process special categories of personal data in the context of purpose K, we rely, where applicable, on the fact that processing relates to personal data which are manifestly made public by the individual or other legal bases as may be assessed at the time.L Legal purposes. Booking.com also relies, where applicable, on compliance with legal obligations (e.g lawful law enforcement requests).All purpose categories. Finally, where needed under evolving applicable law, Booking.com will obtain your consent prior to processing your personal data, including for direct marketing purposes or where otherwise required by law.If you want to object to the processing set out under. C to Land no opt-out mechanism is available to you directly (e.g in your user account settings), contact us as described in the. Your rightssection.How we share personal data within Booking.com. To support the use of Booking.com services, your details may be shared within Booking.com group entities and the other Booking Holdings Inc. companies described in the section on. Our company.How we share personal data within the Booking Holdings Inc. group. We may receive personal data about you from other companies in the BHI group (e.g",
          "similarity_score": 0.6063
        },
        {
          "matched_policy_passage": "Before we process personal data to serve Booking.coms or a third-party's legitimate interests, Booking.com balances your rights and interests in the protection of personal data with Booking.coms rights and interests or those of the third party.The legitimate interests include, for example, avoiding financial harm from online fraud, sharing peoples experiences with prospective travelers, and keeping people informed about offers we think might be of interest.In the unlikely event Booking.com would process special categories of personal data in the context of purpose K, we rely, where applicable, on the fact that processing relates to personal data which are manifestly made public by the individual or other legal bases as may be assessed at the time.L Legal purposes. Booking.com also relies, where applicable, on compliance with legal obligations (e.g lawful law enforcement requests).All purpose categories. Finally, where needed under evolving applicable law, Booking.com will obtain your consent prior to processing your personal data, including for direct marketing purposes or where otherwise required by law Purpose of personal data processing. Legal basis and comments. A",
          "similarity_score": 0.6063
        },
        {
          "matched_policy_passage": "Before we process personal data to serve Booking.coms or a third-party's legitimate interests, Booking.com balances your rights and interests in the protection of personal data with Booking.coms rights and interests or those of the third party.The legitimate interests include, for example, avoiding financial harm from online fraud, sharing peoples experiences with prospective travelers, and keeping people informed about offers we think might be of interest.In the unlikely event Booking.com would process special categories of personal data in the context of purpose K, we rely, where applicable, on the fact that processing relates to personal data which are manifestly made public by the individual or other legal bases as may be assessed at the time.L Legal purposes. Booking.com also relies, where applicable, on compliance with legal obligations (e.g lawful law enforcement requests).All purpose categories. Finally, where needed under evolving applicable law, Booking.com will obtain your consent prior to processing your personal data, including for direct marketing purposes or where otherwise required by law Purpose of personal data processing Legal basis and comments A",
          "similarity_score": 0.6063
        },
        {
          "matched_policy_passage": "Before we process personal data to serve Booking.coms or a third-party's legitimate interests, Booking.com balances your rights and interests in the protection of personal data with Booking.coms rights and interests or those of the third party.The legitimate interests include, for example, avoiding financial harm from online fraud, sharing peoples experiences with prospective travelers, and keeping people informed about offers we think might be of interest.In the unlikely event Booking.com would process special categories of personal data in the context of purpose K, we rely, where applicable, on the fact that processing relates to personal data which are manifestly made public by the individual or other legal bases as may be assessed at the time Booking.com also relies, where applicable, on compliance with legal obligations (e.g lawful law enforcement requests) All purpose categories Finally, where needed under evolving applicable law, Booking.com will obtain your consent prior to processing your personal data, including for direct marketing purposes or where otherwise required by law",
          "similarity_score": 0.6063
        }
      ],
      "2.": [
        {
          "matched_policy_passage": "In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party Withdrawal of consent Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law",
          "similarity_score": 0.7128
        }
      ]
    }
  },
  {
    "article_number": 50,
    "article_title": "International cooperation for the protection of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "email address, phone number) to enable matching with data in one or more of their databases Such techniques limit what the receiving third-party company can do with the personal data we selectively share with them.Other professional third parties. In some cases (e.g disputes, legal claims, or as part of auditing activities), we may need to share your personal data with representatives of professional service organizations These representatives can include legal counsels at law firms as well as auditors",
          "similarity_score": 0.6245
        },
        {
          "matched_policy_passage": "Such techniques limit what the receiving third-party company can do with the personal data we selectively share with them.Other professional third parties. In some cases (e.g disputes, legal claims, or as part of auditing activities), we may need to share your personal data with representatives of professional service organizations These representatives can include legal counsels at law firms as well as auditors We only share your personal data to the extent that is necessary and in line with contractual and other obligations applicable to them.Competent authorities. We follow specific protocols when law enforcement agencies and other government bodies request us to disclose to them personal data about one or more travelers in connection with a possible criminal matter",
          "similarity_score": 0.6502
        },
        {
          "matched_policy_passage": "disputes, legal claims, or as part of auditing activities), we may need to share your personal data with representatives of professional service organizations These representatives can include legal counsels at law firms as well as auditors We only share your personal data to the extent that is necessary and in line with contractual and other obligations applicable to them.Competent authorities. We follow specific protocols when law enforcement agencies and other government bodies request us to disclose to them personal data about one or more travelers in connection with a possible criminal matter We may also disclose personal data to law enforcement agencies in connection with possible cases of fraud.We follow similar protocols where, for example, EU and local laws additionally require us to share personal data with the competent authority, such as a tax authority",
          "similarity_score": 0.6395
        },
        {
          "matched_policy_passage": "These representatives can include legal counsels at law firms as well as auditors We only share your personal data to the extent that is necessary and in line with contractual and other obligations applicable to them.Competent authorities. We follow specific protocols when law enforcement agencies and other government bodies request us to disclose to them personal data about one or more travelers in connection with a possible criminal matter We may also disclose personal data to law enforcement agencies in connection with possible cases of fraud.We follow similar protocols where, for example, EU and local laws additionally require us to share personal data with the competent authority, such as a tax authority Such disclosures by us may be required to:Comply with a legal obligation, for instance, under applicable short-term rental laws. Protect and defend our rights or the rights and interests of our business partners.Other business partners. We may share personal data in other instances with other business partners",
          "similarity_score": 0.6433
        },
        {
          "matched_policy_passage": "We may also disclose personal data to law enforcement agencies in connection with possible cases of fraud.We follow similar protocols where, for example, EU and local laws additionally require us to share personal data with the competent authority, such as a tax authority Such disclosures by us may be required to:Comply with a legal obligation, for instance, under applicable short-term rental laws. Protect and defend our rights or the rights and interests of our business partners.Other business partners. We may share personal data in other instances with other business partners These include:Insurance companies: If an insurance claim is made, concerning you and a trip provider, we may provide the necessary data (including personal data) to the insurance company and their appointed representatives for further processing.Other trip providers: We may present you with a Partner offer When you book a stay marked Partner offer, your reservation will be facilitated by a trip provider who is separate from the accommodation youre booking",
          "similarity_score": 0.6844
        },
        {
          "matched_policy_passage": "The data that we collect from you, as described in this privacy statement, could be made accessible from, transferred to, or stored in countries that may not have the same data protection laws as the country in which you initially provided the information In any case, we apply appropriate safeguards to make sure that cross-border transfers of personal data comply with applicable law and seek to ensure that your data continues to receive a comparable level of protection.In particular, if youre in the European Economic Area (EEA) and your personal data is transferred to third-party service providers in countries not considered adequate by the European Commission (EC), we establish and implement appropriate contractual, organizational, and technical measures with these third-party companies This is done by using Standard Contractual Clauses as approved by the EC, by examining the countries to which the data may be transferred, and by imposing specific technical and organizational measures.In certain cases, we transfer your data outside the EEA because its necessary to conclude or perform the contract we have with you For example, if you make a trip reservation involving a trip provider or strategic partner operating outside the EEA, its likely to require that we transfer data about your specific reservation outside of the EEA.For transfers of your personal data outside of the United Kingdom (UK), we apply the equivalent mechanisms and appropriate safeguards for the UK.You can ask us for more information on our implemented safeguards by contacting us as described in the section. Your rights.Information regarding specific markets and products & services. Depending on the type of product or service that concerns you and other factors such as where you live, we may have additional information to provide you that supplements or even replaces the information elsewhere in this notice",
          "similarity_score": 0.7095
        },
        {
          "matched_policy_passage": "Such techniques limit what the receiving third-party company can do with the personal data we selectively share with them Other professional third parties Other professional third parties Other professional third parties In some cases (e.g disputes, legal claims, or as part of auditing activities), we may need to share your personal data with representatives of professional service organizations These representatives can include legal counsels at law firms as well as auditors",
          "similarity_score": 0.6082
        },
        {
          "matched_policy_passage": "disputes, legal claims, or as part of auditing activities), we may need to share your personal data with representatives of professional service organizations These representatives can include legal counsels at law firms as well as auditors We only share your personal data to the extent that is necessary and in line with contractual and other obligations applicable to them Competent authorities Competent authorities Competent authorities We follow specific protocols when law enforcement agencies and other government bodies request us to disclose to them personal data about one or more travelers in connection with a possible criminal matter",
          "similarity_score": 0.6254
        },
        {
          "matched_policy_passage": "We follow similar protocols where, for example, EU and local laws additionally require us to share personal data with the competent authority, such as a tax authority Such disclosures by us may be required to: Comply with a legal obligation, for instance, under applicable short-term rental laws Protect and defend our rights or the rights and interests of our business partners Other business partners Other business partners Other business partners We may share personal data in other instances with other business partners These include: Insurance companies: If an insurance claim is made, concerning you and a trip provider, we may provide the necessary data (including personal data) to the insurance company and their appointed representatives for further processing",
          "similarity_score": 0.6779
        },
        {
          "matched_policy_passage": "The data that we collect from you, as described in this privacy statement, could be made accessible from, transferred to, or stored in countries that may not have the same data protection laws as the country in which you initially provided the information In any case, we apply appropriate safeguards to make sure that cross-border transfers of personal data comply with applicable law and seek to ensure that your data continues to receive a comparable level of protection In particular, if youre in the European Economic Area (EEA) and your personal data is transferred to third-party service providers in countries not considered adequate by the European Commission (EC), we establish and implement appropriate contractual, organizational, and technical measures with these third-party companies This is done by using Standard Contractual Clauses as approved by the EC, by examining the countries to which the data may be transferred, and by imposing specific technical and organizational measures",
          "similarity_score": 0.7178
        }
      ],
      "2.": [
        {
          "matched_policy_passage": "Competent authorities Competent authorities Competent authorities We follow specific protocols when law enforcement agencies and other government bodies request us to disclose to them personal data about one or more travelers in connection with a possible criminal matter We may also disclose personal data to law enforcement agencies in connection with possible cases of fraud We follow similar protocols where, for example, EU and local laws additionally require us to share personal data with the competent authority, such as a tax authority Such disclosures by us may be required to: Comply with a legal obligation, for instance, under applicable short-term rental laws Protect and defend our rights or the rights and interests of our business partners",
          "similarity_score": 0.6894
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "For transfers of your personal data outside of the United Kingdom (UK), we apply the equivalent mechanisms and appropriate safeguards for the UK You can ask us for more information on our implemented safeguards by contacting us as described in the section. Your rights Information regarding specific markets and products & services Depending on the type of product or service that concerns you and other factors such as where you live, we may have additional information to provide you that supplements or even replaces the information elsewhere in this notice Review the sections below that apply to you in order to get the full picture",
          "similarity_score": 0.6502
        }
      ]
    }
  },
  {
    "article_number": 14,
    "article_title": "Information to be provided where personal data have not been obtained from the data subject",
    "matches": {
      "25.": [
        {
          "matched_policy_passage": "We only share your personal data to the extent that is necessary and in line with contractual and other obligations applicable to them.Competent authorities. We follow specific protocols when law enforcement agencies and other government bodies request us to disclose to them personal data about one or more travelers in connection with a possible criminal matter We may also disclose personal data to law enforcement agencies in connection with possible cases of fraud.We follow similar protocols where, for example, EU and local laws additionally require us to share personal data with the competent authority, such as a tax authority Such disclosures by us may be required to:Comply with a legal obligation, for instance, under applicable short-term rental laws. Protect and defend our rights or the rights and interests of our business partners.Other business partners. We may share personal data in other instances with other business partners These include:Insurance companies: If an insurance claim is made, concerning you and a trip provider, we may provide the necessary data (including personal data) to the insurance company and their appointed representatives for further processing.Other trip providers: We may present you with a Partner offer",
          "similarity_score": 0.7041
        },
        {
          "matched_policy_passage": "We only share your personal data to the extent that is necessary and in line with contractual and other obligations applicable to them Competent authorities Competent authorities Competent authorities We follow specific protocols when law enforcement agencies and other government bodies request us to disclose to them personal data about one or more travelers in connection with a possible criminal matter We may also disclose personal data to law enforcement agencies in connection with possible cases of fraud We follow similar protocols where, for example, EU and local laws additionally require us to share personal data with the competent authority, such as a tax authority",
          "similarity_score": 0.6764
        },
        {
          "matched_policy_passage": "We may also disclose personal data to law enforcement agencies in connection with possible cases of fraud We follow similar protocols where, for example, EU and local laws additionally require us to share personal data with the competent authority, such as a tax authority Such disclosures by us may be required to: Comply with a legal obligation, for instance, under applicable short-term rental laws Protect and defend our rights or the rights and interests of our business partners Other business partners Other business partners Other business partners We may share personal data in other instances with other business partners",
          "similarity_score": 0.6841
        }
      ],
      "18.": [
        {
          "matched_policy_passage": "To do this, we use personal data such as your contact and account information, browsing data, location data, and preferences, as well as searches and reservations you make from different devices E. Communicating with you E. Communicating with you E. Communicating with you There may be times when we get in touch with you, including via email, chatbot, mail, phone call, push notification, platform notification, or text message Which method we choose depends on the contact information youve previously shared We process personal data in communications you and other parties send to us",
          "similarity_score": 0.6435
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "As part of the reservation process, well need to share some relevant personal data with this trip provider If you book a Partner offer, review the information provided in the reservation process or check your reservation confirmation for more information about the trip provider and how your personal data will be further processed by them.Safeguards for international transfers of personal data. Booking.com is a business that connects travelers and partners around the world The data that we collect from you, as described in this privacy statement, could be made accessible from, transferred to, or stored in countries that may not have the same data protection laws as the country in which you initially provided the information In any case, we apply appropriate safeguards to make sure that cross-border transfers of personal data comply with applicable law and seek to ensure that your data continues to receive a comparable level of protection.In particular, if youre in the European Economic Area (EEA) and your personal data is transferred to third-party service providers in countries not considered adequate by the European Commission (EC), we establish and implement appropriate contractual, organizational, and technical measures with these third-party companies",
          "similarity_score": 0.6174
        },
        {
          "matched_policy_passage": "As part of the reservation process, well need to share some relevant personal data with this trip provider If you book a Partner offer, review the information provided in the reservation process or check your reservation confirmation for more information about the trip provider and how your personal data will be further processed by them Safeguards for international transfers of personal data Booking.com is a business that connects travelers and partners around the world The data that we collect from you, as described in this privacy statement, could be made accessible from, transferred to, or stored in countries that may not have the same data protection laws as the country in which you initially provided the information",
          "similarity_score": 0.6031
        },
        {
          "matched_policy_passage": "How we share personal data with third parties Note that, sometimes, at the direction of the ground transportation provider, well need to share your personal data with parties related to the provider in order to finalize and administer your reservation These parties might include other entities of the providers corporate group or service providers, drivers, or end fleets who are handling the data on the providers behalf Car rental companies may also ask for additional personal data, for example, to provide additional services or to comply with local restrictions Be aware that any information you provide directly to the company/companies supplying your car and/or related products will be stored and used in accordance with their own privacy statement(s) and terms and conditions",
          "similarity_score": 0.6145
        }
      ],
      "6.": [
        {
          "matched_policy_passage": "features addressed to families).If we become aware (e.g via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it.Your rights. We want you to be in control of how your personal data is used by us You can do this in the following ways:Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account",
          "similarity_score": 0.6295
        },
        {
          "matched_policy_passage": "via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it.Your rights. We want you to be in control of how your personal data is used by us You can do this in the following ways:Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law.We offer various ways for you to exercise your rights or raise questions and concerns about your personal data at Booking.com:Directly from your account. If you have a user account, you can access a lot of your personal data through our websites or mobile apps",
          "similarity_score": 0.6257
        },
        {
          "matched_policy_passage": "You can do this in the following ways:Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law.We offer various ways for you to exercise your rights or raise questions and concerns about your personal data at Booking.com:Directly from your account. If you have a user account, you can access a lot of your personal data through our websites or mobile apps Youll generally find the option to add, update, or remove information we have about you in your user account settings.Using our Data Subject Request form. If you cant perform an action through our websites or mobile apps (e.g",
          "similarity_score": 0.6071
        },
        {
          "matched_policy_passage": "If we become aware (e.g via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it Your rights. We want you to be in control of how your personal data is used by us You can do this in the following ways:Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you",
          "similarity_score": 0.6681
        },
        {
          "matched_policy_passage": "via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it Your rights. We want you to be in control of how your personal data is used by us You can do this in the following ways:Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account",
          "similarity_score": 0.6343
        },
        {
          "matched_policy_passage": "We want you to be in control of how your personal data is used by us You can do this in the following ways: Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law",
          "similarity_score": 0.6076
        },
        {
          "matched_policy_passage": "You can do this in the following ways: Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you",
          "similarity_score": 0.6071
        },
        {
          "matched_policy_passage": "Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you",
          "similarity_score": 0.6368
        },
        {
          "matched_policy_passage": "Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law You can ask us for a copy of the personal data we hold about you",
          "similarity_score": 0.6368
        },
        {
          "matched_policy_passage": "You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data",
          "similarity_score": 0.6233
        },
        {
          "matched_policy_passage": "We rely on you to make sure that your personal info is complete, accurate, and current You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party",
          "similarity_score": 0.6396
        }
      ]
    }
  },
  {
    "article_number": 49,
    "article_title": "Derogations for specific situations",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "If you book a Partner offer, review the information provided in the reservation process or check your reservation confirmation for more information about the trip provider and how your personal data will be further processed by them.Safeguards for international transfers of personal data. Booking.com is a business that connects travelers and partners around the world The data that we collect from you, as described in this privacy statement, could be made accessible from, transferred to, or stored in countries that may not have the same data protection laws as the country in which you initially provided the information In any case, we apply appropriate safeguards to make sure that cross-border transfers of personal data comply with applicable law and seek to ensure that your data continues to receive a comparable level of protection.In particular, if youre in the European Economic Area (EEA) and your personal data is transferred to third-party service providers in countries not considered adequate by the European Commission (EC), we establish and implement appropriate contractual, organizational, and technical measures with these third-party companies This is done by using Standard Contractual Clauses as approved by the EC, by examining the countries to which the data may be transferred, and by imposing specific technical and organizational measures.In certain cases, we transfer your data outside the EEA because its necessary to conclude or perform the contract we have with you",
          "similarity_score": 0.6242
        },
        {
          "matched_policy_passage": "If you book a Partner offer, review the information provided in the reservation process or check your reservation confirmation for more information about the trip provider and how your personal data will be further processed by them Safeguards for international transfers of personal data Booking.com is a business that connects travelers and partners around the world The data that we collect from you, as described in this privacy statement, could be made accessible from, transferred to, or stored in countries that may not have the same data protection laws as the country in which you initially provided the information In any case, we apply appropriate safeguards to make sure that cross-border transfers of personal data comply with applicable law and seek to ensure that your data continues to receive a comparable level of protection",
          "similarity_score": 0.6309
        }
      ],
      "7.": [
        {
          "matched_policy_passage": "The limited circumstances we might need to collect the personal data of minors from parents or guardians include:As part of a reservation. The purchase of other travel-related services. In other exceptional circumstances (e.g features addressed to families).If we become aware (e.g via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it.Your rights. We want you to be in control of how your personal data is used by us You can do this in the following ways:Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you",
          "similarity_score": 0.6079
        }
      ]
    }
  },
  {
    "article_number": 30,
    "article_title": "Records of processing activities",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "In any case, we apply appropriate safeguards to make sure that cross-border transfers of personal data comply with applicable law and seek to ensure that your data continues to receive a comparable level of protection.In particular, if youre in the European Economic Area (EEA) and your personal data is transferred to third-party service providers in countries not considered adequate by the European Commission (EC), we establish and implement appropriate contractual, organizational, and technical measures with these third-party companies This is done by using Standard Contractual Clauses as approved by the EC, by examining the countries to which the data may be transferred, and by imposing specific technical and organizational measures.In certain cases, we transfer your data outside the EEA because its necessary to conclude or perform the contract we have with you For example, if you make a trip reservation involving a trip provider or strategic partner operating outside the EEA, its likely to require that we transfer data about your specific reservation outside of the EEA.For transfers of your personal data outside of the United Kingdom (UK), we apply the equivalent mechanisms and appropriate safeguards for the UK.You can ask us for more information on our implemented safeguards by contacting us as described in the section. Your rights.Information regarding specific markets and products & services. Depending on the type of product or service that concerns you and other factors such as where you live, we may have additional information to provide you that supplements or even replaces the information elsewhere in this notice Review the sections below that apply to you in order to get the full picture.Ground transportation. If your use of our services includes ground transportation, the information in this section applies to you",
          "similarity_score": 0.7209
        },
        {
          "matched_policy_passage": "Safeguards for international transfers of personal data Booking.com is a business that connects travelers and partners around the world The data that we collect from you, as described in this privacy statement, could be made accessible from, transferred to, or stored in countries that may not have the same data protection laws as the country in which you initially provided the information In any case, we apply appropriate safeguards to make sure that cross-border transfers of personal data comply with applicable law and seek to ensure that your data continues to receive a comparable level of protection In particular, if youre in the European Economic Area (EEA) and your personal data is transferred to third-party service providers in countries not considered adequate by the European Commission (EC), we establish and implement appropriate contractual, organizational, and technical measures with these third-party companies",
          "similarity_score": 0.6999
        },
        {
          "matched_policy_passage": "In any case, we apply appropriate safeguards to make sure that cross-border transfers of personal data comply with applicable law and seek to ensure that your data continues to receive a comparable level of protection In particular, if youre in the European Economic Area (EEA) and your personal data is transferred to third-party service providers in countries not considered adequate by the European Commission (EC), we establish and implement appropriate contractual, organizational, and technical measures with these third-party companies This is done by using Standard Contractual Clauses as approved by the EC, by examining the countries to which the data may be transferred, and by imposing specific technical and organizational measures In certain cases, we transfer your data outside the EEA because its necessary to conclude or perform the contract we have with you",
          "similarity_score": 0.7229
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "This is done by using Standard Contractual Clauses as approved by the EC, by examining the countries to which the data may be transferred, and by imposing specific technical and organizational measures.In certain cases, we transfer your data outside the EEA because its necessary to conclude or perform the contract we have with you For example, if you make a trip reservation involving a trip provider or strategic partner operating outside the EEA, its likely to require that we transfer data about your specific reservation outside of the EEA.For transfers of your personal data outside of the United Kingdom (UK), we apply the equivalent mechanisms and appropriate safeguards for the UK.You can ask us for more information on our implemented safeguards by contacting us as described in the section. Your rights.Information regarding specific markets and products & services. Depending on the type of product or service that concerns you and other factors such as where you live, we may have additional information to provide you that supplements or even replaces the information elsewhere in this notice Review the sections below that apply to you in order to get the full picture.Ground transportation. If your use of our services includes ground transportation, the information in this section applies to you It adds to, or replaces, the information in other parts of this privacy statement.In addition to what we list in. Personal data you give to us, for a car rental reservation we might also ask for your home address, billing address, phone number, date and place of birth, passport and drivers license info, government-issued ID (where required by law), and the names of any additional drivers",
          "similarity_score": 0.6958
        },
        {
          "matched_policy_passage": "This is done by using Standard Contractual Clauses as approved by the EC, by examining the countries to which the data may be transferred, and by imposing specific technical and organizational measures In certain cases, we transfer your data outside the EEA because its necessary to conclude or perform the contract we have with you For example, if you make a trip reservation involving a trip provider or strategic partner operating outside the EEA, its likely to require that we transfer data about your specific reservation outside of the EEA For transfers of your personal data outside of the United Kingdom (UK), we apply the equivalent mechanisms and appropriate safeguards for the UK",
          "similarity_score": 0.6854
        },
        {
          "matched_policy_passage": "In certain cases, we transfer your data outside the EEA because its necessary to conclude or perform the contract we have with you For example, if you make a trip reservation involving a trip provider or strategic partner operating outside the EEA, its likely to require that we transfer data about your specific reservation outside of the EEA For transfers of your personal data outside of the United Kingdom (UK), we apply the equivalent mechanisms and appropriate safeguards for the UK You can ask us for more information on our implemented safeguards by contacting us as described in the section. Your rights",
          "similarity_score": 0.6009
        }
      ]
    }
  },
  {
    "article_number": 47,
    "article_title": "Binding corporate rules",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "These parties might include other entities of the providers corporate group or service providers, drivers, or end fleets who are handling the data on the providers behalf.Car rental companies may also ask for additional personal data, for example, to provide additional services or to comply with local restrictions Be aware that any information you provide directly to the company/companies supplying your car and/or related products will be stored and used in accordance with their own privacy statement(s) and terms and conditions.Return to main notice. Insurance. If you purchase an insurance product while using our platform, the information in this section applies to you It adds to, or replaces, the information in other parts of this privacy statement.The offering of insurance can involve multiple parties, such as intermediaries, underwriters, and other agents Where Booking.com Distribution B.V. is involved, it will act as the intermediary and authorized agent or appointed representative (depending on the jurisdiction) on behalf of the insurer, by offering insurance products and services to Booking.com customers.Review the information provided during the reservation process for more information about us and the parties who work together with us to offer you these products and services",
          "similarity_score": 0.6106
        },
        {
          "matched_policy_passage": "These parties might include other entities of the providers corporate group or service providers, drivers, or end fleets who are handling the data on the providers behalf Car rental companies may also ask for additional personal data, for example, to provide additional services or to comply with local restrictions Be aware that any information you provide directly to the company/companies supplying your car and/or related products will be stored and used in accordance with their own privacy statement(s) and terms and conditions Return to main notice Return to main notice If you purchase an insurance product while using our platform, the information in this section applies to you",
          "similarity_score": 0.6367
        }
      ],
      "19.": [
        {
          "matched_policy_passage": "Return to main notice Return to main notice How we protect personal data. We combine people, processes, and technology to protect your personal data and respect your privacy.This includes, among other things, that we:Maintain a comprehensive framework of security policies, procedures, and protocols. Employ personnel dedicated to cybersecurity and data protection. Keep staff alert to security risks through continual security training and awareness activities. Use up-to-date security technologies such as encryption and data leakage prevention to help guard against unauthorized data disclosure or destruction. Maintain inventories to provide oversight over processes, systems, and data assets. Use multiple systems for fraud prevention/detection and continuous system monitoring, including for security purposes. Use identity and access management and other logical and physical access restrictions to control that only authorized personnel can access personal data. Maintain and test protocols to respond to reports about possible incidents and data breaches. Verify and enhance our security systems, procedures, and protocols on a recurring basis. Impose equivalent measures on third parties we appoint. We use retention practices to keep and, where possible under applicable law, dispose of personal data Generally, we keep your personal data for as long as is necessary to:Enable you to use our services or to provide our services to you. Prevent and detect online fraud attempts and/or other illegal activities. Comply with legal obligations such as those from accounting and tax laws. Resolve any disputes and legal claims. How you can further protect your personal data on Booking.com. While not mandatory for your use of Booking.coms platform, we recommend that you:Use a user account where available on our platform By using a user account, you can protect access to your data (e.g your reservation history, your Wallet) with a strong password as well as two-factor authentication.Use unique passwords for every online service including for your access to Booking.com",
          "similarity_score": 0.6269
        },
        {
          "matched_policy_passage": "How we protect personal data We combine people, processes, and technology to protect your personal data and respect your privacy This includes, among other things, that we: Maintain a comprehensive framework of security policies, procedures, and protocols Employ personnel dedicated to cybersecurity and data protection Keep staff alert to security risks through continual security training and awareness activities Use up-to-date security technologies such as encryption and data leakage prevention to help guard against unauthorized data disclosure or destruction Maintain inventories to provide oversight over processes, systems, and data assets Use multiple systems for fraud prevention/detection and continuous system monitoring, including for security purposes Use identity and access management and other logical and physical access restrictions to control that only authorized personnel can access personal data Maintain and test protocols to respond to reports about possible incidents and data breaches Verify and enhance our security systems, procedures, and protocols on a recurring basis Impose equivalent measures on third parties we appoint We use retention practices to keep and, where possible under applicable law, dispose of personal data Generally, we keep your personal data for as long as is necessary to: Enable you to use our services or to provide our services to you Prevent and detect online fraud attempts and/or other illegal activities Comply with legal obligations such as those from accounting and tax laws Resolve any disputes and legal claims How you can further protect your personal data on Booking.com While not mandatory for your use of Booking.coms platform, we recommend that you: Use a user account where available on our platform By using a user account, you can protect access to your data (e.g",
          "similarity_score": 0.6557
        },
        {
          "matched_policy_passage": "This includes, among other things, that we: Maintain a comprehensive framework of security policies, procedures, and protocols Employ personnel dedicated to cybersecurity and data protection Keep staff alert to security risks through continual security training and awareness activities Use up-to-date security technologies such as encryption and data leakage prevention to help guard against unauthorized data disclosure or destruction Maintain inventories to provide oversight over processes, systems, and data assets Use multiple systems for fraud prevention/detection and continuous system monitoring, including for security purposes Use identity and access management and other logical and physical access restrictions to control that only authorized personnel can access personal data Maintain and test protocols to respond to reports about possible incidents and data breaches Verify and enhance our security systems, procedures, and protocols on a recurring basis Impose equivalent measures on third parties we appoint We use retention practices to keep and, where possible under applicable law, dispose of personal data Generally, we keep your personal data for as long as is necessary to: Enable you to use our services or to provide our services to you Prevent and detect online fraud attempts and/or other illegal activities Comply with legal obligations such as those from accounting and tax laws Resolve any disputes and legal claims How you can further protect your personal data on Booking.com While not mandatory for your use of Booking.coms platform, we recommend that you: Use a user account where available on our platform By using a user account, you can protect access to your data (e.g your reservation history, your Wallet) with a strong password as well as two-factor authentication",
          "similarity_score": 0.6827
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "We consider whether your rights and freedoms arent unduly infringed upon by the processing of your personal data and only proceed where this legitimate interest isnt overridden by your rights In other cases where we may use AI, well seek your consent where this is required In other cases where we may use AI, well seek your consent where this is required We assess our AI systems against data protection principles, such as minimization, accuracy, and purpose limitation",
          "similarity_score": 0.6041
        }
      ]
    }
  },
  {
    "article_number": 8,
    "article_title": "Conditions applicable to child's consent in relation to information society services",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We dont collect personal data about people below that age (collectively called minors) unless that data is provided by (and with the consent of) a parent or guardian The limited circumstances we might need to collect the personal data of minors from parents or guardians include:As part of a reservation. The purchase of other travel-related services. In other exceptional circumstances (e.g features addressed to families).If we become aware (e.g via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it.Your rights. We want you to be in control of how your personal data is used by us",
          "similarity_score": 0.6514
        },
        {
          "matched_policy_passage": "How we treat personal data belonging to minors. Our services are not intended for people under the age of 18 We dont collect personal data about people below that age (collectively called minors) unless that data is provided by (and with the consent of) a parent or guardian The limited circumstances we might need to collect the personal data of minors from parents or guardians include:As part of a reservation. The purchase of other travel-related services. In other exceptional circumstances (e.g features addressed to families).If we become aware (e.g",
          "similarity_score": 0.6525
        },
        {
          "matched_policy_passage": "We dont collect personal data about people below that age (collectively called minors) unless that data is provided by (and with the consent of) a parent or guardian The limited circumstances we might need to collect the personal data of minors from parents or guardians include:As part of a reservation. The purchase of other travel-related services. In other exceptional circumstances (e.g features addressed to families).If we become aware (e.g via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it",
          "similarity_score": 0.6469
        },
        {
          "matched_policy_passage": "The limited circumstances we might need to collect the personal data of minors from parents or guardians include:As part of a reservation. The purchase of other travel-related services. In other exceptional circumstances (e.g features addressed to families).If we become aware (e.g via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it How we treat personal data belonging to minors Our services are not intended for people under the age of 18",
          "similarity_score": 0.6228
        },
        {
          "matched_policy_passage": "features addressed to families).If we become aware (e.g via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it How we treat personal data belonging to minors Our services are not intended for people under the age of 18 We dont collect personal data about people below that age (collectively called minors) unless that data is provided by (and with the consent of) a parent or guardian",
          "similarity_score": 0.6416
        },
        {
          "matched_policy_passage": "via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it How we treat personal data belonging to minors Our services are not intended for people under the age of 18 We dont collect personal data about people below that age (collectively called minors) unless that data is provided by (and with the consent of) a parent or guardian The limited circumstances we might need to collect the personal data of minors from parents or guardians include: As part of a reservation As part of a reservation The purchase of other travel-related services The purchase of other travel-related services In other exceptional circumstances (e.g",
          "similarity_score": 0.6361
        },
        {
          "matched_policy_passage": "How we treat personal data belonging to minors Our services are not intended for people under the age of 18 We dont collect personal data about people below that age (collectively called minors) unless that data is provided by (and with the consent of) a parent or guardian The limited circumstances we might need to collect the personal data of minors from parents or guardians include: As part of a reservation As part of a reservation The purchase of other travel-related services The purchase of other travel-related services In other exceptional circumstances (e.g features addressed to families)",
          "similarity_score": 0.6457
        },
        {
          "matched_policy_passage": "We dont collect personal data about people below that age (collectively called minors) unless that data is provided by (and with the consent of) a parent or guardian The limited circumstances we might need to collect the personal data of minors from parents or guardians include: As part of a reservation As part of a reservation The purchase of other travel-related services The purchase of other travel-related services In other exceptional circumstances (e.g features addressed to families) In other exceptional circumstances (e.g",
          "similarity_score": 0.6188
        }
      ]
    }
  },
  {
    "article_number": 17,
    "article_title": "Right to erasure (right to be forgotten)",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law.We offer various ways for you to exercise your rights or raise questions and concerns about your personal data at Booking.com:Directly from your account. If you have a user account, you can access a lot of your personal data through our websites or mobile apps Youll generally find the option to add, update, or remove information we have about you in your user account settings.Using our Data Subject Request form. If you cant perform an action through our websites or mobile apps (e.g because certain personal data we have about you isnt accessible online), you can easily submit your request to us via this. Data Subject Request form.By email. If you cant perform an action directly from your user account or using our Data Subject Request form (e.g",
          "similarity_score": 0.6524
        },
        {
          "matched_policy_passage": "We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law.We offer various ways for you to exercise your rights or raise questions and concerns about your personal data at Booking.com:Directly from your account. If you have a user account, you can access a lot of your personal data through our websites or mobile apps Youll generally find the option to add, update, or remove information we have about you in your user account settings.Using our Data Subject Request form. If you cant perform an action through our websites or mobile apps (e.g because certain personal data we have about you isnt accessible online), you can easily submit your request to us via this. Data Subject Request form.By email. If you cant perform an action directly from your user account or using our Data Subject Request form (e.g because a certain option isnt available), you can exercise the data subject rights mentioned in this notice by contacting our privacy team (which includes our Data Protection Officer) via the email address in the. Our company and how we comply with privacy lawssection",
          "similarity_score": 0.6801
        },
        {
          "matched_policy_passage": "Your rights. We want you to be in control of how your personal data is used by us You can do this in the following ways:Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law.We offer various ways for you to exercise your rights or raise questions and concerns about your personal data at Booking.com:Directly from your account. If you have a user account, you can access a lot of your personal data through our websites or mobile apps",
          "similarity_score": 0.6104
        },
        {
          "matched_policy_passage": "You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account",
          "similarity_score": 0.6524
        },
        {
          "matched_policy_passage": "We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law Right. Description. Access. You can ask us for a copy of the personal data we hold about you.Correction. You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law",
          "similarity_score": 0.6801
        },
        {
          "matched_policy_passage": "You can make some of these changes directly online when you have a user account We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law You can ask us for a copy of the personal data we hold about you You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you",
          "similarity_score": 0.6524
        },
        {
          "matched_policy_passage": "We rely on you to make sure that your personal info is complete, accurate, and current.Erasure. You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it.Restriction. In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data.Portability. In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party.Withdrawal of consent. Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law.Objection. Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law You can ask us for a copy of the personal data we hold about you You can inform us anytime of changes to your personal data and ask us to correct certain personal data we hold about you You can make some of these changes directly online when you have a user account",
          "similarity_score": 0.6801
        }
      ]
    }
  },
  {
    "article_number": 38,
    "article_title": "Position of the data protection officer",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "Youll generally find the option to add, update, or remove information we have about you in your user account settings.Using our Data Subject Request form. If you cant perform an action through our websites or mobile apps (e.g because certain personal data we have about you isnt accessible online), you can easily submit your request to us via this. Data Subject Request form.By email. If you cant perform an action directly from your user account or using our Data Subject Request form (e.g because a certain option isnt available), you can exercise the data subject rights mentioned in this notice by contacting our privacy team (which includes our Data Protection Officer) via the email address in the. Our company and how we comply with privacy lawssection You can contact us the same way for any other requests or questions about this privacy statement or if you have a complaint or concern about the processing of your personal data",
          "similarity_score": 0.6045
        },
        {
          "matched_policy_passage": "because a certain option isnt available), you can exercise the data subject rights mentioned in this notice by contacting our privacy team (which includes our Data Protection Officer) via the email address in the. Our company and how we comply with privacy lawssection You can contact us the same way for any other requests or questions about this privacy statement or if you have a complaint or concern about the processing of your personal data We recommend including your country of residence when contacting us through this channel to help us respond to your request.By mail. If youd prefer to exercise your data subject rights by mail, address it to our privacy team using the mailing address in. Our company and how we comply with privacy laws By default, well respond to such requests electronically.To protect your personal information, we may need to verify your identity before completing your request",
          "similarity_score": 0.6752
        },
        {
          "matched_policy_passage": "Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law We offer various ways for you to exercise your rights or raise questions and concerns about your personal data at Booking.com: Directly from your account. If you have a user account, you can access a lot of your personal data through our websites or mobile apps Youll generally find the option to add, update, or remove information we have about you in your user account settings.Using our Data Subject Request form. If you cant perform an action through our websites or mobile apps (e.g because certain personal data we have about you isnt accessible online), you can easily submit your request to us via this. Data Subject Request form.By email. If you cant perform an action directly from your user account or using our Data Subject Request form (e.g",
          "similarity_score": 0.6046
        },
        {
          "matched_policy_passage": "because a certain option isnt available), you can exercise the data subject rights mentioned in this notice by contacting our privacy team (which includes our Data Protection Officer) via the email address in the. Our company and how we comply with privacy lawssection You can contact us the same way for any other requests or questions about this privacy statement or if you have a complaint or concern about the processing of your personal data We recommend including your country of residence when contacting us through this channel to help us respond to your request.By mail. If youd prefer to exercise your data subject rights by mail, address it to our privacy team using the mailing address in. Our company and how we comply with privacy laws By default, well respond to such requests electronically",
          "similarity_score": 0.6752
        },
        {
          "matched_policy_passage": "because certain personal data we have about you isnt accessible online), you can easily submit your request to us via this. Data Subject Request form Data Subject Request form If you cant perform an action directly from your user account or using our Data Subject Request form (e.g because a certain option isnt available), you can exercise the data subject rights mentioned in this notice by contacting our privacy team (which includes our Data Protection Officer) via the email address in the. Our company and how we comply with privacy lawssection You can contact us the same way for any other requests or questions about this privacy statement or if you have a complaint or concern about the processing of your personal data",
          "similarity_score": 0.606
        },
        {
          "matched_policy_passage": "Data Subject Request form If you cant perform an action directly from your user account or using our Data Subject Request form (e.g because a certain option isnt available), you can exercise the data subject rights mentioned in this notice by contacting our privacy team (which includes our Data Protection Officer) via the email address in the. Our company and how we comply with privacy lawssection You can contact us the same way for any other requests or questions about this privacy statement or if you have a complaint or concern about the processing of your personal data We recommend including your country of residence when contacting us through this channel to help us respond to your request",
          "similarity_score": 0.6724
        },
        {
          "matched_policy_passage": "because a certain option isnt available), you can exercise the data subject rights mentioned in this notice by contacting our privacy team (which includes our Data Protection Officer) via the email address in the. Our company and how we comply with privacy lawssection You can contact us the same way for any other requests or questions about this privacy statement or if you have a complaint or concern about the processing of your personal data We recommend including your country of residence when contacting us through this channel to help us respond to your request Our company and how we comply with privacy laws If youd prefer to exercise your data subject rights by mail, address it to our privacy team using the mailing address in. Our company and how we comply with privacy laws",
          "similarity_score": 0.6522
        }
      ]
    }
  },
  {
    "article_number": 57,
    "article_title": "Tasks",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "The data we collect and process includes these communications We may block the delivery of communications that we, at our sole discretion, believe might contain malicious content or spam, or pose a risk to you, trip providers, Booking.com, or others We may also receive information (e.g the additional cookie data our social media and marketing partners may make available to us on an aggregated basis) in order for us to measure the effectiveness of advertising and marketing campaigns",
          "similarity_score": 0.6207
        }
      ]
    }
  },
  {
    "article_number": 18,
    "article_title": "Right to restriction of processing",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "How we use artificial intelligence and make automated decisions In certain cases, we may need to reuse your information to: Handle and resolve legal claims and disputes Address possible regulatory investigations Enforce our online reservation Terms of Service Comply with lawful requests from law enforcement Comply with laws and regulations that apply to Booking.com For example, we may be required to process your reservation history, the details of one or more of these reservations and associated payment information Legal bases for personal data processing To process your personal data as described above, Booking.com relies on several legal bases provided for in applicable privacy regulations This is summarized as follows: Purpose of personal data processing. Legal basis and comments. A Customer service. Here Booking.com relies on the legal basis that the processing of personal data is necessary for the performance of a contract involving you, specifically to finalize and administer your trip reservation.If the required personal data isnt provided, Booking.com cant finalize the trip reservation with the trip provider, nor can we provide customer service to you about it.C",
          "similarity_score": 0.6052
        }
      ]
    }
  },
  {
    "article_number": 1,
    "article_title": "Subject-matter and objectives",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "lawful law enforcement requests) All purpose categories Finally, where needed under evolving applicable law, Booking.com will obtain your consent prior to processing your personal data, including for direct marketing purposes or where otherwise required by law If you want to object to the processing set out under. C to Land no opt-out mechanism is available to you directly (e.g in your user account settings), contact us as described in the. Your rightssection",
          "similarity_score": 0.6008
        }
      ]
    }
  },
  {
    "article_number": 48,
    "article_title": "Transfers or disclosures not authorised by Union law",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "In particular, if youre in the European Economic Area (EEA) and your personal data is transferred to third-party service providers in countries not considered adequate by the European Commission (EC), we establish and implement appropriate contractual, organizational, and technical measures with these third-party companies This is done by using Standard Contractual Clauses as approved by the EC, by examining the countries to which the data may be transferred, and by imposing specific technical and organizational measures In certain cases, we transfer your data outside the EEA because its necessary to conclude or perform the contract we have with you For example, if you make a trip reservation involving a trip provider or strategic partner operating outside the EEA, its likely to require that we transfer data about your specific reservation outside of the EEA",
          "similarity_score": 0.661
        }
      ]
    }
  },
  {
    "article_number": 9,
    "article_title": "Processing of special categories of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "features addressed to families) If we become aware (e.g via a Customer Service request) that weve processed personal data about minors without the valid consent of their parent or guardian, well delete it Your rights. We want you to be in control of how your personal data is used by us",
          "similarity_score": 0.6476
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "You can ask us to erase the personal data we hold about you when, for example, its no longer needed or weve asked for your consent and youve now withdrawn it In certain situations, you can ask us to block or restrict the processing of the personal data we hold about you and object to particular ways were using your personal data In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party Withdrawal of consent Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law",
          "similarity_score": 0.7094
        },
        {
          "matched_policy_passage": "In certain situations, you can also ask to receive specific personal data youve given us, for possible transmission to a third party Withdrawal of consent Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law We offer various ways for you to exercise your rights or raise questions and concerns about your personal data at Booking.com: Directly from your account. If you have a user account, you can access a lot of your personal data through our websites or mobile apps",
          "similarity_score": 0.7148
        },
        {
          "matched_policy_passage": "Withdrawal of consent Where weve collected and processed your personal data on the basis of your consent, you can withdraw that consent anytime subject to applicable law Where we process your personal data based on legitimate interest or the public interest, you have the right to object to that use of your personal data anytime, subject to applicable law We offer various ways for you to exercise your rights or raise questions and concerns about your personal data at Booking.com: Directly from your account. If you have a user account, you can access a lot of your personal data through our websites or mobile apps Youll generally find the option to add, update, or remove information we have about you in your user account settings.Using our Data Subject Request form. If you cant perform an action through our websites or mobile apps (e.g",
          "similarity_score": 0.7629
        }
      ]
    }
  },
  {
    "article_number": 39,
    "article_title": "Tasks of the data protection officer",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "If you arent satisfied with our response to your request or have other concerns about your personal data, you can also contact your data protection supervisory authority For questions about a reservation, contact our Customer Service team through our customer service contact page Our company and how we further comply with privacy laws. The entities relevant for this notice include:Entity name. Mailing address. Privacy email contact details. Comments. Booking.com B.V.Oosterdokskade 163, 1011 DL Amsterdam, The Netherlands.dataprotectionoffice@booking.com. Operates the platform and is the controller for the processing of personal data as described in this privacy statement except where explicitly stated otherwise It is the EU representative for Booking.com Transport Ltd. (BTL).Booking.com Distribution B.V. (BDBV)Oosterdokskade 163, 1011 DL, Amsterdam, The Netherlands.dataprotectionoffice@booking.com. A sister company of Booking.com B.V. Booking.com B.V. and BDBV work closely together to offer customers different insurance products and services for trip reservations (e.g",
          "similarity_score": 0.6018
        }
      ]
    }
  },
  {
    "article_number": 75,
    "article_title": "Secretariat",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "Duly authorized representatives from agencies and other authorities must submit such requests only via our Law Enforcement Response processes and using theportalwe make available for these purposes Our company and how we further comply with privacy laws The entities relevant for this notice include: Entity name. Mailing address. Privacy email contact details. Comments. Booking.com B.V.Oosterdokskade 163, 1011 DL Amsterdam, The Netherlands.dataprotectionoffice@booking.com. Operates the platform and is the controller for the processing of personal data as described in this privacy statement except where explicitly stated otherwise It is the EU representative for Booking.com Transport Ltd. (BTL).Booking.com Distribution B.V. (BDBV)Oosterdokskade 163, 1011 DL, Amsterdam, The Netherlands.dataprotectionoffice@booking.com. A sister company of Booking.com B.V. Booking.com B.V. and BDBV work closely together to offer customers different insurance products and services for trip reservations (e.g room cancellation insurance)",
          "similarity_score": 0.6371
        }
      ]
    }
  }
]