[
  {
    "article_number": 23,
    "article_title": "Restrictions",
    "matches": {
      "14.": [
        {
          "matched_policy_passage": "This includes creating aggregated statistical data for internal reporting, financial reporting, revenue planning, capacity planning, and forecast modeling (including product strategy).Communication: We use Personal Data to inform you about new Services, features, offers, promotions, and other pertinent information This also includes sending confirmations, invoices, technical notices, updates, security alerts, and administrative messages.Inference: We generate new information from other data we collect to derive likely preferences or other characteristics For instance, we infer your general geographic location based on your IP address.Personalization: We use Personal Data to customize the Service to your preferences, to evaluate the effectiveness of enterprise business ads and promotional communications, and to ensure a seamless and consistent user experience.Safety and Security: To promote safety, integrity, and security across our Services, we process Personal Data, using both automated and, at times, manual techniques for abuse detection, prevention, and violations of terms of service.Service Provision: We use Personal Data to deliver and update our Services as configured and used by You, and to make ongoing personalized experiences and recommendations.Troubleshooting: We use Personal Data to identify and resolve technical issues.Ongoing Service Performance: Personal Data helps us keep the Services up to date and performant, and meet user productivity, reliability, efficacy, quality, privacy, accessibility and security needs.Complying with and resolving legal obligations: including responding to Data Subject Requests for Personal Data processed by Git. Hub as Controller (for example website data), tax requirements, agreements and disputes.Delivering Professional Services: We use Personal Data to deliver training, consulting or implementation (Professional Services) This includes providing technical support, professional planning, advice, guidance, data migration, deployment, and solution/software development services.Improving Professional Services: Enhancing delivery, efficacy, quality, and security of Professional Services and the underlying product(s) based on issues identified while providing Professional Services, including fixing software defects, and otherwise keeping the Professional Services up to date and performant.When carrying out these activities, Git. Hub practices data minimization and uses the minimum amount of Personal Information required.Sharing of Personal Data. We may share Personal Data with the following recipients:Abuse and Fraud Prevention Entities: We may disclose Personal Data based on a good faith belief it is needed to prevent fraud, abuse, or attacks on our Services, or to protect the safety of Git. Hub and our users.Affiliates: Personal Data may be shared with Git. Hub affiliates, including Microsoft, to facilitate customer service, marketing and advertising, order fulfillment, billing, technical support, and legal and compliance obligations",
          "similarity_score": 0.6345
        },
        {
          "matched_policy_passage": "We disclosed the following categories of personal information for a business purpose in the last 12 months: identifiers/contact information, demographic information (such as gender and rough geographic location), payment information, commercial information, Internet or other electronic network activity information, geolocation data, audio, electronic, visual or similar information, and inferences drawn from the above We disclosed each category to third-party business partners and service providers, third-party sites or platforms such as social networking sites, and other third parties as described in the Sharing of Personal Data section of our Privacy Statement As defined by applicable law, we shared the following categories of personal information in the last 12 months: identifiers/contact information, Internet or other electronic network activity information, and inferences drawn from the above We shared each category to or with advertising networks, data analytics providers, and social networks",
          "similarity_score": 0.6593
        }
      ]
    }
  },
  {
    "article_number": 57,
    "article_title": "Tasks",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "This also includes sending confirmations, invoices, technical notices, updates, security alerts, and administrative messages.Inference: We generate new information from other data we collect to derive likely preferences or other characteristics For instance, we infer your general geographic location based on your IP address.Personalization: We use Personal Data to customize the Service to your preferences, to evaluate the effectiveness of enterprise business ads and promotional communications, and to ensure a seamless and consistent user experience.Safety and Security: To promote safety, integrity, and security across our Services, we process Personal Data, using both automated and, at times, manual techniques for abuse detection, prevention, and violations of terms of service.Service Provision: We use Personal Data to deliver and update our Services as configured and used by You, and to make ongoing personalized experiences and recommendations.Troubleshooting: We use Personal Data to identify and resolve technical issues.Ongoing Service Performance: Personal Data helps us keep the Services up to date and performant, and meet user productivity, reliability, efficacy, quality, privacy, accessibility and security needs.Complying with and resolving legal obligations: including responding to Data Subject Requests for Personal Data processed by Git. Hub as Controller (for example website data), tax requirements, agreements and disputes.Delivering Professional Services: We use Personal Data to deliver training, consulting or implementation (Professional Services) This includes providing technical support, professional planning, advice, guidance, data migration, deployment, and solution/software development services.Improving Professional Services: Enhancing delivery, efficacy, quality, and security of Professional Services and the underlying product(s) based on issues identified while providing Professional Services, including fixing software defects, and otherwise keeping the Professional Services up to date and performant.When carrying out these activities, Git. Hub practices data minimization and uses the minimum amount of Personal Information required.Sharing of Personal Data. We may share Personal Data with the following recipients:Abuse and Fraud Prevention Entities: We may disclose Personal Data based on a good faith belief it is needed to prevent fraud, abuse, or attacks on our Services, or to protect the safety of Git. Hub and our users.Affiliates: Personal Data may be shared with Git. Hub affiliates, including Microsoft, to facilitate customer service, marketing and advertising, order fulfillment, billing, technical support, and legal and compliance obligations Our affiliates may only use the Personal Data in a manner consistent with this Privacy Statement.Git. Hub Organization Accounts: If an organization adds you to their Git. Hub account, we might share Personal Data with that organization to fulfill the commercial relationship",
          "similarity_score": 0.6088
        }
      ]
    }
  },
  {
    "article_number": 50,
    "article_title": "International cooperation for the protection of personal data",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "In such a case, your use of the Services is protected by a data protection agreement and terms between your organization and Git. Hub. Competent Authorities: We may disclose Personal Data to authorized law enforcement, regulators, courts, or other public authorities in response to lawful requests or to protect our rights and safety Please refer to our. Guidelines for Legal Requests of User Datafor more information.Corporate Transaction Entities: we might disclose Personal Data within the limits of the law and in accordance with this Privacy Statement for strategic business transactions such as sales or a merger.Partners and Resellers: We cooperate with third-parties that offer sales, consulting, support, and technical services for our Services We may share your data with these partners and resellers where allowed, and with your consent when required.Subprocessors and Service Providers: We may use vendors to provide services on our behalf, including hosting, marketing, advertising, social, analytics, support ticketing, credit card processing, or security services They are bound by contractual obligations to ensure the security, privacy, and confidentiality of your information",
          "similarity_score": 0.6382
        },
        {
          "matched_policy_passage": "In such a case, your use of the Services is protected by a data protection agreement and terms between your organization and Git. Hub Competent Authorities: We may disclose Personal Data to authorized law enforcement, regulators, courts, or other public authorities in response to lawful requests or to protect our rights and safety Please refer to our. Guidelines for Legal Requests of User Datafor more information Corporate Transaction Entities: we might disclose Personal Data within the limits of the law and in accordance with this Privacy Statement for strategic business transactions such as sales or a merger Partners and Resellers: We cooperate with third-parties that offer sales, consulting, support, and technical services for our Services",
          "similarity_score": 0.6697
        },
        {
          "matched_policy_passage": "We collect this information for various purposes This includes identifying accessibility gaps and offering targeted support, fostering diversity and representation, providing services, troubleshooting, conducting business operations such as billing and security, improving products and supporting research, communicating important information, ensuring personalized experiences, and promoting safety and security Exercising your Privacy Rights To make an access, deletion, correction, or opt-out request, please send an email to privacy[at]github[dot]com and follow the instructions provided We may need to verify your identity before processing your request",
          "similarity_score": 0.6061
        },
        {
          "matched_policy_passage": "This includes identifying accessibility gaps and offering targeted support, fostering diversity and representation, providing services, troubleshooting, conducting business operations such as billing and security, improving products and supporting research, communicating important information, ensuring personalized experiences, and promoting safety and security Exercising your Privacy Rights To make an access, deletion, correction, or opt-out request, please send an email to privacy[at]github[dot]com and follow the instructions provided We may need to verify your identity before processing your request If you choose to use an authorized agent to submit a request on your behalf, please ensure they have your signed permission or power of attorney as required",
          "similarity_score": 0.6006
        }
      ]
    }
  },
  {
    "article_number": 47,
    "article_title": "Binding corporate rules",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "Please refer to our. Guidelines for Legal Requests of User Datafor more information.Corporate Transaction Entities: we might disclose Personal Data within the limits of the law and in accordance with this Privacy Statement for strategic business transactions such as sales or a merger.Partners and Resellers: We cooperate with third-parties that offer sales, consulting, support, and technical services for our Services We may share your data with these partners and resellers where allowed, and with your consent when required.Subprocessors and Service Providers: We may use vendors to provide services on our behalf, including hosting, marketing, advertising, social, analytics, support ticketing, credit card processing, or security services They are bound by contractual obligations to ensure the security, privacy, and confidentiality of your information Please visithttps://docs.github.com/en/site-policy/privacy-policies/github-subprocessorsto see our list of Subprocessors.Visual Studio Code (Git. Hub Codespaces): Git. Hub Codespaces and github.dev offer Visual Studio Code in a web browser, where some telemetry is collected by default",
          "similarity_score": 0.6878
        },
        {
          "matched_policy_passage": "Please refer to our. Guidelines for Legal Requests of User Datafor more information Corporate Transaction Entities: we might disclose Personal Data within the limits of the law and in accordance with this Privacy Statement for strategic business transactions such as sales or a merger Partners and Resellers: We cooperate with third-parties that offer sales, consulting, support, and technical services for our Services We may share your data with these partners and resellers where allowed, and with your consent when required",
          "similarity_score": 0.683
        },
        {
          "matched_policy_passage": "Corporate Transaction Entities: we might disclose Personal Data within the limits of the law and in accordance with this Privacy Statement for strategic business transactions such as sales or a merger Partners and Resellers: We cooperate with third-parties that offer sales, consulting, support, and technical services for our Services We may share your data with these partners and resellers where allowed, and with your consent when required Subprocessors and Service Providers: We may use vendors to provide services on our behalf, including hosting, marketing, advertising, social, analytics, support ticketing, credit card processing, or security services",
          "similarity_score": 0.7041
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "The basis varies depending on the data type and the context, including how you access the services Our processing activities typically fall under these lawful bases:Contractual Necessity: Processing is required to fulfill our contractual duties to you, in accordance with the Git. Hub Terms of Service.Legal Obligation: We process data when it's necessary to comply with applicable laws or to protect the rights, safety, and property of Git. Hub, our affiliates, users, or third parties.Legitimate Interests: We process data for purposes that are in our legitimate interests, such as securing our Services, communicating with you, and improving our Services This is done only when these interests are not overridden by your data protection rights or your fundamental rights and freedoms.Consent: We process data when you have explicitly consented to such processing When we rely on consent as the legal basis, you have the right to withdraw your consent for data processing at any time",
          "similarity_score": 0.6104
        }
      ],
      "2.": [
        {
          "matched_policy_passage": "Depending on your residence location, you may have specific legal rights regarding your Personal Data: The right to access the data collected about you The right to request detailed information about the specific types of Personal Data we've collected over the past 12 months, including data disclosed for business purposes The right to rectify or update inaccurate or incomplete Personal Data under certain circumstances The right to erase or limit the processing of your Personal Data under specific conditions The right to object to the processing of your Personal Data, as allowed by applicable law The right to withdraw consent, where processing is based on your consent The right to receive your collected Personal Data in a structured, commonly used, and machine-readable format to facilitate its transfer to another company, where technically feasible To exercise these rights, please send an email to privacy[at]github[dot]com and follow the instructions provided To verify your identity for security, we may request extra information before addressing your data-related request Please contact our Data Protection Officer at dpo[at]github[dot]com for any feedback or concerns Depending on your region, you have the right to complain to your local Data Protection Authority",
          "similarity_score": 0.7209
        }
      ]
    }
  },
  {
    "article_number": 9,
    "article_title": "Processing of special categories of personal data",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "Our processing activities typically fall under these lawful bases:Contractual Necessity: Processing is required to fulfill our contractual duties to you, in accordance with the Git. Hub Terms of Service.Legal Obligation: We process data when it's necessary to comply with applicable laws or to protect the rights, safety, and property of Git. Hub, our affiliates, users, or third parties.Legitimate Interests: We process data for purposes that are in our legitimate interests, such as securing our Services, communicating with you, and improving our Services This is done only when these interests are not overridden by your data protection rights or your fundamental rights and freedoms.Consent: We process data when you have explicitly consented to such processing When we rely on consent as the legal basis, you have the right to withdraw your consent for data processing at any time The procedures for withdrawal are detailed in this Statement and available on our website.Your Privacy Rights. Depending on your residence location, you may have specific legal rights regarding your Personal Data:The right to access the data collected about you. The right to request detailed information about the specific types of Personal Data we've collected over the past 12 months, including data disclosed for business purposes. The right to rectify or update inaccurate or incomplete Personal Data under certain circumstances. The right to erase or limit the processing of your Personal Data under specific conditions. The right to object to the processing of your Personal Data, as allowed by applicable law. The right to withdraw consent, where processing is based on your consent. The right to receive your collected Personal Data in a structured, commonly used, and machine-readable format to facilitate its transfer to another company, where technically feasible. To exercise these rights, please send an email to privacy[at]github[dot]com and follow the instructions provided",
          "similarity_score": 0.6156
        },
        {
          "matched_policy_passage": "Our processing activities typically fall under these lawful bases: Contractual Necessity: Processing is required to fulfill our contractual duties to you, in accordance with the Git. Hub Terms of Service Legal Obligation: We process data when it's necessary to comply with applicable laws or to protect the rights, safety, and property of Git. Hub, our affiliates, users, or third parties Legitimate Interests: We process data for purposes that are in our legitimate interests, such as securing our Services, communicating with you, and improving our Services This is done only when these interests are not overridden by your data protection rights or your fundamental rights and freedoms",
          "similarity_score": 0.6089
        }
      ],
      "5.": [
        {
          "matched_policy_passage": "Legal Obligation: We process data when it's necessary to comply with applicable laws or to protect the rights, safety, and property of Git. Hub, our affiliates, users, or third parties Legitimate Interests: We process data for purposes that are in our legitimate interests, such as securing our Services, communicating with you, and improving our Services This is done only when these interests are not overridden by your data protection rights or your fundamental rights and freedoms Consent: We process data when you have explicitly consented to such processing",
          "similarity_score": 0.623
        },
        {
          "matched_policy_passage": "Legitimate Interests: We process data for purposes that are in our legitimate interests, such as securing our Services, communicating with you, and improving our Services This is done only when these interests are not overridden by your data protection rights or your fundamental rights and freedoms Consent: We process data when you have explicitly consented to such processing When we rely on consent as the legal basis, you have the right to withdraw your consent for data processing at any time",
          "similarity_score": 0.7374
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "This is done only when these interests are not overridden by your data protection rights or your fundamental rights and freedoms.Consent: We process data when you have explicitly consented to such processing When we rely on consent as the legal basis, you have the right to withdraw your consent for data processing at any time The procedures for withdrawal are detailed in this Statement and available on our website.Your Privacy Rights. Depending on your residence location, you may have specific legal rights regarding your Personal Data:The right to access the data collected about you. The right to request detailed information about the specific types of Personal Data we've collected over the past 12 months, including data disclosed for business purposes. The right to rectify or update inaccurate or incomplete Personal Data under certain circumstances. The right to erase or limit the processing of your Personal Data under specific conditions. The right to object to the processing of your Personal Data, as allowed by applicable law. The right to withdraw consent, where processing is based on your consent. The right to receive your collected Personal Data in a structured, commonly used, and machine-readable format to facilitate its transfer to another company, where technically feasible. To exercise these rights, please send an email to privacy[at]github[dot]com and follow the instructions provided To verify your identity for security, we may request extra information before addressing your data-related request",
          "similarity_score": 0.7851
        },
        {
          "matched_policy_passage": "When we rely on consent as the legal basis, you have the right to withdraw your consent for data processing at any time The procedures for withdrawal are detailed in this Statement and available on our website.Your Privacy Rights. Depending on your residence location, you may have specific legal rights regarding your Personal Data:The right to access the data collected about you. The right to request detailed information about the specific types of Personal Data we've collected over the past 12 months, including data disclosed for business purposes. The right to rectify or update inaccurate or incomplete Personal Data under certain circumstances. The right to erase or limit the processing of your Personal Data under specific conditions. The right to object to the processing of your Personal Data, as allowed by applicable law. The right to withdraw consent, where processing is based on your consent. The right to receive your collected Personal Data in a structured, commonly used, and machine-readable format to facilitate its transfer to another company, where technically feasible. To exercise these rights, please send an email to privacy[at]github[dot]com and follow the instructions provided To verify your identity for security, we may request extra information before addressing your data-related request Please contact our Data Protection Officer at dpo[at]github[dot]com for any feedback or concerns",
          "similarity_score": 0.775
        },
        {
          "matched_policy_passage": "The procedures for withdrawal are detailed in this Statement and available on our website.Your Privacy Rights. Depending on your residence location, you may have specific legal rights regarding your Personal Data:The right to access the data collected about you. The right to request detailed information about the specific types of Personal Data we've collected over the past 12 months, including data disclosed for business purposes. The right to rectify or update inaccurate or incomplete Personal Data under certain circumstances. The right to erase or limit the processing of your Personal Data under specific conditions. The right to object to the processing of your Personal Data, as allowed by applicable law. The right to withdraw consent, where processing is based on your consent. The right to receive your collected Personal Data in a structured, commonly used, and machine-readable format to facilitate its transfer to another company, where technically feasible. To exercise these rights, please send an email to privacy[at]github[dot]com and follow the instructions provided To verify your identity for security, we may request extra information before addressing your data-related request Please contact our Data Protection Officer at dpo[at]github[dot]com for any feedback or concerns Depending on your region, you have the right to complain to your local Data Protection Authority",
          "similarity_score": 0.7057
        },
        {
          "matched_policy_passage": "This is done only when these interests are not overridden by your data protection rights or your fundamental rights and freedoms Consent: We process data when you have explicitly consented to such processing When we rely on consent as the legal basis, you have the right to withdraw your consent for data processing at any time The procedures for withdrawal are detailed in this Statement and available on our website",
          "similarity_score": 0.8053
        },
        {
          "matched_policy_passage": "Consent: We process data when you have explicitly consented to such processing When we rely on consent as the legal basis, you have the right to withdraw your consent for data processing at any time The procedures for withdrawal are detailed in this Statement and available on our website Depending on your residence location, you may have specific legal rights regarding your Personal Data: The right to access the data collected about you The right to request detailed information about the specific types of Personal Data we've collected over the past 12 months, including data disclosed for business purposes The right to rectify or update inaccurate or incomplete Personal Data under certain circumstances The right to erase or limit the processing of your Personal Data under specific conditions The right to object to the processing of your Personal Data, as allowed by applicable law The right to withdraw consent, where processing is based on your consent The right to receive your collected Personal Data in a structured, commonly used, and machine-readable format to facilitate its transfer to another company, where technically feasible To exercise these rights, please send an email to privacy[at]github[dot]com and follow the instructions provided",
          "similarity_score": 0.7768
        },
        {
          "matched_policy_passage": "When we rely on consent as the legal basis, you have the right to withdraw your consent for data processing at any time The procedures for withdrawal are detailed in this Statement and available on our website Depending on your residence location, you may have specific legal rights regarding your Personal Data: The right to access the data collected about you The right to request detailed information about the specific types of Personal Data we've collected over the past 12 months, including data disclosed for business purposes The right to rectify or update inaccurate or incomplete Personal Data under certain circumstances The right to erase or limit the processing of your Personal Data under specific conditions The right to object to the processing of your Personal Data, as allowed by applicable law The right to withdraw consent, where processing is based on your consent The right to receive your collected Personal Data in a structured, commonly used, and machine-readable format to facilitate its transfer to another company, where technically feasible To exercise these rights, please send an email to privacy[at]github[dot]com and follow the instructions provided To verify your identity for security, we may request extra information before addressing your data-related request",
          "similarity_score": 0.7811
        },
        {
          "matched_policy_passage": "The procedures for withdrawal are detailed in this Statement and available on our website Depending on your residence location, you may have specific legal rights regarding your Personal Data: The right to access the data collected about you The right to request detailed information about the specific types of Personal Data we've collected over the past 12 months, including data disclosed for business purposes The right to rectify or update inaccurate or incomplete Personal Data under certain circumstances The right to erase or limit the processing of your Personal Data under specific conditions The right to object to the processing of your Personal Data, as allowed by applicable law The right to withdraw consent, where processing is based on your consent The right to receive your collected Personal Data in a structured, commonly used, and machine-readable format to facilitate its transfer to another company, where technically feasible To exercise these rights, please send an email to privacy[at]github[dot]com and follow the instructions provided To verify your identity for security, we may request extra information before addressing your data-related request Please contact our Data Protection Officer at dpo[at]github[dot]com for any feedback or concerns",
          "similarity_score": 0.7572
        }
      ]
    }
  },
  {
    "article_number": 38,
    "article_title": "Position of the data protection officer",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "To verify your identity for security, we may request extra information before addressing your data-related request Please contact our Data Protection Officer at dpo[at]github[dot]com for any feedback or concerns Depending on your region, you have the right to complain to your local Data Protection Authority European users can find authority contacts on the European Data Protection Board website, and UK users on the Information Commissioners Office website.We aim to promptly respond to requests in compliance with legal requirements",
          "similarity_score": 0.6284
        },
        {
          "matched_policy_passage": "Please contact our Data Protection Officer at dpo[at]github[dot]com for any feedback or concerns Depending on your region, you have the right to complain to your local Data Protection Authority European users can find authority contacts on the European Data Protection Board website, and UK users on the Information Commissioners Office website.We aim to promptly respond to requests in compliance with legal requirements Please note that we may retain certain data as necessary for legal obligations or for establishing, exercising, or defending legal claims.International data transfers. Git. Hub stores and processes Personal Data in a variety of locations, including your local region, the United States, and other countries where Git. Hub, its affiliates, subsidiaries, or subprocessors have operations",
          "similarity_score": 0.6359
        },
        {
          "matched_policy_passage": "To verify your identity for security, we may request extra information before addressing your data-related request Please contact our Data Protection Officer at dpo[at]github[dot]com for any feedback or concerns Depending on your region, you have the right to complain to your local Data Protection Authority European users can find authority contacts on the European Data Protection Board website, and UK users on the Information Commissioners Office website",
          "similarity_score": 0.6177
        },
        {
          "matched_policy_passage": "Please contact our Data Protection Officer at dpo[at]github[dot]com for any feedback or concerns Depending on your region, you have the right to complain to your local Data Protection Authority European users can find authority contacts on the European Data Protection Board website, and UK users on the Information Commissioners Office website We aim to promptly respond to requests in compliance with legal requirements",
          "similarity_score": 0.6134
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Please note that we may retain certain data as necessary for legal obligations or for establishing, exercising, or defending legal claims.International data transfers. Git. Hub stores and processes Personal Data in a variety of locations, including your local region, the United States, and other countries where Git. Hub, its affiliates, subsidiaries, or subprocessors have operations We transfer Personal Data from the European Union, the United Kingdom, and Switzerland to countries that the European Commission has not recognized as having an adequate level of data protection When we engage in such transfers, we generally rely on the standard contractual clauses published by the European Commission under. Commission Implementing Decision 2021/914, to help protect your rights and enable these protections to travel with your data To learn more about the European Commissions decisions on the adequacy of the protection of personal data in the countries where Git. Hub processes personal data, see this article on the. European Commission website.Data Privacy Framework (DPF)Git. Hub also complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce",
          "similarity_score": 0.6803
        },
        {
          "matched_policy_passage": "Please note that we may retain certain data as necessary for legal obligations or for establishing, exercising, or defending legal claims International data transfers Git. Hub stores and processes Personal Data in a variety of locations, including your local region, the United States, and other countries where Git. Hub, its affiliates, subsidiaries, or subprocessors have operations We transfer Personal Data from the European Union, the United Kingdom, and Switzerland to countries that the European Commission has not recognized as having an adequate level of data protection When we engage in such transfers, we generally rely on the standard contractual clauses published by the European Commission under. Commission Implementing Decision 2021/914, to help protect your rights and enable these protections to travel with your data",
          "similarity_score": 0.6344
        },
        {
          "matched_policy_passage": "International data transfers Git. Hub stores and processes Personal Data in a variety of locations, including your local region, the United States, and other countries where Git. Hub, its affiliates, subsidiaries, or subprocessors have operations We transfer Personal Data from the European Union, the United Kingdom, and Switzerland to countries that the European Commission has not recognized as having an adequate level of data protection When we engage in such transfers, we generally rely on the standard contractual clauses published by the European Commission under. Commission Implementing Decision 2021/914, to help protect your rights and enable these protections to travel with your data To learn more about the European Commissions decisions on the adequacy of the protection of personal data in the countries where Git. Hub processes personal data, see this article on the. European Commission website",
          "similarity_score": 0.6415
        }
      ]
    }
  },
  {
    "article_number": 98,
    "article_title": "Review of other Union legal acts on data protection",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We transfer Personal Data from the European Union, the United Kingdom, and Switzerland to countries that the European Commission has not recognized as having an adequate level of data protection When we engage in such transfers, we generally rely on the standard contractual clauses published by the European Commission under. Commission Implementing Decision 2021/914, to help protect your rights and enable these protections to travel with your data To learn more about the European Commissions decisions on the adequacy of the protection of personal data in the countries where Git. Hub processes personal data, see this article on the. European Commission website.Data Privacy Framework (DPF)Git. Hub also complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce Git. Hub has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles (EU-U.S. DPF Principles) with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF and from the United Kingdom (and Gibraltar) in reliance on the UK Extension to the EU-U.S. DPF",
          "similarity_score": 0.67
        },
        {
          "matched_policy_passage": "When we engage in such transfers, we generally rely on the standard contractual clauses published by the European Commission under. Commission Implementing Decision 2021/914, to help protect your rights and enable these protections to travel with your data To learn more about the European Commissions decisions on the adequacy of the protection of personal data in the countries where Git. Hub processes personal data, see this article on the. European Commission website.Data Privacy Framework (DPF)Git. Hub also complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce Git. Hub has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles (EU-U.S. DPF Principles) with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF and from the United Kingdom (and Gibraltar) in reliance on the UK Extension to the EU-U.S. DPF Git. Hub has certified to the U.S. Department of Commerce that it adheres to the Swiss-U.S. Data Privacy Framework Principles (Swiss-U.S. DPF Principles) with regard to the processing of personal data received from Switzerland in reliance on the Swiss-U.S. DPF",
          "similarity_score": 0.6396
        },
        {
          "matched_policy_passage": "We transfer Personal Data from the European Union, the United Kingdom, and Switzerland to countries that the European Commission has not recognized as having an adequate level of data protection When we engage in such transfers, we generally rely on the standard contractual clauses published by the European Commission under. Commission Implementing Decision 2021/914, to help protect your rights and enable these protections to travel with your data To learn more about the European Commissions decisions on the adequacy of the protection of personal data in the countries where Git. Hub processes personal data, see this article on the. European Commission website Data Privacy Framework (DPF) Git. Hub also complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce",
          "similarity_score": 0.6731
        }
      ]
    }
  },
  {
    "article_number": 45,
    "article_title": "Transfers on the basis of an adequacy decision",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "If you access our Services from other devices or browsers, take these actions from those systems to ensure your choices apply to the data collected when you use those systems.US State Specific Information. This section provides extra information specifically for residents of certain US states that have distinct data privacy laws and regulations These laws may grant specific rights to residents of these states when the laws come into effect This section uses the term personal information as an equivalent to the term Personal Data.Privacy Rights. These rights are common to the US State privacy laws:Right to Knowledge and Correction: You have the right to request details on the specific personal information weve collected about you and the right to correct inaccurate information You can exercise this right by contacting us",
          "similarity_score": 0.6418
        },
        {
          "matched_policy_passage": "These laws may grant specific rights to residents of these states when the laws come into effect This section uses the term personal information as an equivalent to the term Personal Data.Privacy Rights. These rights are common to the US State privacy laws:Right to Knowledge and Correction: You have the right to request details on the specific personal information weve collected about you and the right to correct inaccurate information You can exercise this right by contacting us You can also access and edit basic account information in your settings.Right to Know Data Recipients: We share your information with service providers for legitimate business operations, such as data storage and hosting",
          "similarity_score": 0.6423
        },
        {
          "matched_policy_passage": "If you access our Services from other devices or browsers, take these actions from those systems to ensure your choices apply to the data collected when you use those systems US State Specific Information This section provides extra information specifically for residents of certain US states that have distinct data privacy laws and regulations These laws may grant specific rights to residents of these states when the laws come into effect This section uses the term personal information as an equivalent to the term Personal Data",
          "similarity_score": 0.6227
        }
      ]
    }
  },
  {
    "article_number": 86,
    "article_title": "Processing and public access to official documents",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "This section uses the term personal information as an equivalent to the term Personal Data.Privacy Rights. These rights are common to the US State privacy laws:Right to Knowledge and Correction: You have the right to request details on the specific personal information weve collected about you and the right to correct inaccurate information You can exercise this right by contacting us You can also access and edit basic account information in your settings.Right to Know Data Recipients: We share your information with service providers for legitimate business operations, such as data storage and hosting For more details, please see Sharing Your Information below.Right to request Deletion: You reserve the right to request the deletion of your data, barring a few exceptions",
          "similarity_score": 0.6178
        },
        {
          "matched_policy_passage": "US State Specific Information This section provides extra information specifically for residents of certain US states that have distinct data privacy laws and regulations These laws may grant specific rights to residents of these states when the laws come into effect This section uses the term personal information as an equivalent to the term Personal Data These rights are common to the US State privacy laws: Right to Knowledge and Correction: You have the right to request details on the specific personal information weve collected about you and the right to correct inaccurate information",
          "similarity_score": 0.6094
        },
        {
          "matched_policy_passage": "This section uses the term personal information as an equivalent to the term Personal Data These rights are common to the US State privacy laws: Right to Knowledge and Correction: You have the right to request details on the specific personal information weve collected about you and the right to correct inaccurate information You can exercise this right by contacting us You can also access and edit basic account information in your settings",
          "similarity_score": 0.6424
        }
      ]
    }
  },
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "That information includes identifiers/contact information, demographic information, payment information, commercial information, internet or electronic network activity information, geolocation data, audio, electronic, visual, or similar information, and inferences drawn from such information.We collect this information for various purposes This includes identifying accessibility gaps and offering targeted support, fostering diversity and representation, providing services, troubleshooting, conducting business operations such as billing and security, improving products and supporting research, communicating important information, ensuring personalized experiences, and promoting safety and security.Exercising your Privacy Rights. To make an access, deletion, correction, or opt-out request, please send an email to privacy[at]github[dot]com and follow the instructions provided We may need to verify your identity before processing your request If you choose to use an authorized agent to submit a request on your behalf, please ensure they have your signed permission or power of attorney as required.To opt out of the sharing of your personal information, you can click on the \"Do Not Share My Personal Information\" link on the footer of our Websites or use the Global Privacy Control (\"GPC\") if available",
          "similarity_score": 0.6206
        },
        {
          "matched_policy_passage": "That information includes identifiers/contact information, demographic information, payment information, commercial information, internet or electronic network activity information, geolocation data, audio, electronic, visual, or similar information, and inferences drawn from such information We collect this information for various purposes This includes identifying accessibility gaps and offering targeted support, fostering diversity and representation, providing services, troubleshooting, conducting business operations such as billing and security, improving products and supporting research, communicating important information, ensuring personalized experiences, and promoting safety and security Exercising your Privacy Rights To make an access, deletion, correction, or opt-out request, please send an email to privacy[at]github[dot]com and follow the instructions provided",
          "similarity_score": 0.6078
        }
      ]
    }
  },
  {
    "article_number": 4,
    "article_title": "Definitions",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "Third Party Access and Data Protection When you use third-party extensions, integrations, or follow references and links within our Services, the privacy policies of these third parties apply to any Personal Data you provide or consent to share with them Their privacy statements will govern how this data is processed Personal Data We Collect Personal Data is collected from you directly, automatically from your device, and also from third parties The Personal Data Git. Hub processes when you use the Services depends on variables like how you interact with our Services (such as through web interfaces, desktop or mobile applications), the features you use (such as pull requests, Codespaces, or Git. Hub Copilot) and your method of accessing the Services (your preferred IDE)",
          "similarity_score": 0.6165
        }
      ]
    }
  },
  {
    "article_number": 14,
    "article_title": "Information to be provided where personal data have not been obtained from the data subject",
    "matches": {
      "18.": [
        {
          "matched_policy_passage": "Communication: We use Personal Data to inform you about new Services, features, offers, promotions, and other pertinent information This also includes sending confirmations, invoices, technical notices, updates, security alerts, and administrative messages Inference: We generate new information from other data we collect to derive likely preferences or other characteristics For instance, we infer your general geographic location based on your IP address",
          "similarity_score": 0.6321
        }
      ],
      "19.": [
        {
          "matched_policy_passage": "Authorized agents can also submit opt-out requests on your behalf Mandatory Disclosures We also make the following disclosures for purposes of compliance with California privacy law: We collected the following categories of personal information in the last 12 months: identifiers/contact information, demographic information (such as gender), payment card information associated with you, commercial information, Internet or other electronic network activity information, geolocation data, audio, electronic, visual or similar information, and inferences drawn from the above The sources of personal information from whom we collected are: directly from you, automatically or from third parties The business or commercial purposes of collecting personal information are as summarized above and in our Privacy Statement under Processing Purposes",
          "similarity_score": 0.6007
        },
        {
          "matched_policy_passage": "Mandatory Disclosures We also make the following disclosures for purposes of compliance with California privacy law: We collected the following categories of personal information in the last 12 months: identifiers/contact information, demographic information (such as gender), payment card information associated with you, commercial information, Internet or other electronic network activity information, geolocation data, audio, electronic, visual or similar information, and inferences drawn from the above The sources of personal information from whom we collected are: directly from you, automatically or from third parties The business or commercial purposes of collecting personal information are as summarized above and in our Privacy Statement under Processing Purposes We disclosed the following categories of personal information for a business purpose in the last 12 months: identifiers/contact information, demographic information (such as gender and rough geographic location), payment information, commercial information, Internet or other electronic network activity information, geolocation data, audio, electronic, visual or similar information, and inferences drawn from the above",
          "similarity_score": 0.6219
        }
      ],
      "14.": [
        {
          "matched_policy_passage": "The sources of personal information from whom we collected are: directly from you, automatically or from third parties The business or commercial purposes of collecting personal information are as summarized above and in our Privacy Statement under Processing Purposes We disclosed the following categories of personal information for a business purpose in the last 12 months: identifiers/contact information, demographic information (such as gender and rough geographic location), payment information, commercial information, Internet or other electronic network activity information, geolocation data, audio, electronic, visual or similar information, and inferences drawn from the above We disclosed each category to third-party business partners and service providers, third-party sites or platforms such as social networking sites, and other third parties as described in the Sharing of Personal Data section of our Privacy Statement",
          "similarity_score": 0.6327
        }
      ]
    }
  },
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "Safety and Security: To promote safety, integrity, and security across our Services, we process Personal Data, using both automated and, at times, manual techniques for abuse detection, prevention, and violations of terms of service Service Provision: We use Personal Data to deliver and update our Services as configured and used by You, and to make ongoing personalized experiences and recommendations Troubleshooting: We use Personal Data to identify and resolve technical issues Ongoing Service Performance: Personal Data helps us keep the Services up to date and performant, and meet user productivity, reliability, efficacy, quality, privacy, accessibility and security needs",
          "similarity_score": 0.6389
        }
      ]
    }
  },
  {
    "article_number": 68,
    "article_title": "European Data Protection Board",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "Depending on your region, you have the right to complain to your local Data Protection Authority European users can find authority contacts on the European Data Protection Board website, and UK users on the Information Commissioners Office website We aim to promptly respond to requests in compliance with legal requirements Please note that we may retain certain data as necessary for legal obligations or for establishing, exercising, or defending legal claims",
          "similarity_score": 0.6739
        }
      ]
    }
  },
  {
    "article_number": 94,
    "article_title": "Repeal of Directive 95/46/EC",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "When we engage in such transfers, we generally rely on the standard contractual clauses published by the European Commission under. Commission Implementing Decision 2021/914, to help protect your rights and enable these protections to travel with your data To learn more about the European Commissions decisions on the adequacy of the protection of personal data in the countries where Git. Hub processes personal data, see this article on the. European Commission website Data Privacy Framework (DPF) Git. Hub also complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce Git. Hub has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles (EU-U.S. DPF Principles) with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF and from the United Kingdom (and Gibraltar) in reliance on the UK Extension to the EU-U.S. DPF",
          "similarity_score": 0.6475
        }
      ]
    }
  },
  {
    "article_number": 48,
    "article_title": "Transfers or disclosures not authorised by Union law",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "The services of the International Centre for Dispute Resolution are provided at no cost to you An individual has the possibility, under certain conditions, to invoke binding arbitration for complaints regarding DPF compliance not resolved by any of the other DPF mechanisms For additional information visithttps://www.dataprivacyframework.gov/s/article/ANNEX-I-introduction-dpf?tabset-35584=2 Government Enforcement Git. Hub is subject to the investigatory and enforcement powers of the Federal Trade Commission (FTC)",
          "similarity_score": 0.6013
        }
      ]
    }
  },
  {
    "article_number": 85,
    "article_title": "Processing and freedom of expression and information",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "These laws may grant specific rights to residents of these states when the laws come into effect This section uses the term personal information as an equivalent to the term Personal Data These rights are common to the US State privacy laws: Right to Knowledge and Correction: You have the right to request details on the specific personal information weve collected about you and the right to correct inaccurate information You can exercise this right by contacting us",
          "similarity_score": 0.6397
        },
        {
          "matched_policy_passage": "These rights are common to the US State privacy laws: Right to Knowledge and Correction: You have the right to request details on the specific personal information weve collected about you and the right to correct inaccurate information You can exercise this right by contacting us You can also access and edit basic account information in your settings Right to Know Data Recipients: We share your information with service providers for legitimate business operations, such as data storage and hosting",
          "similarity_score": 0.615
        }
      ]
    }
  },
  {
    "article_number": 70,
    "article_title": "Tasks of the Board",
    "matches": {
      "24.": [
        {
          "matched_policy_passage": "Right to Know Data Recipients: We share your information with service providers for legitimate business operations, such as data storage and hosting For more details, please see Sharing Your Information below Right to request Deletion: You reserve the right to request the deletion of your data, barring a few exceptions Such exceptions include circumstances where we are required to retain data to comply with legal obligations, detect fraudulent activity, investigate reports of abuse or other violations of our Terms of Service, or rectify security issues",
          "similarity_score": 0.6002
        }
      ]
    }
  }
]