[
  {
    "article_number": 12,
    "article_title": "Transparent information, communication and modalities for the exercise of the rights of the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "This may be collected through the Websites, such as through our live video and chat function on our marketing pages or during account registration.Licensee Information:We collect licensee name, email address, and similar information associated with the individual that receives a license key for the paid users of the Self-managed product.Content you provide through the use of the Services:Examples of content we collect and store include but are not limited to: the summary and description added to an issue, your repositories, commits, project contributions, profile metadata, activity data, comments, and any inputs and outputs generated by Artificial Intelligence (âAIâ) and Machine-Learning (âMLâ) powered features Content also includes any code, files and links you upload to the Services This is collected for the free and paid users of the Saa. S product.Customer Support and Professional Services Information:If you contact Git. Lab customer support or receive professional services, we will collect information about you related to your account and to the requests you are making or the services being provided Customer Support information is collected through the Websites, such as the. Git. Lab Community Forumand the. Git. Lab Support Portal",
          "similarity_score": 0.6031
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "To the extent a jurisdiction allows for different legal bases than those enumerated under GDPR, we will apply only those appropriate legal bases to the purposes of processing as required under applicable law.Performance of a Contract:We use your Personal Data to provide the Services you have subscribed to, and to complete and administer the contract you have entered into with Git. Lab, which includes the. Subscription Agreement, the. Website Terms of Use, event and training agreements, and any agreement to process payment information The purposes of processing and the categories of information used under this lawful basis are described below:Purpose of Processing. Personal Data Category. To create your account, identify and authenticate your access to the Services and provide you with the Services you have requested. Account Information. Profile Information. Payment and Identity Verification Information. Content you provide through the use of the Services. To process your payment for the Services you have purchased. Payment and Identity Verification Information. Licensee Information. Subscription Data. To provide. Customer Success Servicesfor the successful adoption of the Services. Account Information. Licensee Information. Content you provide through the use of the Services. Subscription Data. Customer Product Usage Information. To conduct user research and development. Contact Information. To send you important information, such as notifications about changes to the Services. Account Information. Profile Information. Contact Information. Content you provide through the use of the Services. To provide you a forum to comment on or discuss the Services. Account Information. Profile Information. Customer Support and Professional Services Information. To create digital productions and to manage online or in-person events. Contact Information. Other Content You Submit. To provide trainings and learning opportunities. Contact Information. Other Content You Submit. To enable partners to register, track deals and provide support, or to share information with our partners when you attend a joint event. Account Information. Subscription Information. To provide code workload and code review recommendations and other automated analysis of your contributions through AI and machine-learning. Content you provide through the use of the Services. To respond to your requests for customer support. Content you provide through the use of the Services. Customer Support and Professional Services Information. To improve the security of and troubleshoot our Services, as necessary to perform the contract governing your use of our applications or to communicate with you. Account Information. Profile Information. Content you provide through the use of the Services. Customer Support and Professional Services Information. To enforce the Terms of Use, Acceptable Use Policy and other legal terms that govern our Services. Account Information. Profile Information. Content you provide through the use of the Services. Consent:We may use your Personal Data, with your consent, for specific purposes such as marketing, surveys, call recordings, and research You may withdraw your consent for the specific purpose or object to the processing of your Personal Data at any time The purposes of processing and the categories of information used under this lawful basis are described below:Purpose of Processing. Personal Data Category. To understand how our Services are used and to improve our Services. Other Content You Submit. To provide. Customer Success Servicesfor the successful adoption of the Services. Profile Information. To provide personalized experiences through the Websites and Services and manage our use of tracking technologies. Cookies and Similar Tracking Technologies. To conduct user research and development. Account Information. Content you provide through the use of the Services. To send you information you have requested, such as information requested through our live-chat function. Contact Information. Device Information and Identifiers. Cookies and Similar Tracking Technologies. To send you advertising, marketing content, offers, promotions, newsletters, surveys or other information through email, phone call, and third-party messenger applications. Contact Information. To create digital productions and to manage online or in-person events. Call Recordings. To provide trainings and learning opportunities. Call Recordings. To enable partners to register, track deals and provide support, or to share information with our partners when you attend a joint event. Contact Information. Customer Support and Professional Services Information. Compliance with a Legal Obligation:We may use your Personal Data in connection with legal claims, regulatory compliance, and audits",
          "similarity_score": 0.6578
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "You may withdraw your consent for the specific purpose or object to the processing of your Personal Data at any time The purposes of processing and the categories of information used under this lawful basis are described below:Purpose of Processing. Personal Data Category. To understand how our Services are used and to improve our Services. Other Content You Submit. To provide. Customer Success Servicesfor the successful adoption of the Services. Profile Information. To provide personalized experiences through the Websites and Services and manage our use of tracking technologies. Cookies and Similar Tracking Technologies. To conduct user research and development. Account Information. Content you provide through the use of the Services. To send you information you have requested, such as information requested through our live-chat function. Contact Information. Device Information and Identifiers. Cookies and Similar Tracking Technologies. To send you advertising, marketing content, offers, promotions, newsletters, surveys or other information through email, phone call, and third-party messenger applications. Contact Information. To create digital productions and to manage online or in-person events. Call Recordings. To provide trainings and learning opportunities. Call Recordings. To enable partners to register, track deals and provide support, or to share information with our partners when you attend a joint event. Contact Information. Customer Support and Professional Services Information. Compliance with a Legal Obligation:We may use your Personal Data in connection with legal claims, regulatory compliance, and audits The purposes of processing and the categories of information used under this lawful basis are described below:Purpose of Processing. Personal Data Category. To create your account, identify and authenticate your access to the Services and provide you with the Services you have requested. Device Information and Identifiers. To process your payment for the Services you have purchased. Device Information and Identifiers. To detect, prevent, or otherwise address fraud and abuse to protect you, Git. Lab, and third-parties. Account Information. Profile Information. Payment and Identity Verification Information. Content you provide through the use of the Services. Device Information and Identifiers. To comply with our legal obligations, including export, privacy and security regulations. Account Information. Profile Information. Payment and Identity Verification Information. Content you provide through the use of the Services. Device Information and Identifiers. To protect the rights, safety and property of Git. Lab, you, or any third-party. Account Information. Profile Information. Payment and Identity Verification Information. Content you provide through the use of the Services. Device Information and Identifiers. Legitimate Interests:We rely on our legitimate interests or the legitimate interests of a third-party, such as our users, where they are not outweighed by your interests or fundamental rights and freedoms You may object to the processing of your Personal Data for these purposes at any time",
          "similarity_score": 0.6123
        }
      ]
    }
  },
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "12.": [
        {
          "matched_policy_passage": "If any such change of ownership happens, we will ensure that it is under terms that preserve the confidentiality of your Personal Data, and we will notify you on our website or by email before any transfer of your Personal Data.Sharing Personal Data Across National Borders. Our Services are hosted in the United States and information we collect will be stored and processed on our servers in the United States Our employees, contractors, affiliated organizations, service providers, and sub-processors that process Personal Data may be located in the United States or other countries outside of your home country If you reside in the EEA, United Kingdom, or Switzerland, and we transfer information about you to a jurisdiction that has not been found by the European Commission to have adequate data protections, we will use available safeguards and legal mechanisms to help ensure your rights and protections, including using Standard Contractual Clauses or obtaining your consent.For our customers whose use of the Git. Lab Websites and Services involves the processing of Personal Data from Japan, Git. Lab will transfer Personal Data originating in Japan to both its EEA and non-EEA affiliates, such as Git. Lab, Inc. in the United States To make this transfer, Git. Lab relies on the Japan Personal Information Protection Commisionâs adequacy decisions about the Personal Data protection system of the EEA and the United Kingdom, or the transfer will be made in accordance with our intra-company data transfer agreements that provide for obligations equivalent to those as stated under the APPIJ.How does Git. Lab Secure My Personal Data?We work hard to protect your Personal Data",
          "similarity_score": 0.6221
        }
      ]
    }
  },
  {
    "article_number": 50,
    "article_title": "International cooperation for the protection of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "Our employees, contractors, affiliated organizations, service providers, and sub-processors that process Personal Data may be located in the United States or other countries outside of your home country If you reside in the EEA, United Kingdom, or Switzerland, and we transfer information about you to a jurisdiction that has not been found by the European Commission to have adequate data protections, we will use available safeguards and legal mechanisms to help ensure your rights and protections, including using Standard Contractual Clauses or obtaining your consent.For our customers whose use of the Git. Lab Websites and Services involves the processing of Personal Data from Japan, Git. Lab will transfer Personal Data originating in Japan to both its EEA and non-EEA affiliates, such as Git. Lab, Inc. in the United States To make this transfer, Git. Lab relies on the Japan Personal Information Protection Commisionâs adequacy decisions about the Personal Data protection system of the EEA and the United Kingdom, or the transfer will be made in accordance with our intra-company data transfer agreements that provide for obligations equivalent to those as stated under the APPIJ.How does Git. Lab Secure My Personal Data?We work hard to protect your Personal Data We employ administrative, technical, and physical security controls where appropriate, to protect your information from unauthorized access or destruction",
          "similarity_score": 0.6106
        },
        {
          "matched_policy_passage": "Sharing Personal Data Across National Borders Our Services are hosted in the United States and information we collect will be stored and processed on our servers in the United States Our employees, contractors, affiliated organizations, service providers, and sub-processors that process Personal Data may be located in the United States or other countries outside of your home country If you reside in the EEA, United Kingdom, or Switzerland, and we transfer information about you to a jurisdiction that has not been found by the European Commission to have adequate data protections, we will use available safeguards and legal mechanisms to help ensure your rights and protections, including using Standard Contractual Clauses or obtaining your consent.For our customers whose use of the Git. Lab Websites and Services involves the processing of Personal Data from Japan, Git. Lab will transfer Personal Data originating in Japan to both its EEA and non-EEA affiliates, such as Git. Lab, Inc. in the United States To make this transfer, Git. Lab relies on the Japan Personal Information Protection Commisionâs adequacy decisions about the Personal Data protection system of the EEA and the United Kingdom, or the transfer will be made in accordance with our intra-company data transfer agreements that provide for obligations equivalent to those as stated under the APPIJ",
          "similarity_score": 0.6575
        },
        {
          "matched_policy_passage": "Our employees, contractors, affiliated organizations, service providers, and sub-processors that process Personal Data may be located in the United States or other countries outside of your home country If you reside in the EEA, United Kingdom, or Switzerland, and we transfer information about you to a jurisdiction that has not been found by the European Commission to have adequate data protections, we will use available safeguards and legal mechanisms to help ensure your rights and protections, including using Standard Contractual Clauses or obtaining your consent.For our customers whose use of the Git. Lab Websites and Services involves the processing of Personal Data from Japan, Git. Lab will transfer Personal Data originating in Japan to both its EEA and non-EEA affiliates, such as Git. Lab, Inc. in the United States To make this transfer, Git. Lab relies on the Japan Personal Information Protection Commisionâs adequacy decisions about the Personal Data protection system of the EEA and the United Kingdom, or the transfer will be made in accordance with our intra-company data transfer agreements that provide for obligations equivalent to those as stated under the APPIJ How does Git. Lab Secure My Personal Data? We work hard to protect your Personal Data. We employ administrative, technical, and physical security controls where appropriate, to protect your information from unauthorized access or destruction. For more information on our security practices please see:Technical and Organizational Security Measures for Git. Lab.com.Except to host the Services, Git. Lab does not process Personal Data in private groups or projects unless the following situations arise: to maintain security or to remediate a security incident; to scan for malware and vulnerabilities that violate the. Website Terms of Use; to comply with our legal obligations; to ensure the availability of the Services; to provide support to a repository owner upon request; or on the basis of your consent",
          "similarity_score": 0.6106
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "If you reside in the EEA, United Kingdom, or Switzerland, and we transfer information about you to a jurisdiction that has not been found by the European Commission to have adequate data protections, we will use available safeguards and legal mechanisms to help ensure your rights and protections, including using Standard Contractual Clauses or obtaining your consent.For our customers whose use of the Git. Lab Websites and Services involves the processing of Personal Data from Japan, Git. Lab will transfer Personal Data originating in Japan to both its EEA and non-EEA affiliates, such as Git. Lab, Inc. in the United States To make this transfer, Git. Lab relies on the Japan Personal Information Protection Commisionâs adequacy decisions about the Personal Data protection system of the EEA and the United Kingdom, or the transfer will be made in accordance with our intra-company data transfer agreements that provide for obligations equivalent to those as stated under the APPIJ.How does Git. Lab Secure My Personal Data?We work hard to protect your Personal Data We employ administrative, technical, and physical security controls where appropriate, to protect your information from unauthorized access or destruction For more information on our security practices please see:Technical and Organizational Security Measures for Git. Lab.com.Except to host the Services, Git. Lab does not process Personal Data in private groups or projects unless the following situations arise: to maintain security or to remediate a security incident; to scan for malware and vulnerabilities that violate the. Website Terms of Use; to comply with our legal obligations; to ensure the availability of the Services; to provide support to a repository owner upon request; or on the basis of your consent.Data Retention. In order to protect your Personal Data, Git. Lab will only retain your Personal Data for as long as your account is active or as needed to perform our contractual obligations, provide you the Services, comply with legal obligations, resolve disputes, preserve legal rights, or enforce our agreements.Git. Lab reserves the right to delete inactive accounts, projects, namespaces, and associated content",
          "similarity_score": 0.6158
        },
        {
          "matched_policy_passage": "If any such change of ownership happens, we will ensure that it is under terms that preserve the confidentiality of your Personal Data, and we will notify you on our website or by email before any transfer of your Personal Data Sharing Personal Data Across National Borders Our Services are hosted in the United States and information we collect will be stored and processed on our servers in the United States Our employees, contractors, affiliated organizations, service providers, and sub-processors that process Personal Data may be located in the United States or other countries outside of your home country If you reside in the EEA, United Kingdom, or Switzerland, and we transfer information about you to a jurisdiction that has not been found by the European Commission to have adequate data protections, we will use available safeguards and legal mechanisms to help ensure your rights and protections, including using Standard Contractual Clauses or obtaining your consent.For our customers whose use of the Git. Lab Websites and Services involves the processing of Personal Data from Japan, Git. Lab will transfer Personal Data originating in Japan to both its EEA and non-EEA affiliates, such as Git. Lab, Inc. in the United States",
          "similarity_score": 0.6301
        },
        {
          "matched_policy_passage": "If you reside in the EEA, United Kingdom, or Switzerland, and we transfer information about you to a jurisdiction that has not been found by the European Commission to have adequate data protections, we will use available safeguards and legal mechanisms to help ensure your rights and protections, including using Standard Contractual Clauses or obtaining your consent.For our customers whose use of the Git. Lab Websites and Services involves the processing of Personal Data from Japan, Git. Lab will transfer Personal Data originating in Japan to both its EEA and non-EEA affiliates, such as Git. Lab, Inc. in the United States To make this transfer, Git. Lab relies on the Japan Personal Information Protection Commisionâs adequacy decisions about the Personal Data protection system of the EEA and the United Kingdom, or the transfer will be made in accordance with our intra-company data transfer agreements that provide for obligations equivalent to those as stated under the APPIJ How does Git. Lab Secure My Personal Data? We work hard to protect your Personal Data. We employ administrative, technical, and physical security controls where appropriate, to protect your information from unauthorized access or destruction. For more information on our security practices please see:Technical and Organizational Security Measures for Git. Lab.com.Except to host the Services, Git. Lab does not process Personal Data in private groups or projects unless the following situations arise: to maintain security or to remediate a security incident; to scan for malware and vulnerabilities that violate the. Website Terms of Use; to comply with our legal obligations; to ensure the availability of the Services; to provide support to a repository owner upon request; or on the basis of your consent In order to protect your Personal Data, Git. Lab will only retain your Personal Data for as long as your account is active or as needed to perform our contractual obligations, provide you the Services, comply with legal obligations, resolve disputes, preserve legal rights, or enforce our agreements.Git. Lab reserves the right to delete inactive accounts, projects, namespaces, and associated content",
          "similarity_score": 0.6158
        }
      ]
    }
  },
  {
    "article_number": 80,
    "article_title": "Representation of data subjects",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "To port your profile information, you may use the. API.To inform your Supervisory Authority:In the unlikely event you disagree with our handling of your request, you have the right to file a complaint with the competent supervisory authority in your jurisdiction, such as the Autoriteit Persoonsgegevens (+31)-(0)70 - 8888 500 in the Netherlands.Appeals:If you are located in a state or country where you are granted the right to appeal Git. Lab's resolution of a data subject rights request, we will provide the specific information on how to appeal in our initial resolution letter to your request.U.S State Privacy Rights. If you are a California resident or reside in a US-state that requires statutory privacy disclosures, please visit the. U.S State Privacy Rights Disclosuresfor a specific description of your privacy rights and collection practices.Other Important Privacy Information. Statement Changes. Git. Lab may change its Privacy Statement from time to time When we do, we will update the date at the top of this Statement",
          "similarity_score": 0.6097
        },
        {
          "matched_policy_passage": "To port your profile information, you may use the. API.To inform your Supervisory Authority:In the unlikely event you disagree with our handling of your request, you have the right to file a complaint with the competent supervisory authority in your jurisdiction, such as the Autoriteit Persoonsgegevens (+31)-(0)70 - 8888 500 in the Netherlands.Appeals:If you are located in a state or country where you are granted the right to appeal Git. Lab's resolution of a data subject rights request, we will provide the specific information on how to appeal in our initial resolution letter to your request U.S. State Privacy Rights If you are a California resident or reside in a US-state that requires statutory privacy disclosures, please visit the. U.S State Privacy Rights Disclosuresfor a specific description of your privacy rights and collection practices Other Important Privacy Information Git. Lab may change its Privacy Statement from time to time",
          "similarity_score": 0.6097
        }
      ]
    }
  },
  {
    "article_number": 59,
    "article_title": "Activity reports",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "How does Git. Lab Use My Personal Data and Our Legal Basis for Processing? Git. Lab collects and processes each category of Personal Data for the purposes listed in the tables below.When our processing is subject to international laws, including but not limited to the General Data Protection Regulation (\"GDPR\") that governs individuals located in the European Economic Area (\"EEA\"), we have attributed one of the legal bases enumerated under the GDPR to the âPurpose of Processingâ activity. To the extent a jurisdiction allows for different legal bases than those enumerated under GDPR, we will apply only those appropriate legal bases to the purposes of processing as required under applicable law. Performance of a Contract: We use your Personal Data to provide the Services you have subscribed to, and to complete and administer the contract you have entered into with Git. Lab, which includes the. Subscription Agreement, the. Website Terms of Use, event and training agreements, and any agreement to process payment information The purposes of processing and the categories of information used under this lawful basis are described below: To create your account, identify and authenticate your access to the Services and provide you with the Services you have requested Account Information. Profile Information. Payment and Identity Verification Information. Content you provide through the use of the Services Payment and Identity Verification Information Content you provide through the use of the Services To process your payment for the Services you have purchased Payment and Identity Verification Information. Licensee Information. Subscription Data Payment and Identity Verification Information To provide. Customer Success Servicesfor the successful adoption of the Services Account Information. Licensee Information. Content you provide through the use of the Services. Subscription Data. Customer Product Usage Information Content you provide through the use of the Services Customer Product Usage Information To conduct user research and development To send you important information, such as notifications about changes to the Services Account Information. Profile Information. Contact Information. Content you provide through the use of the Services Content you provide through the use of the Services To provide you a forum to comment on or discuss the Services Account Information. Profile Information. Customer Support and Professional Services Information Customer Support and Professional Services Information To create digital productions and to manage online or in-person events Contact Information. Other Content You Submit Other Content You Submit To provide trainings and learning opportunities Contact Information. Other Content You Submit Other Content You Submit To enable partners to register, track deals and provide support, or to share information with our partners when you attend a joint event Account Information. Subscription Information Subscription Information To provide code workload and code review recommendations and other automated analysis of your contributions through AI and machine-learning Content you provide through the use of the Services Content you provide through the use of the Services To respond to your requests for customer support Content you provide through the use of the Services. Customer Support and Professional Services Information Content you provide through the use of the Services Customer Support and Professional Services Information To improve the security of and troubleshoot our Services, as necessary to perform the contract governing your use of our applications or to communicate with you Account Information. Profile Information. Content you provide through the use of the Services. Customer Support and Professional Services Information Content you provide through the use of the Services Customer Support and Professional Services Information To enforce the Terms of Use, Acceptable Use Policy and other legal terms that govern our Services Account Information. Profile Information. Content you provide through the use of the Services Content you provide through the use of the Services We may use your Personal Data, with your consent, for specific purposes such as marketing, surveys, call recordings, and research You may withdraw your consent for the specific purpose or object to the processing of your Personal Data at any time The purposes of processing and the categories of information used under this lawful basis are described below: To understand how our Services are used and to improve our Services Other Content You Submit Other Content You Submit To provide. Customer Success Servicesfor the successful adoption of the Services To provide personalized experiences through the Websites and Services and manage our use of tracking technologies Cookies and Similar Tracking Technologies Cookies and Similar Tracking Technologies To conduct user research and development Account Information. Content you provide through the use of the Services Content you provide through the use of the Services To send you information you have requested, such as information requested through our live-chat function Contact Information. Device Information and Identifiers. Cookies and Similar Tracking Technologies Device Information and Identifiers Cookies and Similar Tracking Technologies To send you advertising, marketing content, offers, promotions, newsletters, surveys or other information through email, phone call, and third-party messenger applications To create digital productions and to manage online or in-person events To provide trainings and learning opportunities To enable partners to register, track deals and provide support, or to share information with our partners when you attend a joint event Contact Information. Customer Support and Professional Services Information Customer Support and Professional Services Information Compliance with a Legal Obligation: We may use your Personal Data in connection with legal claims, regulatory compliance, and audits",
          "similarity_score": 0.6032
        }
      ]
    }
  }
]