[
  {
    "article_number": 57,
    "article_title": "Tasks",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "If you are outside the Designated Countries, we also collect (or rely on others who collect) information about your device where you have not engaged with our Services (e.g., ad ID, IP address, operating system and browser information) so we can provide our Members with relevant ads and better understand their effectiveness.Learn more You canopt outfrom our use of data from cookies and similar technologies that track your behavior on the sites of others for ad targeting and other ad-related purposes For Visitors,the controls arehere.5 Your Device and Location. We receive data through cookies and similar technologies. When you visit or leave our Services (including some plugins and our cookies or similar technology on the sites of others), we receive the URL of both the site you came from and the one you go to and the time of your visit We also get information about your network and device (e.g., IP address, proxy server, operating system, web browser and add-ons, device identifier and features, cookie IDs and/or ISP, or your mobile carrier)",
          "similarity_score": 0.6044
        },
        {
          "matched_policy_passage": "Other Important Information5 Security. We monitor for and try to prevent security breaches Please use the security features available through our Services.We implement security safeguards designed to protect your data, such as HTTPS We regularly monitor our systems for possible vulnerabilities and attacks",
          "similarity_score": 0.6008
        },
        {
          "matched_policy_passage": "Other Important Information5 Other Important Information5 Other Important Information We monitor for and try to prevent security breaches Please use the security features available through our Services",
          "similarity_score": 0.6218
        },
        {
          "matched_policy_passage": "Other Important Information5 Other Important Information We monitor for and try to prevent security breaches Please use the security features available through our Services We monitor for and try to prevent security breaches",
          "similarity_score": 0.6282
        }
      ],
      "6.": [
        {
          "matched_policy_passage": "Visitors canlearn more about how to make these requests here You may also contact us using the contact information below, and we will consider your request in accordance with applicable laws Residents in the. Designated Countries and the UK, andother regions, may have additional rights under their laws We keep some of your data even after you close your account",
          "similarity_score": 0.6049
        }
      ]
    }
  },
  {
    "article_number": 14,
    "article_title": "Information to be provided where personal data have not been obtained from the data subject",
    "matches": {
      "18.": [
        {
          "matched_policy_passage": "We use the data we have about you (e.g., data you provide, data we collect from your engagement with our Services and inferences we make from the data we have about you), to personalize our Services for you, such as by recommending or ranking relevant content and conversations on our Services We also use the data we have about you to suggest skills you could add to your profile and skills that you might need to pursue your next opportunity So, if you let us know that you are interested in a new skill (e.g., by watching a learning video), we will use this information to personalize content in your feed, suggest that you follow certain Members on our site, or suggest related learning content to help you towards that new skill We use your content, activity and other data, including your name and photo, to provide notices to your network and others",
          "similarity_score": 0.6081
        }
      ],
      "25.": [
        {
          "matched_policy_passage": "If you purchase a Service from us, we may use a payments service provider who may separately collect information about you (e.g., for fraud prevention or to comply with legal obligations).6 Legal Disclosures. We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others.It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others We attempt to notify Members about legal demands for their personal data when appropriate in our judgment, unless prohibited by law or court order or when the request is an emergency We may dispute such demands when we believe, in our discretion, that the requests are overbroad, vague or lack proper authority, but we do not promise to challenge every demand To learn more see our. Data Request Guidelinesand. Transparency Report.7 Change in Control or Sale. We may share your data when our business is sold to others, but it must continue to be used in accordance with this Privacy Policy.We can also share your personal data as part of a sale, merger or change in control, or in preparation for any of these events",
          "similarity_score": 0.6196
        },
        {
          "matched_policy_passage": "3.6 Legal Disclosures We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others",
          "similarity_score": 0.623
        },
        {
          "matched_policy_passage": "We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others",
          "similarity_score": 0.6732
        },
        {
          "matched_policy_passage": "We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others We attempt to notify Members about legal demands for their personal data when appropriate in our judgment, unless prohibited by law or court order or when the request is an emergency",
          "similarity_score": 0.6544
        },
        {
          "matched_policy_passage": "We may need to share your data when we believe its required by law or to help protect the rights and safety of you, us or others It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others We attempt to notify Members about legal demands for their personal data when appropriate in our judgment, unless prohibited by law or court order or when the request is an emergency We may dispute such demands when we believe, in our discretion, that the requests are overbroad, vague or lack proper authority, but we do not promise to challenge every demand",
          "similarity_score": 0.6417
        },
        {
          "matched_policy_passage": "To learn more see our. Data Request Guidelinesand. Transparency Report.7 Change in Control or Sale It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others We attempt to notify Members about legal demands for their personal data when appropriate in our judgment, unless prohibited by law or court order or when the request is an emergency We may dispute such demands when we believe, in our discretion, that the requests are overbroad, vague or lack proper authority, but we do not promise to challenge every demand To learn more see our. Data Request Guidelinesand. Transparency Report.7 Change in Control or Sale It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others",
          "similarity_score": 0.6231
        },
        {
          "matched_policy_passage": "To learn more see our. Data Request Guidelinesand. Transparency Report.7 Change in Control or Sale It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others We attempt to notify Members about legal demands for their personal data when appropriate in our judgment, unless prohibited by law or court order or when the request is an emergency We may dispute such demands when we believe, in our discretion, that the requests are overbroad, vague or lack proper authority, but we do not promise to challenge every demand To learn more see our. Data Request Guidelinesand. Transparency Report",
          "similarity_score": 0.6231
        }
      ],
      "23.": [
        {
          "matched_policy_passage": "We may dispute such demands when we believe, in our discretion, that the requests are overbroad, vague or lack proper authority, but we do not promise to challenge every demand To learn more see our. Data Request Guidelinesand. Transparency Report.7 Change in Control or Sale It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others We attempt to notify Members about legal demands for their personal data when appropriate in our judgment, unless prohibited by law or court order or when the request is an emergency We may dispute such demands when we believe, in our discretion, that the requests are overbroad, vague or lack proper authority, but we do not promise to challenge every demand",
          "similarity_score": 0.6156
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "17.": [
        {
          "matched_policy_passage": "Please use the security features available through our Services.We implement security safeguards designed to protect your data, such as HTTPS We regularly monitor our systems for possible vulnerabilities and attacks However, we cannot warrant the security of any information that you send us There is no guarantee that data may not be accessed, disclosed, altered, or destroyed by breach of any of our physical, technical, or managerial safeguards",
          "similarity_score": 0.6714
        },
        {
          "matched_policy_passage": "It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others We attempt to notify Members about legal demands for their personal data when appropriate in our judgment, unless prohibited by law or court order or when the request is an emergency We may dispute such demands when we believe, in our discretion, that the requests are overbroad, vague or lack proper authority, but we do not promise to challenge every demand To learn more see our. Data Request Guidelinesand. Transparency Report.7 Change in Control or Sale It is possible that we will need to disclose information about you when required by law, subpoena, or other legal process or if we have a good faith belief that disclosure is reasonably necessary to (1) investigate, prevent or take action regarding suspected or actual illegal activities or to assist government enforcement agencies; (2) enforce our agreements with you; (3) investigate and defend ourselves against any third-party claims or allegations; (4) protect the security or integrity of our Services or the products or services of our Affiliates (such as by sharing with companies facing similar threats); or (5) exercise or protect the rights and safety of Linked. In, our Members, personnel or others",
          "similarity_score": 0.605
        },
        {
          "matched_policy_passage": "Please use the security features available through our Services We implement security safeguards designed to protect your data, such as HTTPS We regularly monitor our systems for possible vulnerabilities and attacks However, we cannot warrant the security of any information that you send us",
          "similarity_score": 0.6342
        },
        {
          "matched_policy_passage": "We implement security safeguards designed to protect your data, such as HTTPS We regularly monitor our systems for possible vulnerabilities and attacks However, we cannot warrant the security of any information that you send us There is no guarantee that data may not be accessed, disclosed, altered, or destroyed by breach of any of our physical, technical, or managerial safeguards",
          "similarity_score": 0.6541
        }
      ],
      "2.": [
        {
          "matched_policy_passage": "Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here.If you're located in one of the Designated Countries or the UK, you can learn more about our lawful bases for processing in our. European Regional Privacy Notice Direct Marketing and Do Not Track Signals. Our statements regarding direct marketing and do not track signals.We currently do not share personal data with third parties for their direct marketing purposes without your permission.Learn moreabout this and about our response to do not track signals Contact Information. You can contact us or use other options to resolve any complaints.If you have questions or complaints regarding this Policy, please firstcontact Linked. Inonline",
          "similarity_score": 0.6379
        },
        {
          "matched_policy_passage": "5.3 Lawful Bases for Processing We have lawful bases to collect, use and share data about you You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings We have lawful bases to collect, use and share data about you",
          "similarity_score": 0.6425
        },
        {
          "matched_policy_passage": "We have lawful bases to collect, use and share data about you You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings We have lawful bases to collect, use and share data about you",
          "similarity_score": 0.6903
        },
        {
          "matched_policy_passage": "We have lawful bases to collect, use and share data about you You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings We will only collect and process personal data about you where we have lawful bases",
          "similarity_score": 0.6883
        },
        {
          "matched_policy_passage": "We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here.If you're located in one of the Designated Countries or the UK, you can learn more about our lawful bases for processing in our. European Regional Privacy Notice Direct Marketing and Do Not Track Signals We will only collect and process personal data about you where we have lawful bases",
          "similarity_score": 0.6575
        },
        {
          "matched_policy_passage": "Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here.If you're located in one of the Designated Countries or the UK, you can learn more about our lawful bases for processing in our. European Regional Privacy Notice Direct Marketing and Do Not Track Signals We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More",
          "similarity_score": 0.6379
        },
        {
          "matched_policy_passage": "Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here.If you're located in one of the Designated Countries or the UK, you can learn more about our lawful bases for processing in our. European Regional Privacy Notice Direct Marketing and Do Not Track Signals We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more",
          "similarity_score": 0.6379
        },
        {
          "matched_policy_passage": "Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here If you're located in one of the Designated Countries or the UK, you can learn more about our lawful bases for processing in our. European Regional Privacy Notice",
          "similarity_score": 0.6581
        },
        {
          "matched_policy_passage": "Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Consent. Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal",
          "similarity_score": 0.7043
        },
        {
          "matched_policy_passage": "Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms",
          "similarity_score": 0.7156
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Other Important Information5 Other Important Information5",
          "similarity_score": 0.6814
        }
      ],
      "7.": [
        {
          "matched_policy_passage": "We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Other Important Information5 Other Important Information5 Other Important Information We monitor for and try to prevent security breaches",
          "similarity_score": 0.7047
        }
      ]
    }
  },
  {
    "article_number": 50,
    "article_title": "International cooperation for the protection of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "There is no guarantee that data may not be accessed, disclosed, altered, or destroyed by breach of any of our physical, technical, or managerial safeguards Please visit our. Safety Centerfor additional information about safely using our Services, includingtwo-factor authentication Cross-Border Data Transfers. We store and use your data outside your country.We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing. We have lawful bases to collect, use and share data about you",
          "similarity_score": 0.6486
        },
        {
          "matched_policy_passage": "Please visit our. Safety Centerfor additional information about safely using our Services, includingtwo-factor authentication Cross-Border Data Transfers. We store and use your data outside your country.We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing. We have lawful bases to collect, use and share data about you You have choices about our use of your data",
          "similarity_score": 0.6641
        },
        {
          "matched_policy_passage": "We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Effective September 18, 2024 Effective September 18, 2024 Effective September 18, 2024 Linked. In's global Privacy Policy below applies worldwide If you're located in the EU, EEA, UK, or Switzerland, you can review additional information that will apply to you in our. European Regional Privacy Notice Linked. In's global Privacy Policy below applies worldwide",
          "similarity_score": 0.6193
        },
        {
          "matched_policy_passage": "We store and use your data outside your country We store and use your data outside your country We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more",
          "similarity_score": 0.606
        },
        {
          "matched_policy_passage": "We store and use your data outside your country We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more",
          "similarity_score": 0.6272
        },
        {
          "matched_policy_passage": "Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country 5.3 Lawful Bases for Processing We have lawful bases to collect, use and share data about you",
          "similarity_score": 0.6056
        },
        {
          "matched_policy_passage": "Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country 5.3 Lawful Bases for Processing We have lawful bases to collect, use and share data about you You have choices about our use of your data",
          "similarity_score": 0.6342
        }
      ],
      "2.": [
        {
          "matched_policy_passage": "Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Privacy Policy. Effective September 18, 2024Linked. In's global Privacy Policy below applies worldwide If you're located in the EU, EEA, UK, or Switzerland, you can review additional information that will apply to you in our. European Regional Privacy Notice.Your Privacy Matters. Linked. Ins mission is to connect the worlds professionals to allow them to be more productive and successful",
          "similarity_score": 0.6527
        },
        {
          "matched_policy_passage": "We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Privacy Policy. Effective September 18, 2024Linked. In's global Privacy Policy below applies worldwide If you're located in the EU, EEA, UK, or Switzerland, you can review additional information that will apply to you in our. European Regional Privacy Notice.Your Privacy Matters. Linked. Ins mission is to connect the worlds professionals to allow them to be more productive and successful Central to this mission is our commitment to be transparent about the data we collect about you, how it is used and with whom it is shared.This Privacy Policy applies when you use our Services (described below)",
          "similarity_score": 0.6358
        },
        {
          "matched_policy_passage": "Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Effective September 18, 2024 Effective September 18, 2024 Effective September 18, 2024 Linked. In's global Privacy Policy below applies worldwide If you're located in the EU, EEA, UK, or Switzerland, you can review additional information that will apply to you in our. European Regional Privacy Notice",
          "similarity_score": 0.6397
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Cross-Border Data Transfers. We store and use your data outside your country.We process data both inside and outside of the United States and rely on legally-provided mechanisms to lawfully transfer data across borders.Learn more Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing. We have lawful bases to collect, use and share data about you You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings.We will only collect and process personal data about you where we have lawful bases",
          "similarity_score": 0.6414
        }
      ]
    }
  },
  {
    "article_number": 9,
    "article_title": "Processing of special categories of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country.3 Lawful Bases for Processing. We have lawful bases to collect, use and share data about you You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings.We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More",
          "similarity_score": 0.6401
        },
        {
          "matched_policy_passage": "Direct Marketing and Do Not Track Signals We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here.If you're located in one of the Designated Countries or the UK, you can learn more about our lawful bases for processing in our. European Regional Privacy Notice Direct Marketing and Do Not Track Signals We will only collect and process personal data about you where we have lawful bases",
          "similarity_score": 0.6159
        },
        {
          "matched_policy_passage": "Direct Marketing and Do Not Track Signals We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here",
          "similarity_score": 0.6142
        },
        {
          "matched_policy_passage": "We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Consent. Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us",
          "similarity_score": 0.7503
        },
        {
          "matched_policy_passage": "We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us",
          "similarity_score": 0.7262
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings.We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here.If you're located in one of the Designated Countries or the UK, you can learn more about our lawful bases for processing in our. European Regional Privacy Notice",
          "similarity_score": 0.7001
        },
        {
          "matched_policy_passage": "At any time, you can withdraw consent you have provided by going to settings.We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here.If you're located in one of the Designated Countries or the UK, you can learn more about our lawful bases for processing in our. European Regional Privacy Notice Direct Marketing and Do Not Track Signals. Our statements regarding direct marketing and do not track signals.We currently do not share personal data with third parties for their direct marketing purposes without your permission.Learn moreabout this and about our response to do not track signals",
          "similarity_score": 0.6801
        },
        {
          "matched_policy_passage": "If contacting us does not resolve your complaint, you have moreoptions Residents in the. Designated Countriesandother regionsmay also have the right tocontact our Data Protection Officer here If this does not resolve your complaint, Residents in the Designated Countries and other regions may have moreoptionsunder their laws.Consent. Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal",
          "similarity_score": 0.6259
        },
        {
          "matched_policy_passage": "You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Privacy Policy. Effective September 18, 2024Linked. In's global Privacy Policy below applies worldwide",
          "similarity_score": 0.7193
        },
        {
          "matched_policy_passage": "You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Effective September 18, 2024 Effective September 18, 2024 Effective September 18, 2024 Linked. In's global Privacy Policy below applies worldwide",
          "similarity_score": 0.671
        },
        {
          "matched_policy_passage": "You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Introduction. We are a social network and online platform for professionals",
          "similarity_score": 0.7165
        },
        {
          "matched_policy_passage": "You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Other Important Information5",
          "similarity_score": 0.7312
        },
        {
          "matched_policy_passage": "You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings We have lawful bases to collect, use and share data about you You have choices about our use of your data",
          "similarity_score": 0.7273
        },
        {
          "matched_policy_passage": "At any time, you can withdraw consent you have provided by going to settings We have lawful bases to collect, use and share data about you You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings",
          "similarity_score": 0.7476
        },
        {
          "matched_policy_passage": "You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More",
          "similarity_score": 0.7
        },
        {
          "matched_policy_passage": "At any time, you can withdraw consent you have provided by going to settings We will only collect and process personal data about you where we have lawful bases Lawful bases include consent (where you have given consent), contract (where processing is necessary for the performance of a contract with you (e.g., to deliver the Linked. In Services you have requested) and legitimate interests.Learn more.Where we rely on yourconsentto process personal data, you have the right to withdraw or decline your consent at any time and where we rely on legitimate interests, you have the right to object.Learn More If you have any questions about the lawful bases upon which we collect and use your personal data, pleasecontact our Data Protection Officer here.If you're located in one of the Designated Countries or the UK, you can learn more about our lawful bases for processing in our. European Regional Privacy Notice",
          "similarity_score": 0.6787
        },
        {
          "matched_policy_passage": "Residents in the. Designated Countriesandother regionsmay also have the right tocontact our Data Protection Officer here If this does not resolve your complaint, Residents in the Designated Countries and other regions may have moreoptionsunder their laws Consent. Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal",
          "similarity_score": 0.6548
        },
        {
          "matched_policy_passage": "You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Consent. Where we process data based on consent, we will ask for your explicit consent",
          "similarity_score": 0.7298
        },
        {
          "matched_policy_passage": "You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Where we process data based on consent, we will ask for your explicit consent",
          "similarity_score": 0.7229
        }
      ],
      "2.": [
        {
          "matched_policy_passage": "Residents in the. Designated Countriesandother regionsmay also have the right tocontact our Data Protection Officer here If this does not resolve your complaint, Residents in the Designated Countries and other regions may have moreoptionsunder their laws.Consent. Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us",
          "similarity_score": 0.6941
        },
        {
          "matched_policy_passage": "If this does not resolve your complaint, Residents in the Designated Countries and other regions may have moreoptionsunder their laws.Consent. Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms",
          "similarity_score": 0.712
        },
        {
          "matched_policy_passage": "If this does not resolve your complaint, Residents in the Designated Countries and other regions may have moreoptionsunder their laws Consent. Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us",
          "similarity_score": 0.7082
        }
      ],
      "4.": [
        {
          "matched_policy_passage": "Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal",
          "similarity_score": 0.7068
        }
      ]
    }
  },
  {
    "article_number": 22,
    "article_title": "Automated individual decision-making, including profiling",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms Introduction. We are a social network and online platform for professionals People use our Services to find and be found for business opportunities, to connect with others and find information",
          "similarity_score": 0.65
        }
      ],
      "5.": [
        {
          "matched_policy_passage": "Consent. Where we process data based on consent, we will ask for your explicit consent You may withdraw your consent at any time, but that will not affect the lawfulness of the processing of your personal data prior to such withdrawal Where we rely on contract, we will ask that you agree to the processing of personal data that is necessary for entering into or performance of your contract with us We will rely on legitimate interests as a basis for data processing where the processing of your data is not overridden by your interests or fundamental rights and freedoms",
          "similarity_score": 0.7338
        }
      ]
    }
  },
  {
    "article_number": 13,
    "article_title": "Information to be provided where personal data are collected from the data subject",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "If you are outside of the Designated Countries, Linked. In Corporation will be the controller of (or business responsible for) your personal data provided to, or collected by or for, or processed in connection with our Services As a Visitor or Member of our Services, the collection, use and sharing of your personal data is subject to this Privacy Policy and other documents referenced in this Privacy Policy, as well as updates Changes to the Privacy Policy apply to your use of our Services after the effective date Changes to the Privacy Policy apply to your use of our Services after the effective date",
          "similarity_score": 0.6084
        }
      ]
    }
  },
  {
    "article_number": 89,
    "article_title": "Safeguards and derogations relating to processing for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We use the personal data available to us to research social, economic and workplace trends, such as jobs availability and skills needed for thesejobsand policies that help bridge the gap in various industries and geographic areas In some cases, we work with trusted third parties to perform this research, undercontrolsthat are designed to protect your privacy We may also make public data available toresearchersto enable assessment of the safety and legal compliance of our Services We publish or allow others to publish economic insights, presented as aggregated data rather than personal data",
          "similarity_score": 0.6223
        }
      ]
    }
  },
  {
    "article_number": 51,
    "article_title": "Supervisory authority",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Regulated Members may need to store communications outside of our Service Regulated Members may need to store communications outside of our Service Some Members (or their employers) need, for legal or professional compliance, to archive their communications and social media activity, and will use services of others to provide these archival services We enable archiving of messages by and to those Members outside of our Services",
          "similarity_score": 0.6021
        }
      ]
    }
  },
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "We generally retain your personal data as long as you keep your account open or as needed to provide you Services This includes data you or others provided to us and data generated or inferred from your use of our Services Even if you only use our Services when looking for a new job every few years, we will retain your information and keep your profile open, unless you close your account In some cases we choose to retain certain information (e.g., insights about Services use) in a depersonalized or aggregated form.2 Rights to Access and Control Your Personal Data We generally retain your personal data as long as you keep your account open or as needed to provide you Services",
          "similarity_score": 0.6171
        },
        {
          "matched_policy_passage": "This includes data you or others provided to us and data generated or inferred from your use of our Services Even if you only use our Services when looking for a new job every few years, we will retain your information and keep your profile open, unless you close your account In some cases we choose to retain certain information (e.g., insights about Services use) in a depersonalized or aggregated form.2 Rights to Access and Control Your Personal Data We generally retain your personal data as long as you keep your account open or as needed to provide you Services This includes data you or others provided to us and data generated or inferred from your use of our Services",
          "similarity_score": 0.6126
        },
        {
          "matched_policy_passage": "In some cases we choose to retain certain information (e.g., insights about Services use) in a depersonalized or aggregated form.2 Rights to Access and Control Your Personal Data We generally retain your personal data as long as you keep your account open or as needed to provide you Services This includes data you or others provided to us and data generated or inferred from your use of our Services Even if you only use our Services when looking for a new job every few years, we will retain your information and keep your profile open, unless you close your account In some cases we choose to retain certain information (e.g., insights about Services use) in a depersonalized or aggregated form.2 Rights to Access and Control Your Personal Data We generally retain your personal data as long as you keep your account open or as needed to provide you Services",
          "similarity_score": 0.6262
        },
        {
          "matched_policy_passage": "In some cases we choose to retain certain information (e.g., insights about Services use) in a depersonalized or aggregated form.2 Rights to Access and Control Your Personal Data We generally retain your personal data as long as you keep your account open or as needed to provide you Services This includes data you or others provided to us and data generated or inferred from your use of our Services Even if you only use our Services when looking for a new job every few years, we will retain your information and keep your profile open, unless you close your account In some cases we choose to retain certain information (e.g., insights about Services use) in a depersonalized or aggregated form",
          "similarity_score": 0.6262
        }
      ]
    }
  },
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "In some cases we choose to retain certain information (e.g., insights about Services use) in a depersonalized or aggregated form 4.2 Rights to Access and Control Your Personal Data You can access or delete your personal data You have many choices about how your data is collected, used and shared You can access or delete your personal data",
          "similarity_score": 0.6164
        }
      ],
      "11.": [
        {
          "matched_policy_passage": "There is no guarantee that data may not be accessed, disclosed, altered, or destroyed by breach of any of our physical, technical, or managerial safeguards Please visit our. Safety Centerfor additional information about safely using our Services, includingtwo-factor authentication Cross-Border Data Transfers We implement security safeguards designed to protect your data, such as HTTPS We regularly monitor our systems for possible vulnerabilities and attacks",
          "similarity_score": 0.603
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Right to Access and/or Take Your Data: You can ask us for a copy of your personal data and can ask for a copy of personal data you provided in machine readable form Visitors canlearn more about how to make these requests here You may also contact us using the contact information below, and we will consider your request in accordance with applicable laws Residents in the. Designated Countries and the UK, andother regions, may have additional rights under their laws",
          "similarity_score": 0.6481
        }
      ]
    }
  },
  {
    "article_number": 1,
    "article_title": "Subject-matter and objectives",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Countries where we process data may have laws which are different from, and potentially not as protective as, the laws of your own country 5.3 Lawful Bases for Processing We have lawful bases to collect, use and share data about you You have choices about our use of your data At any time, you can withdraw consent you have provided by going to settings",
          "similarity_score": 0.6454
        }
      ]
    }
  }
]