[
  {
    "article_number": 38,
    "article_title": "Position of the data protection officer",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "is primarily responsible for exercising the rights of data subjects and providing information about data processing.This Privacy Notice identifies what Personal Data we may process about you The extent varies depending on whether you are just visiting our Website or using our products or services We do not process health data or otherwise sensitive data about you For more information, you can contact us anytime atprivacy@jetbrains.com",
          "similarity_score": 0.6652
        },
        {
          "matched_policy_passage": "We do not process health data or otherwise sensitive data about you For more information, you can contact us anytime atprivacy@jetbrains.com This document applies only to situations where we act as a Personal Data controller More information about circumstances in which we are in the role of data processor can be found in our. Data Processing Agreement",
          "similarity_score": 0.6019
        }
      ]
    }
  },
  {
    "article_number": 13,
    "article_title": "Information to be provided where personal data are collected from the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "For more information, you can contact us anytime atprivacy@jetbrains.com This document applies only to situations where we act as a Personal Data controller More information about circumstances in which we are in the role of data processor can be found in our. Data Processing Agreement The list of our partners who might process your Personal Data, including the location of the data, can be foundhere",
          "similarity_score": 0.642
        },
        {
          "matched_policy_passage": "This document applies only to situations where we act as a Personal Data controller More information about circumstances in which we are in the role of data processor can be found in our. Data Processing Agreement The list of our partners who might process your Personal Data, including the location of the data, can be foundhere Definitions. The following definitions are used throughout this Privacy Notice:COPPA.Childrens Online Privacy Protection Act",
          "similarity_score": 0.6298
        },
        {
          "matched_policy_passage": "In that case, you may revoke your consent.Examples of Personal Data involved in data processing include:Name;Email address;Phone number;Username;Password;Photograph (if voluntarily provided);Cookies or other tracking identifiers;Internet Protocol (IP) address;Information about your device and/or internet browser;SSH public key;Physical address;Information about subscription and payments, including financial information associated with our accounts and payments;Tax ID;Data about your use of Jet. Brains Products, services, and your Jet. Brains Account;Comments, voluntarily provided feedback, and any data provided in survey responses or forms; and. Data in issue reports pertaining to Jet. Brains Products and services, such as project or device names.Where appropriate, we will prompt you to give us your consent to collect and process your data as described above This may happen within Jet. Brains Products, on the Jet. Brains Website, or in another environment set up by Jet. Brains, always in a clear and conspicuous manner You can manage your Personal Data and opt-outs as described in Section 5, Transparency, below How We Collect Data. We collect Personal Data directly from you when you interact with our products and services or communicate directly with us",
          "similarity_score": 0.6015
        },
        {
          "matched_policy_passage": "Jet. Brains and itsassociated companiesact as joint data controllers, who are jointly responsible for compliance with data protection legislation is primarily responsible for exercising the rights of data subjects and providing information about data processing This Privacy Notice identifies what Personal Data we may process about you The extent varies depending on whether you are just visiting our Website or using our products or services",
          "similarity_score": 0.6285
        },
        {
          "matched_policy_passage": "This document applies only to situations where we act as a Personal Data controller More information about circumstances in which we are in the role of data processor can be found in our. Data Processing Agreement The list of our partners who might process your Personal Data, including the location of the data, can be foundhere The following definitions are used throughout this Privacy Notice: COPPA.Childrens Online Privacy Protection Act",
          "similarity_score": 0.6449
        }
      ],
      "4.": [
        {
          "matched_policy_passage": "We may use and disclose your Personal Data where required by law, such as in keeping and disclosing our accounts, in keeping and disclosing our tax records, and in response to a court order, valid subpoena, or other legal process for the period of time required by such laws The legal basis for this data processing is our compliance with our legal obligations.You may object at any time to the processing of your Personal Data unless you provide us with consent for such processing In that case, you may revoke your consent.Examples of Personal Data involved in data processing include:Name;Email address;Phone number;Username;Password;Photograph (if voluntarily provided);Cookies or other tracking identifiers;Internet Protocol (IP) address;Information about your device and/or internet browser;SSH public key;Physical address;Information about subscription and payments, including financial information associated with our accounts and payments;Tax ID;Data about your use of Jet. Brains Products, services, and your Jet. Brains Account;Comments, voluntarily provided feedback, and any data provided in survey responses or forms; and. Data in issue reports pertaining to Jet. Brains Products and services, such as project or device names.Where appropriate, we will prompt you to give us your consent to collect and process your data as described above This may happen within Jet. Brains Products, on the Jet. Brains Website, or in another environment set up by Jet. Brains, always in a clear and conspicuous manner",
          "similarity_score": 0.7024
        },
        {
          "matched_policy_passage": "The legal basis for this data processing is our compliance with our legal obligations.You may object at any time to the processing of your Personal Data unless you provide us with consent for such processing In that case, you may revoke your consent.Examples of Personal Data involved in data processing include:Name;Email address;Phone number;Username;Password;Photograph (if voluntarily provided);Cookies or other tracking identifiers;Internet Protocol (IP) address;Information about your device and/or internet browser;SSH public key;Physical address;Information about subscription and payments, including financial information associated with our accounts and payments;Tax ID;Data about your use of Jet. Brains Products, services, and your Jet. Brains Account;Comments, voluntarily provided feedback, and any data provided in survey responses or forms; and. Data in issue reports pertaining to Jet. Brains Products and services, such as project or device names.Where appropriate, we will prompt you to give us your consent to collect and process your data as described above This may happen within Jet. Brains Products, on the Jet. Brains Website, or in another environment set up by Jet. Brains, always in a clear and conspicuous manner You can manage your Personal Data and opt-outs as described in Section 5, Transparency, below",
          "similarity_score": 0.7116
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "12.": [
        {
          "matched_policy_passage": "For example, we may usethird-party service providersto provide data storage and backup services The legal basis for this data processing is the performance of a contract between you and us With your consent, your Personal Data may also be transferred tothird-party service providers, acting as separate data controllers, who provide products and services complementary to Jet. Brains Products (further data processing performed by these service providers is governed by their privacy policies) The legal basis for this data processing is consent.b)To protect us from piracy and the unlawful use of our software or services",
          "similarity_score": 0.6173
        }
      ],
      "14.": [
        {
          "matched_policy_passage": "Sharing of Personal Data. Collected Personal Data is shared in accordance with the Jet. Brains Terms of Use of a given product or service, as well as this Privacy Notice Additionally, we share collected Personal Data within the Jet. Brains group of companies described above, which act as joint data controllers and process Personal Data for the purposes described in the section Why We Collect Data and What We Collect, or with our data processors, a list of which can be foundhere, who help us operate our software and services.As part of the functionality of a given product or service, collected Personal Data may be shared with other representatives of your company, in accordance with the Jet. Brains Terms of Use covering that product or service.Through our Jet. Brains Website, we may share your Personal Data with third-party advertising partners These third-party advertising partners may apply technologies and other tracking tools on our services to collect information regarding your activities and your device (e.g your IP address, cookie identifiers, page(s) visited, location, and time of day)",
          "similarity_score": 0.6243
        }
      ],
      "17.": [
        {
          "matched_policy_passage": "Security. To secure your Personal Data, our products and services are designed with security, data protection, and privacy in mind.We encrypt your data in transit and at rest where it is technically feasible For the protection of data during transmission, we use an up-to-date TLS (Transport Layer Security) protocol to encrypt your data To encrypt data at rest, we use strong, up-to-date encryption algorithms, such as AES-256 All encryption keys are regularly rotated, and access to them is strictly limited.We thoroughly review all Personal Data usage processes before implementation to help achieve compliance with applicable data-protection-related laws and to safeguard user information",
          "similarity_score": 0.6205
        }
      ],
      "2.": [
        {
          "matched_policy_passage": "is primarily responsible for exercising the rights of data subjects and providing information about data processing This Privacy Notice identifies what Personal Data we may process about you The extent varies depending on whether you are just visiting our Website or using our products or services We do not process health data or otherwise sensitive data about you",
          "similarity_score": 0.6789
        },
        {
          "matched_policy_passage": "With your consent, your Personal Data may also be transferred tothird-party service providers, acting as separate data controllers, who provide products and services complementary to Jet. Brains Products (further data processing performed by these service providers is governed by their privacy policies) The legal basis for this data processing is consent b)To protect us from piracy and the unlawful use of our software or services We may collect data that is necessary to protect us from piracy or the unlawful or unauthorized use of our software or services, or that is necessary to ensure the security of our software or services, including both Personal Data provided by you (see above) and data collected in the course of your use of Jet. Brains Products",
          "similarity_score": 0.6516
        },
        {
          "matched_policy_passage": "You may object at any time to the processing of your Personal Data unless you provide us with consent for such processing In that case, you may revoke your consent Examples of Personal Data involved in data processing include: Photograph (if voluntarily provided); Cookies or other tracking identifiers; Internet Protocol (IP) address; Information about your device and/or internet browser; Information about subscription and payments, including financial information associated with our accounts and payments; Data about your use of Jet. Brains Products, services, and your Jet. Brains Account; Comments, voluntarily provided feedback, and any data provided in survey responses or forms; and Data in issue reports pertaining to Jet. Brains Products and services, such as project or device names Where appropriate, we will prompt you to give us your consent to collect and process your data as described above",
          "similarity_score": 0.6557
        }
      ]
    }
  },
  {
    "article_number": 9,
    "article_title": "Processing of special categories of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "The legal basis for this data processing is the performance of a contract between you and us With your consent, your Personal Data may also be transferred tothird-party service providers, acting as separate data controllers, who provide products and services complementary to Jet. Brains Products (further data processing performed by these service providers is governed by their privacy policies) The legal basis for this data processing is consent.b)To protect us from piracy and the unlawful use of our software or services We may collect data that is necessary to protect us from piracy or the unlawful or unauthorized use of our software or services, or that is necessary to ensure the security of our software or services, including both Personal Data provided by you (see above) and data collected in the course of your use of Jet. Brains Products",
          "similarity_score": 0.7377
        },
        {
          "matched_policy_passage": "The legal basis for this data processing is consent b)To protect us from piracy and the unlawful use of our software or services We may collect data that is necessary to protect us from piracy or the unlawful or unauthorized use of our software or services, or that is necessary to ensure the security of our software or services, including both Personal Data provided by you (see above) and data collected in the course of your use of Jet. Brains Products The legal basis for this data processing is Jet. Brains legitimate interest in protection from piracy and from the unlawful use of Jet. Brains software and services",
          "similarity_score": 0.6379
        },
        {
          "matched_policy_passage": "The legal basis for this data processing is our compliance with our legal obligations You may object at any time to the processing of your Personal Data unless you provide us with consent for such processing In that case, you may revoke your consent Examples of Personal Data involved in data processing include: Photograph (if voluntarily provided); Cookies or other tracking identifiers; Internet Protocol (IP) address; Information about your device and/or internet browser; Information about subscription and payments, including financial information associated with our accounts and payments; Data about your use of Jet. Brains Products, services, and your Jet. Brains Account; Comments, voluntarily provided feedback, and any data provided in survey responses or forms; and Data in issue reports pertaining to Jet. Brains Products and services, such as project or device names",
          "similarity_score": 0.725
        }
      ],
      "7.": [
        {
          "matched_policy_passage": "We use this data to better understand the usage patterns of our products and the behaviors of our collective audience At times, we may share this information in an aggregated anonymous form with third parties Since the data is anonymous, no personal data is processed Please refer to our. Cookie Noticefor more information regarding the collection of non-anonymous data (cookies) when you are using the Jet. Brains Website",
          "similarity_score": 0.606
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "We may use and disclose your Personal Data where required by law, such as in keeping and disclosing our accounts, in keeping and disclosing our tax records, and in response to a court order, valid subpoena, or other legal process for the period of time required by such laws The legal basis for this data processing is our compliance with our legal obligations You may object at any time to the processing of your Personal Data unless you provide us with consent for such processing In that case, you may revoke your consent",
          "similarity_score": 0.679
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "With your consent, your Personal Data may also be transferred tothird-party service providers, acting as separate data controllers, who provide products and services complementary to Jet. Brains Products (further data processing performed by these service providers is governed by their privacy policies) The legal basis for this data processing is consent.b)To protect us from piracy and the unlawful use of our software or services We may collect data that is necessary to protect us from piracy or the unlawful or unauthorized use of our software or services, or that is necessary to ensure the security of our software or services, including both Personal Data provided by you (see above) and data collected in the course of your use of Jet. Brains Products The legal basis for this data processing is Jet. Brains legitimate interest in protection from piracy and from the unlawful use of Jet. Brains software and services",
          "similarity_score": 0.6751
        },
        {
          "matched_policy_passage": "For example, we may usethird-party service providersto provide data storage and backup services The legal basis for this data processing is the performance of a contract between you and us With your consent, your Personal Data may also be transferred tothird-party service providers, acting as separate data controllers, who provide products and services complementary to Jet. Brains Products (further data processing performed by these service providers is governed by their privacy policies) The legal basis for this data processing is consent",
          "similarity_score": 0.6375
        },
        {
          "matched_policy_passage": "The legal basis for this data processing is the performance of a contract between you and us With your consent, your Personal Data may also be transferred tothird-party service providers, acting as separate data controllers, who provide products and services complementary to Jet. Brains Products (further data processing performed by these service providers is governed by their privacy policies) The legal basis for this data processing is consent b)To protect us from piracy and the unlawful use of our software or services",
          "similarity_score": 0.7056
        }
      ]
    }
  },
  {
    "article_number": 21,
    "article_title": "Right to object",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "The legal basis for this data processing is consent.b)To protect us from piracy and the unlawful use of our software or services We may collect data that is necessary to protect us from piracy or the unlawful or unauthorized use of our software or services, or that is necessary to ensure the security of our software or services, including both Personal Data provided by you (see above) and data collected in the course of your use of Jet. Brains Products The legal basis for this data processing is Jet. Brains legitimate interest in protection from piracy and from the unlawful use of Jet. Brains software and services Such personal data may include your IP address and information about your Jet. Brains Account",
          "similarity_score": 0.6163
        },
        {
          "matched_policy_passage": "The legal basis for this data processing is our legitimate interest in keeping internal evidence and protecting the rights and interests of us and other users e)To promote and market our products and services.We may use feedback that you voluntarily provide about our products or services As permitted by applicable law, we may use such feedback in the form of anonymized quotes or in other ways in accordance with the Jet. Brains Terms of Use We also may use data that we collect and aggregate to assist us in determining the appropriate marketing and advertising for our products and services",
          "similarity_score": 0.6203
        }
      ]
    }
  },
  {
    "article_number": 89,
    "article_title": "Safeguards and derogations relating to processing for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "The legal basis for this data processing is our legitimate interest in keeping internal evidence and protecting the rights and interests of us and other users.e)To promote and market our products and services.We may use feedback that you voluntarily provide about our products or services As permitted by applicable law, we may use such feedback in the form of anonymized quotes or in other ways in accordance with the Jet. Brains Terms of Use We also may use data that we collect and aggregate to assist us in determining the appropriate marketing and advertising for our products and services In doing so, we may share anonymous aggregated data with third parties to assist us with these efforts",
          "similarity_score": 0.6337
        }
      ]
    }
  },
  {
    "article_number": 45,
    "article_title": "Transfers on the basis of an adequacy decision",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "The legal basis for this data processing is our legitimate interest in promoting and marketing our products and services, or your explicit consent During conferences or events, we may use badge scanning services, also called lead retrieval or scanning, where we can scan your badge and collect certain Personal Data to enable us to contact you for the above-mentioned purposes.f)To fulfill legal duties stipulated by accounting, taxation, and other laws We may use and disclose your Personal Data where required by law, such as in keeping and disclosing our accounts, in keeping and disclosing our tax records, and in response to a court order, valid subpoena, or other legal process for the period of time required by such laws The legal basis for this data processing is our compliance with our legal obligations.You may object at any time to the processing of your Personal Data unless you provide us with consent for such processing",
          "similarity_score": 0.6505
        },
        {
          "matched_policy_passage": "Where permitted by applicable law, we may charge a fee for this service.Moreover, as set out in locally applicable Personal Data protection laws, you may have the right to: (i) request access to your Personal Data; (ii) request rectification of your Personal Data; (iii) request the erasure of your Personal Data; (iv) request a restriction on the processing of your Personal Data; (v) request Personal Data portability; or (vi) object to, or opt-out of, the processing of your Personal Data in some cases.Right of access.You may have the right to obtain from us a confirmation as to whether or not Personal Data concerning you is being processed, and, where that is the case, to request access to your Personal Data The information about Personal Data processing includes the purposes of the processing, the categories of Personal Data concerned, the recipients or categories of recipients to whom your Personal Data has been or will be disclosed, etc However, this is not an absolute right, and the interests of other individuals may restrict your right of access Further, you may have the right to obtain a copy of your Personal Data undergoing processing",
          "similarity_score": 0.696
        },
        {
          "matched_policy_passage": "The legal basis for this data processing is our legitimate interest in promoting and marketing our products and services, or your explicit consent During conferences or events, we may use badge scanning services, also called lead retrieval or scanning, where we can scan your badge and collect certain Personal Data to enable us to contact you for the above-mentioned purposes f)To fulfill legal duties stipulated by accounting, taxation, and other laws We may use and disclose your Personal Data where required by law, such as in keeping and disclosing our accounts, in keeping and disclosing our tax records, and in response to a court order, valid subpoena, or other legal process for the period of time required by such laws",
          "similarity_score": 0.6428
        },
        {
          "matched_policy_passage": "f)To fulfill legal duties stipulated by accounting, taxation, and other laws We may use and disclose your Personal Data where required by law, such as in keeping and disclosing our accounts, in keeping and disclosing our tax records, and in response to a court order, valid subpoena, or other legal process for the period of time required by such laws The legal basis for this data processing is our compliance with our legal obligations You may object at any time to the processing of your Personal Data unless you provide us with consent for such processing",
          "similarity_score": 0.6922
        },
        {
          "matched_policy_passage": "Where permitted by applicable law, we may charge a fee for this service Moreover, as set out in locally applicable Personal Data protection laws, you may have the right to: (i) request access to your Personal Data; (ii) request rectification of your Personal Data; (iii) request the erasure of your Personal Data; (iv) request a restriction on the processing of your Personal Data; (v) request Personal Data portability; or (vi) object to, or opt-out of, the processing of your Personal Data in some cases Right of access.You may have the right to obtain from us a confirmation as to whether or not Personal Data concerning you is being processed, and, where that is the case, to request access to your Personal Data The information about Personal Data processing includes the purposes of the processing, the categories of Personal Data concerned, the recipients or categories of recipients to whom your Personal Data has been or will be disclosed, etc",
          "similarity_score": 0.6964
        }
      ]
    }
  },
  {
    "article_number": 58,
    "article_title": "Powers",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "During conferences or events, we may use badge scanning services, also called lead retrieval or scanning, where we can scan your badge and collect certain Personal Data to enable us to contact you for the above-mentioned purposes.f)To fulfill legal duties stipulated by accounting, taxation, and other laws We may use and disclose your Personal Data where required by law, such as in keeping and disclosing our accounts, in keeping and disclosing our tax records, and in response to a court order, valid subpoena, or other legal process for the period of time required by such laws The legal basis for this data processing is our compliance with our legal obligations.You may object at any time to the processing of your Personal Data unless you provide us with consent for such processing In that case, you may revoke your consent.Examples of Personal Data involved in data processing include:Name;Email address;Phone number;Username;Password;Photograph (if voluntarily provided);Cookies or other tracking identifiers;Internet Protocol (IP) address;Information about your device and/or internet browser;SSH public key;Physical address;Information about subscription and payments, including financial information associated with our accounts and payments;Tax ID;Data about your use of Jet. Brains Products, services, and your Jet. Brains Account;Comments, voluntarily provided feedback, and any data provided in survey responses or forms; and. Data in issue reports pertaining to Jet. Brains Products and services, such as project or device names.Where appropriate, we will prompt you to give us your consent to collect and process your data as described above",
          "similarity_score": 0.6016
        }
      ]
    }
  },
  {
    "article_number": 8,
    "article_title": "Conditions applicable to child's consent in relation to information society services",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "How We Protect Children's Personal Data. Our products and services are generally not designed for and are not offered to children under the age of 13 In some cases, there's an exception to this approach, and children under 13 might be able to use our products When a child confirms that they are under 13 years old, we ask for their parent's or legal guardian's email address to obtain permission to process such Personal Data for this purpose in accordance with COPPA and GDPR If we don't receive permission within three (3) days or we are denied permission, the Personal Data collected through the form will be automatically deleted after three (3) days",
          "similarity_score": 0.6874
        },
        {
          "matched_policy_passage": "In some cases, there's an exception to this approach, and children under 13 might be able to use our products When a child confirms that they are under 13 years old, we ask for their parent's or legal guardian's email address to obtain permission to process such Personal Data for this purpose in accordance with COPPA and GDPR If we don't receive permission within three (3) days or we are denied permission, the Personal Data collected through the form will be automatically deleted after three (3) days We don't send marketing communications to children under 15 years old",
          "similarity_score": 0.6275
        },
        {
          "matched_policy_passage": "When a child confirms that they are under 13 years old, we ask for their parent's or legal guardian's email address to obtain permission to process such Personal Data for this purpose in accordance with COPPA and GDPR If we don't receive permission within three (3) days or we are denied permission, the Personal Data collected through the form will be automatically deleted after three (3) days We don't send marketing communications to children under 15 years old Children between the ages of 13 and 16 are asked to confirm that they discussed the processing of their data with their parents or legal guardians and have their permission",
          "similarity_score": 0.6456
        },
        {
          "matched_policy_passage": "Direct interaction.We may collect Personal Data from you as part of your interaction with us, for example, when we provide product or sales support to you How We Protect Children's Personal Data Our products and services are generally not designed for and are not offered to children under the age of 13 In some cases, there's an exception to this approach, and children under 13 might be able to use our products When a child confirms that they are under 13 years old, we ask for their parent's or legal guardian's email address to obtain permission to process such Personal Data for this purpose in accordance with COPPA and GDPR",
          "similarity_score": 0.6323
        },
        {
          "matched_policy_passage": "How We Protect Children's Personal Data Our products and services are generally not designed for and are not offered to children under the age of 13 In some cases, there's an exception to this approach, and children under 13 might be able to use our products When a child confirms that they are under 13 years old, we ask for their parent's or legal guardian's email address to obtain permission to process such Personal Data for this purpose in accordance with COPPA and GDPR If we don't receive permission within three (3) days or we are denied permission, the Personal Data collected through the form will be automatically deleted after three (3) days",
          "similarity_score": 0.6913
        }
      ]
    }
  },
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "You may also contact us atprivacy@jetbrains.com Sharing of Personal Data. Collected Personal Data is shared in accordance with the Jet. Brains Terms of Use of a given product or service, as well as this Privacy Notice Additionally, we share collected Personal Data within the Jet. Brains group of companies described above, which act as joint data controllers and process Personal Data for the purposes described in the section Why We Collect Data and What We Collect, or with our data processors, a list of which can be foundhere, who help us operate our software and services.As part of the functionality of a given product or service, collected Personal Data may be shared with other representatives of your company, in accordance with the Jet. Brains Terms of Use covering that product or service.Through our Jet. Brains Website, we may share your Personal Data with third-party advertising partners These third-party advertising partners may apply technologies and other tracking tools on our services to collect information regarding your activities and your device (e.g",
          "similarity_score": 0.625
        }
      ],
      "6.": [
        {
          "matched_policy_passage": "After the Personal Data removal, we may keep pseudonyms of your Personal Data solely as a record of the data removal Generally, we retain your Personal Data as long as we need to in order to achieve the purpose for which it was collected We may retain your information if it is required for compliance with legal obligations and/or defense in the event of a violation of the Jet. Brains Terms of Use and/or Privacy Policies We may also have copies of your information in application logs, weblogs, and/or backups made for security and support purposes if this is mentioned in a Jet. Brains Terms of Use or consent text accepted before the Personal Data collection",
          "similarity_score": 0.6012
        }
      ]
    }
  },
  {
    "article_number": 50,
    "article_title": "International cooperation for the protection of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "This practice is commonly referred to as interest-based advertising, cross-context behavioral advertising, or personalized advertising.We may also share your Personal Data with certain third parties (such as with tax authorities or with other government bodies exercising their statutory powers) if we are obliged to do so under applicable legislation, to protect our legal rights and those of others, or if such sharing is necessary to achieve the purposes defined in section Why We Collect Data and What We Collect (especially with government bodies or with parties harmed as a result of violations of applicable laws).If we are involved in a merger, an acquisition, financial due diligence, reorganization, bankruptcy, receivership, purchase or sale of assets, or a transition of service to another provider In that case, your information may be sold or transferred as part of such a transaction, as permitted by law and/or contract.You. Tube API Services.We may display You. Tube videos on the Jet. Brains Website using the API client The API client uses. You. Tube API Services By interacting with the video, you agree to. You. Tube's Terms of Serviceand acknowledge. Google's Privacy Notice",
          "similarity_score": 0.6435
        },
        {
          "matched_policy_passage": "This practice is commonly referred to as interest-based advertising, cross-context behavioral advertising, or personalized advertising We may also share your Personal Data with certain third parties (such as with tax authorities or with other government bodies exercising their statutory powers) if we are obliged to do so under applicable legislation, to protect our legal rights and those of others, or if such sharing is necessary to achieve the purposes defined in section Why We Collect Data and What We Collect (especially with government bodies or with parties harmed as a result of violations of applicable laws) If we are involved in a merger, an acquisition, financial due diligence, reorganization, bankruptcy, receivership, purchase or sale of assets, or a transition of service to another provider In that case, your information may be sold or transferred as part of such a transaction, as permitted by law and/or contract",
          "similarity_score": 0.6165
        },
        {
          "matched_policy_passage": "We may also share your Personal Data with certain third parties (such as with tax authorities or with other government bodies exercising their statutory powers) if we are obliged to do so under applicable legislation, to protect our legal rights and those of others, or if such sharing is necessary to achieve the purposes defined in section Why We Collect Data and What We Collect (especially with government bodies or with parties harmed as a result of violations of applicable laws) If we are involved in a merger, an acquisition, financial due diligence, reorganization, bankruptcy, receivership, purchase or sale of assets, or a transition of service to another provider In that case, your information may be sold or transferred as part of such a transaction, as permitted by law and/or contract You. Tube API Services.We may display You. Tube videos on the Jet. Brains Website using the API client",
          "similarity_score": 0.637
        }
      ]
    }
  },
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "All encryption keys are regularly rotated, and access to them is strictly limited.We thoroughly review all Personal Data usage processes before implementation to help achieve compliance with applicable data-protection-related laws and to safeguard user information This is done to minimize data usage and to make sure that you, as the data owner, are informed about the processing When the reason for data storage expires, and we are no longer required to keep it, we remove your Personal Data from our servers or anonymize it for further usage Depending on the activity within which your data is collected, it may appear in datasets used for research",
          "similarity_score": 0.6026
        },
        {
          "matched_policy_passage": "This is done to minimize data usage and to make sure that you, as the data owner, are informed about the processing When the reason for data storage expires, and we are no longer required to keep it, we remove your Personal Data from our servers or anonymize it for further usage Depending on the activity within which your data is collected, it may appear in datasets used for research Before using the datasets for research or other purposes you are not informed of, we remove or anonymize your Personal Data in the datasets.We usesuppliersto host our products and services and Jet. Brains Websites and to process your data in accordance with this Privacy Notice",
          "similarity_score": 0.6347
        },
        {
          "matched_policy_passage": "Generally, we retain your Personal Data as long as we need to in order to achieve the purpose for which it was collected We may retain your information if it is required for compliance with legal obligations and/or defense in the event of a violation of the Jet. Brains Terms of Use and/or Privacy Policies We may also have copies of your information in application logs, weblogs, and/or backups made for security and support purposes if this is mentioned in a Jet. Brains Terms of Use or consent text accepted before the Personal Data collection These backups will not be accessible as separately delineated information",
          "similarity_score": 0.6158
        },
        {
          "matched_policy_passage": "We may store Personal Data pertaining to a customer or user for as long as they are entitled to a license for or usage of Jet. Brains Products Further, we may keep the data to protect ourselves from damage in the event of litigation in accordance with the current legislation Please note, however, that you must retain a copy of all data that you have placed on our servers in case of any loss Further, if you cease using our software and/or services, we will not be responsible for the retention of any of your data.Data management",
          "similarity_score": 0.6535
        },
        {
          "matched_policy_passage": "We thoroughly review all Personal Data usage processes before implementation to help achieve compliance with applicable data-protection-related laws and to safeguard user information This is done to minimize data usage and to make sure that you, as the data owner, are informed about the processing When the reason for data storage expires, and we are no longer required to keep it, we remove your Personal Data from our servers or anonymize it for further usage Depending on the activity within which your data is collected, it may appear in datasets used for research",
          "similarity_score": 0.7285
        },
        {
          "matched_policy_passage": "This is done to minimize data usage and to make sure that you, as the data owner, are informed about the processing When the reason for data storage expires, and we are no longer required to keep it, we remove your Personal Data from our servers or anonymize it for further usage Depending on the activity within which your data is collected, it may appear in datasets used for research Before using the datasets for research or other purposes you are not informed of, we remove or anonymize your Personal Data in the datasets",
          "similarity_score": 0.6674
        },
        {
          "matched_policy_passage": "When the reason for data storage expires, and we are no longer required to keep it, we remove your Personal Data from our servers or anonymize it for further usage Depending on the activity within which your data is collected, it may appear in datasets used for research Before using the datasets for research or other purposes you are not informed of, we remove or anonymize your Personal Data in the datasets We usesuppliersto host our products and services and Jet. Brains Websites and to process your data in accordance with this Privacy Notice",
          "similarity_score": 0.6146
        },
        {
          "matched_policy_passage": "We may store Personal Data pertaining to a customer or user for as long as they are entitled to a license for or usage of Jet. Brains Products Further, we may keep the data to protect ourselves from damage in the event of litigation in accordance with the current legislation Please note, however, that you must retain a copy of all data that you have placed on our servers in case of any loss Further, if you cease using our software and/or services, we will not be responsible for the retention of any of your data",
          "similarity_score": 0.6377
        },
        {
          "matched_policy_passage": "Retention of Personal Information We store the personal information we collect as described in this Privacy Notice for as long as you use Jet. Brains Products or as necessary to fulfill the purpose(s) for which it was collected, provide our products and services, resolve disputes, establish legal defenses, conduct audits, pursue legitimate business purposes, enforce our agreements, and comply with applicable laws, or based upon other criteria, including, but not limited to, the sensitivity and volume of such data Additionally, we endeavor to retain all such personal information in accordance with legal requirements De-Identified Information.If we create or receive de-identified information, we will maintain and use such de-identified information in de-identified form",
          "similarity_score": 0.6125
        },
        {
          "matched_policy_passage": "We store the personal information we collect as described in this Privacy Notice for as long as you use Jet. Brains Products or as necessary to fulfill the purpose(s) for which it was collected, provide our products and services, resolve disputes, establish legal defenses, conduct audits, pursue legitimate business purposes, enforce our agreements, and comply with applicable laws, or based upon other criteria, including, but not limited to, the sensitivity and volume of such data Additionally, we endeavor to retain all such personal information in accordance with legal requirements De-Identified Information.If we create or receive de-identified information, we will maintain and use such de-identified information in de-identified form We will not attempt to reidentify such information, except to comply with applicable law",
          "similarity_score": 0.6053
        },
        {
          "matched_policy_passage": "The right to confirm whether we are processing their personal information and to obtain a copy of their personal information in a portable and, to the extent technically feasible, readily usable format The right to delete their personal information provided to or obtained by us The right to correct inaccuracies in their personal information The right to opt out of certain types of processing, including: To opt out of the sale of their personal information; To opt out of targeted advertising by us; and To opt out of any processing of personal information for the purpose of making decisions that produce legal or similarly significant effects",
          "similarity_score": 0.6084
        }
      ],
      "1.": [
        {
          "matched_policy_passage": "However, this is not an absolute right, and the interests of other individuals may restrict your right of access Further, you may have the right to obtain a copy of your Personal Data undergoing processing For additional copies requested, we may charge a reasonable fee based on administrative costs.Right to rectification.You may have the right to obtain from us the rectification of inaccurate Personal Data Depending on the purposes of the processing, you may have the right to have incomplete Personal Data made complete, in particular by providing a supplementary statement.Right to erasure (right to be forgotten).Under certain circumstances, you may have the right to require us to delete your Personal Data.Right to a restriction of processing.Under certain circumstances, you may have the right to require us to restrict the processing of your Personal Data",
          "similarity_score": 0.6612
        }
      ]
    }
  },
  {
    "article_number": 17,
    "article_title": "Right to erasure (‘right to be forgotten’)",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "When the reason for data storage expires, and we are no longer required to keep it, we remove your Personal Data from our servers or anonymize it for further usage Depending on the activity within which your data is collected, it may appear in datasets used for research Before using the datasets for research or other purposes you are not informed of, we remove or anonymize your Personal Data in the datasets.We usesuppliersto host our products and services and Jet. Brains Websites and to process your data in accordance with this Privacy Notice When choosing a supplier, Jet. Brains performs a supplier risk assessment process to evaluate their compliance with legal regulations and security standards and help ensure that your data is stored in a secure location with appropriate security measures in place.For more details about security at Jet. Brains, please visit our. Trust Center",
          "similarity_score": 0.6124
        },
        {
          "matched_policy_passage": "Further, you may have the right to obtain a copy of your Personal Data undergoing processing For additional copies requested, we may charge a reasonable fee based on administrative costs.Right to rectification.You may have the right to obtain from us the rectification of inaccurate Personal Data Depending on the purposes of the processing, you may have the right to have incomplete Personal Data made complete, in particular by providing a supplementary statement.Right to erasure (right to be forgotten).Under certain circumstances, you may have the right to require us to delete your Personal Data.Right to a restriction of processing.Under certain circumstances, you may have the right to require us to restrict the processing of your Personal Data In this case, the respective Personal Data will be marked and may only be processed by us for certain purposes.Right to Personal Data portability.Under certain circumstances, you may have the right to receive the Personal Data that you have provided us concerning you in a structured, commonly used, and machine-readable format, and to transmit this Personal Data to another entity.Right to Object.Under certain circumstances, you may have the right to object at any time, on grounds relating to the particular situation, to the processing of your Personal Data by us, and we may be required to no longer process your Personal Data.These rights can be exercised by sending an email toprivacy@jetbrains.com.You may also contact Jet. Brains to get up-to-date information about the processing of your Personal Data and any Personal Data recipients.You may lodge a complaint related to the processing of your Personal Data with the competent data protection authority for the country where you are located or with the. Czech data protection authority, as we are based in that country",
          "similarity_score": 0.6666
        },
        {
          "matched_policy_passage": "For additional copies requested, we may charge a reasonable fee based on administrative costs.Right to rectification.You may have the right to obtain from us the rectification of inaccurate Personal Data Depending on the purposes of the processing, you may have the right to have incomplete Personal Data made complete, in particular by providing a supplementary statement.Right to erasure (right to be forgotten).Under certain circumstances, you may have the right to require us to delete your Personal Data.Right to a restriction of processing.Under certain circumstances, you may have the right to require us to restrict the processing of your Personal Data In this case, the respective Personal Data will be marked and may only be processed by us for certain purposes.Right to Personal Data portability.Under certain circumstances, you may have the right to receive the Personal Data that you have provided us concerning you in a structured, commonly used, and machine-readable format, and to transmit this Personal Data to another entity.Right to Object.Under certain circumstances, you may have the right to object at any time, on grounds relating to the particular situation, to the processing of your Personal Data by us, and we may be required to no longer process your Personal Data.These rights can be exercised by sending an email toprivacy@jetbrains.com.You may also contact Jet. Brains to get up-to-date information about the processing of your Personal Data and any Personal Data recipients.You may lodge a complaint related to the processing of your Personal Data with the competent data protection authority for the country where you are located or with the. Czech data protection authority, as we are based in that country Changes to This Notice. This Privacy Notice is current as of the date of the last update set forth above",
          "similarity_score": 0.6609
        },
        {
          "matched_policy_passage": "Depending on the purposes of the processing, you may have the right to have incomplete Personal Data made complete, in particular by providing a supplementary statement.Right to erasure (right to be forgotten).Under certain circumstances, you may have the right to require us to delete your Personal Data.Right to a restriction of processing.Under certain circumstances, you may have the right to require us to restrict the processing of your Personal Data In this case, the respective Personal Data will be marked and may only be processed by us for certain purposes.Right to Personal Data portability.Under certain circumstances, you may have the right to receive the Personal Data that you have provided us concerning you in a structured, commonly used, and machine-readable format, and to transmit this Personal Data to another entity.Right to Object.Under certain circumstances, you may have the right to object at any time, on grounds relating to the particular situation, to the processing of your Personal Data by us, and we may be required to no longer process your Personal Data.These rights can be exercised by sending an email toprivacy@jetbrains.com.You may also contact Jet. Brains to get up-to-date information about the processing of your Personal Data and any Personal Data recipients.You may lodge a complaint related to the processing of your Personal Data with the competent data protection authority for the country where you are located or with the. Czech data protection authority, as we are based in that country Changes to This Notice. This Privacy Notice is current as of the date of the last update set forth above We may change this Privacy Notice from time to time, so please be sure to check back periodically",
          "similarity_score": 0.71
        },
        {
          "matched_policy_passage": "Depending on the purposes of the processing, you may have the right to have incomplete Personal Data made complete, in particular by providing a supplementary statement Right to erasure (right to be forgotten).Under certain circumstances, you may have the right to require us to delete your Personal Data Right to a restriction of processing.Under certain circumstances, you may have the right to require us to restrict the processing of your Personal Data In this case, the respective Personal Data will be marked and may only be processed by us for certain purposes",
          "similarity_score": 0.712
        },
        {
          "matched_policy_passage": "Right to erasure (right to be forgotten).Under certain circumstances, you may have the right to require us to delete your Personal Data Right to a restriction of processing.Under certain circumstances, you may have the right to require us to restrict the processing of your Personal Data In this case, the respective Personal Data will be marked and may only be processed by us for certain purposes Right to Personal Data portability.Under certain circumstances, you may have the right to receive the Personal Data that you have provided us concerning you in a structured, commonly used, and machine-readable format, and to transmit this Personal Data to another entity",
          "similarity_score": 0.7333
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "The information about Personal Data processing includes the purposes of the processing, the categories of Personal Data concerned, the recipients or categories of recipients to whom your Personal Data has been or will be disclosed, etc However, this is not an absolute right, and the interests of other individuals may restrict your right of access Further, you may have the right to obtain a copy of your Personal Data undergoing processing For additional copies requested, we may charge a reasonable fee based on administrative costs.Right to rectification.You may have the right to obtain from us the rectification of inaccurate Personal Data",
          "similarity_score": 0.7784
        },
        {
          "matched_policy_passage": "In this case, the respective Personal Data will be marked and may only be processed by us for certain purposes.Right to Personal Data portability.Under certain circumstances, you may have the right to receive the Personal Data that you have provided us concerning you in a structured, commonly used, and machine-readable format, and to transmit this Personal Data to another entity.Right to Object.Under certain circumstances, you may have the right to object at any time, on grounds relating to the particular situation, to the processing of your Personal Data by us, and we may be required to no longer process your Personal Data.These rights can be exercised by sending an email toprivacy@jetbrains.com.You may also contact Jet. Brains to get up-to-date information about the processing of your Personal Data and any Personal Data recipients.You may lodge a complaint related to the processing of your Personal Data with the competent data protection authority for the country where you are located or with the. Czech data protection authority, as we are based in that country Changes to This Notice. This Privacy Notice is current as of the date of the last update set forth above We may change this Privacy Notice from time to time, so please be sure to check back periodically We will post any changes to this Privacy Notice on the Jet. Brains Website",
          "similarity_score": 0.7514
        },
        {
          "matched_policy_passage": "As permitted by applicable law, you may have the right to request a copy of the information that we hold about you To do so, please go to your Jet. Brains Account and ask for a copy through the means available there, or contactprivacy@jetbrains.com Where permitted by applicable law, we may charge a fee for this service Moreover, as set out in locally applicable Personal Data protection laws, you may have the right to: (i) request access to your Personal Data; (ii) request rectification of your Personal Data; (iii) request the erasure of your Personal Data; (iv) request a restriction on the processing of your Personal Data; (v) request Personal Data portability; or (vi) object to, or opt-out of, the processing of your Personal Data in some cases",
          "similarity_score": 0.6044
        },
        {
          "matched_policy_passage": "Moreover, as set out in locally applicable Personal Data protection laws, you may have the right to: (i) request access to your Personal Data; (ii) request rectification of your Personal Data; (iii) request the erasure of your Personal Data; (iv) request a restriction on the processing of your Personal Data; (v) request Personal Data portability; or (vi) object to, or opt-out of, the processing of your Personal Data in some cases Right of access.You may have the right to obtain from us a confirmation as to whether or not Personal Data concerning you is being processed, and, where that is the case, to request access to your Personal Data The information about Personal Data processing includes the purposes of the processing, the categories of Personal Data concerned, the recipients or categories of recipients to whom your Personal Data has been or will be disclosed, etc However, this is not an absolute right, and the interests of other individuals may restrict your right of access",
          "similarity_score": 0.7398
        },
        {
          "matched_policy_passage": "Right of access.You may have the right to obtain from us a confirmation as to whether or not Personal Data concerning you is being processed, and, where that is the case, to request access to your Personal Data The information about Personal Data processing includes the purposes of the processing, the categories of Personal Data concerned, the recipients or categories of recipients to whom your Personal Data has been or will be disclosed, etc However, this is not an absolute right, and the interests of other individuals may restrict your right of access Further, you may have the right to obtain a copy of your Personal Data undergoing processing",
          "similarity_score": 0.8133
        },
        {
          "matched_policy_passage": "The information about Personal Data processing includes the purposes of the processing, the categories of Personal Data concerned, the recipients or categories of recipients to whom your Personal Data has been or will be disclosed, etc However, this is not an absolute right, and the interests of other individuals may restrict your right of access Further, you may have the right to obtain a copy of your Personal Data undergoing processing For additional copies requested, we may charge a reasonable fee based on administrative costs",
          "similarity_score": 0.7852
        },
        {
          "matched_policy_passage": "Right to a restriction of processing.Under certain circumstances, you may have the right to require us to restrict the processing of your Personal Data In this case, the respective Personal Data will be marked and may only be processed by us for certain purposes Right to Personal Data portability.Under certain circumstances, you may have the right to receive the Personal Data that you have provided us concerning you in a structured, commonly used, and machine-readable format, and to transmit this Personal Data to another entity Right to Object.Under certain circumstances, you may have the right to object at any time, on grounds relating to the particular situation, to the processing of your Personal Data by us, and we may be required to no longer process your Personal Data",
          "similarity_score": 0.7245
        },
        {
          "matched_policy_passage": "In this case, the respective Personal Data will be marked and may only be processed by us for certain purposes Right to Personal Data portability.Under certain circumstances, you may have the right to receive the Personal Data that you have provided us concerning you in a structured, commonly used, and machine-readable format, and to transmit this Personal Data to another entity Right to Object.Under certain circumstances, you may have the right to object at any time, on grounds relating to the particular situation, to the processing of your Personal Data by us, and we may be required to no longer process your Personal Data These rights can be exercised by sending an email toprivacy@jetbrains.com",
          "similarity_score": 0.7602
        },
        {
          "matched_policy_passage": "Right to Personal Data portability.Under certain circumstances, you may have the right to receive the Personal Data that you have provided us concerning you in a structured, commonly used, and machine-readable format, and to transmit this Personal Data to another entity Right to Object.Under certain circumstances, you may have the right to object at any time, on grounds relating to the particular situation, to the processing of your Personal Data by us, and we may be required to no longer process your Personal Data These rights can be exercised by sending an email toprivacy@jetbrains.com You may also contact Jet. Brains to get up-to-date information about the processing of your Personal Data and any Personal Data recipients",
          "similarity_score": 0.7044
        },
        {
          "matched_policy_passage": "Right to Object.Under certain circumstances, you may have the right to object at any time, on grounds relating to the particular situation, to the processing of your Personal Data by us, and we may be required to no longer process your Personal Data These rights can be exercised by sending an email toprivacy@jetbrains.com You may also contact Jet. Brains to get up-to-date information about the processing of your Personal Data and any Personal Data recipients You may lodge a complaint related to the processing of your Personal Data with the competent data protection authority for the country where you are located or with the. Czech data protection authority, as we are based in that country",
          "similarity_score": 0.6429
        },
        {
          "matched_policy_passage": "Our customers respective privacy policies govern their collection and use of Customer Underlying Data Our processing of Customer Underlying Data is governed by the contracts that we have in place with our customers, not this Privacy Notice Any questions or requests relating to Customer Underlying Data should be directed to the relevant customer Categories of Personal Information Collected and Disclosed The following table describes the categories of personal information Jet. Brains collects and the categories of third parties to whom we may disclose this information for a business or commercial purpose",
          "similarity_score": 0.6359
        }
      ],
      "6.": [
        {
          "matched_policy_passage": "Right to rectification.You may have the right to obtain from us the rectification of inaccurate Personal Data Depending on the purposes of the processing, you may have the right to have incomplete Personal Data made complete, in particular by providing a supplementary statement Right to erasure (right to be forgotten).Under certain circumstances, you may have the right to require us to delete your Personal Data Right to a restriction of processing.Under certain circumstances, you may have the right to require us to restrict the processing of your Personal Data",
          "similarity_score": 0.6756
        }
      ]
    }
  },
  {
    "article_number": 30,
    "article_title": "Records of processing activities",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "The data controllers are Jet. Brains s.r.o., Praha 4, Na Hřebenech II 1718/8, PSČ 140 00, Czech Republic, and theassociated companies of Jet. Brains(collectively Jet. Brains, we, or us) Jet. Brains and itsassociated companiesact as joint data controllers, who are jointly responsible for compliance with data protection legislation is primarily responsible for exercising the rights of data subjects and providing information about data processing This Privacy Notice identifies what Personal Data we may process about you",
          "similarity_score": 0.617
        }
      ]
    }
  },
  {
    "article_number": 49,
    "article_title": "Derogations for specific situations",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "However, this is not an absolute right, and the interests of other individuals may restrict your right of access Further, you may have the right to obtain a copy of your Personal Data undergoing processing For additional copies requested, we may charge a reasonable fee based on administrative costs Right to rectification.You may have the right to obtain from us the rectification of inaccurate Personal Data",
          "similarity_score": 0.6593
        }
      ]
    }
  },
  {
    "article_number": 16,
    "article_title": "Right to rectification",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Further, you may have the right to obtain a copy of your Personal Data undergoing processing For additional copies requested, we may charge a reasonable fee based on administrative costs Right to rectification.You may have the right to obtain from us the rectification of inaccurate Personal Data Depending on the purposes of the processing, you may have the right to have incomplete Personal Data made complete, in particular by providing a supplementary statement",
          "similarity_score": 0.6677
        },
        {
          "matched_policy_passage": "For additional copies requested, we may charge a reasonable fee based on administrative costs Right to rectification.You may have the right to obtain from us the rectification of inaccurate Personal Data Depending on the purposes of the processing, you may have the right to have incomplete Personal Data made complete, in particular by providing a supplementary statement Right to erasure (right to be forgotten).Under certain circumstances, you may have the right to require us to delete your Personal Data",
          "similarity_score": 0.6301
        }
      ]
    }
  }
]