[
  {
    "article_number": 34,
    "article_title": "Communication of a personal data breach to the data subject",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "Please read the following carefully to understand our views and practices regarding your personal data and how we will treat it By visiting a Canonical website you are accepting and consenting to the practices described in this policy.For the purpose of applicable data protection legislation, the data controller is Canonical Group limited (0110334C) of 5 New Street Square, London EC4A 3TW.Our nominated representative for all data privacy matters is Mrs Katherine Ollerhead, Director of Legal, Canonical Group Limited.Privacy notices. Specific details about personal data collection can be found in the relevant privacy notice:Newsletter and products and services privacy notice Webinar privacy notice Online purchase privacy notice Snap store privacy notice Snapcraft NPS privacy notice Contact us and enquiries privacy notice Single sign on privacy notice Partner Portal privacy notice ESXi privacy notice Survey privacy notice Events privacy notice Online competitions privacy notice Confidentiality agreement privacy notice Canonical Credentials privacy notice Recruitment privacy notice Ubuntu Community Discourse Privacy Notice Canonical Support Portal Information we collect from you. Information you give us This is information about you that you give us by filling in forms on a Canonical website or by corresponding with us by phone, e-mail or otherwise When you correspond with us by phone, calls may be recorded for training and monitoring purposes",
          "similarity_score": 0.6336
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "to communicate this type of information, so we expect to keep this type of information to a minimum If you no longer wish to receive such communications from us, please follow the unsubscribe instructions provided in any of the communications, modify the communications preferences in your account or contact us using the contact details provided below.What are your rights?You have the right to consent to our processing of personal data for marketing purposes and to ask us not to process your personal data for marketing purposes We will usually inform you (before collecting your data) if we intend to use your data for such purposes or if we intend to disclose your information to any third party for such purposes You can exercise your right to prevent such processing by checking certain boxes on the forms we use to collect your data.You can also exercise the right at any time by contacting us atdataprotection@canonical.comor by using the relevantcontact usform.Under the data protection legislation, you have the following rights",
          "similarity_score": 0.6127
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We will usually inform you (before collecting your data) if we intend to use your data for such purposes or if we intend to disclose your information to any third party for such purposes You can exercise your right to prevent such processing by checking certain boxes on the forms we use to collect your data.You can also exercise the right at any time by contacting us atdataprotection@canonical.comor by using the relevantcontact usform.Under the data protection legislation, you have the following rights These consist of:The right to be informed. The right of access. The right to rectification. The right to erasure. The right to restrict processing. The right to data portability. The right to object. Rights in relation to automated decision making and profiling.Each of these rights are supported by appropriate procedures within Canonical which allow the required action to be taken within the timescales stated in the applicable data protection legislation.You can also ask us to stop using your information the simplest way to do this is to withdraw your consent, which you can do at any time, either by clicking the unsubscribe link at the end of any newsletter, or by emailing, writing or telephoning us using the contact details above.We keep your order information for so long as reasonably required in accordance with our record retention policy Your personal information associated with the order will then be removed.Our site may, from time to time, contain links to and from the websites of our partner networks, advertisers and affiliates",
          "similarity_score": 0.6528
        },
        {
          "matched_policy_passage": "The right to be informed When data is collected (if supplied by data subject) or within one month (if not supplied by data subject) The right to rectification The right to restrict processing The right to data portability On receipt of objection Rights in relation to automated decision making and profiling Our website and services use cookies to distinguish you from other users of our website and services This helps us to provide you with a good experience when you browse our website or use our services and also allows us to improve our site and services A cookie is a small file of letters and numbers that we store on your browser or the hard drive of your computer if you agree",
          "similarity_score": 0.6229
        }
      ]
    }
  },
  {
    "article_number": 17,
    "article_title": "Right to erasure (‘right to be forgotten’)",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "You can exercise your right to prevent such processing by checking certain boxes on the forms we use to collect your data.You can also exercise the right at any time by contacting us atdataprotection@canonical.comor by using the relevantcontact usform.Under the data protection legislation, you have the following rights These consist of:The right to be informed. The right of access. The right to rectification. The right to erasure. The right to restrict processing. The right to data portability. The right to object. Rights in relation to automated decision making and profiling.Each of these rights are supported by appropriate procedures within Canonical which allow the required action to be taken within the timescales stated in the applicable data protection legislation.You can also ask us to stop using your information the simplest way to do this is to withdraw your consent, which you can do at any time, either by clicking the unsubscribe link at the end of any newsletter, or by emailing, writing or telephoning us using the contact details above.We keep your order information for so long as reasonably required in accordance with our record retention policy Your personal information associated with the order will then be removed.Our site may, from time to time, contain links to and from the websites of our partner networks, advertisers and affiliates If you follow a link to any of these websites, please note that these websites have their own privacy policies and that we do not accept any responsibility or liability for these policies",
          "similarity_score": 0.689
        },
        {
          "matched_policy_passage": "These consist of:The right to be informed. The right of access. The right to rectification. The right to erasure. The right to restrict processing. The right to data portability. The right to object. Rights in relation to automated decision making and profiling.Each of these rights are supported by appropriate procedures within Canonical which allow the required action to be taken within the timescales stated in the applicable data protection legislation.You can also ask us to stop using your information the simplest way to do this is to withdraw your consent, which you can do at any time, either by clicking the unsubscribe link at the end of any newsletter, or by emailing, writing or telephoning us using the contact details above.We keep your order information for so long as reasonably required in accordance with our record retention policy Your personal information associated with the order will then be removed.Our site may, from time to time, contain links to and from the websites of our partner networks, advertisers and affiliates If you follow a link to any of these websites, please note that these websites have their own privacy policies and that we do not accept any responsibility or liability for these policies Please check these policies before you submit any personal data to these websites.These timescales are shown in Table 1.Data subject request. Timescale. The right to be informed. When data is collected (if supplied by data subject) or within one month (if not supplied by data subject)The right of access. One month. The right to rectification. One month. The right to erasure. Without undue delay. The right to restrict processing. Without undue delay. The right to data portability. One month. The right to object. On receipt of objection. Rights in relation to automated decision making and profiling.Not specified. Cookies. Our website and services use cookies to distinguish you from other users of our website and services",
          "similarity_score": 0.6933
        }
      ]
    }
  },
  {
    "article_number": 35,
    "article_title": "Data protection impact assessment",
    "matches": {
      "14.": [
        {
          "matched_policy_passage": "We have security measures, including administrative, physical and electronic measures, to protect against the loss, exposure, misuse or alteration of information that we have collected from you in the use of the services These measures include SSL data encryption to transmit your personal information as well as technical architectures and systems to prevent unauthorised third parties from accessing your personal information.How we use the information we collect. We use information held about you in the following ways:To provide you with the services you require at the time and for the reasons you provide the information, e.g newsletters and webinars.To carry out our obligations arising from any contracts entered into between you and us and to provide you with the information, products and services that you request from us.To provide you with information about other goods and services we offer that are similar to those that you have already purchased or enquired about.To provide you, or permit selected third parties to provide you, with information about goods or services we feel may interest you in accordance with your consent and our Privacy notices.To make suggestions and recommendations to you and other users of our site about goods or services that may interest you or them.We will combine this information with information you give to us and information we collect about you We will use this information and the combined information for the purposes set out above (depending on the types of information we receive).Disclosure of your information. You agree that we have the right to share your information with any member of our group, which means our subsidiaries, our ultimate holding company and its subsidiaries, as defined in section 1159 and as listedhere.We will also disclose your information to third parties:If we are under a duty to disclose or share your personal data in order to comply with any legal obligation, or in order to enforce or apply ourterms of useand other agreements; or to protect the rights, property, or safety of Canonical, our customers, or others.In accordance with Privacy notices made known at the time of collection.In the event that we sell or buy any business or assets, in which case we will disclose your personal data to the prospective seller or buyer of such business or assets.If Canonical or substantially all of its assets are acquired by a third party, in which case personal data held by it about its customers will be one of the transferred assets.Where we transfer and store your information. The information that we collect from you will be transferred to, and stored at, a destination outside the European Economic Area (\"EEA\")",
          "similarity_score": 0.6442
        },
        {
          "matched_policy_passage": "We have security measures, including administrative, physical and electronic measures, to protect against the loss, exposure, misuse or alteration of information that we have collected from you in the use of the services These measures include SSL data encryption to transmit your personal information as well as technical architectures and systems to prevent unauthorised third parties from accessing your personal information How we use the information we collect We use information held about you in the following ways: To provide you with the services you require at the time and for the reasons you provide the information, e.g newsletters and webinars",
          "similarity_score": 0.6924
        },
        {
          "matched_policy_passage": "These measures include SSL data encryption to transmit your personal information as well as technical architectures and systems to prevent unauthorised third parties from accessing your personal information How we use the information we collect We use information held about you in the following ways: To provide you with the services you require at the time and for the reasons you provide the information, e.g newsletters and webinars To carry out our obligations arising from any contracts entered into between you and us and to provide you with the information, products and services that you request from us",
          "similarity_score": 0.6168
        }
      ]
    }
  },
  {
    "article_number": 57,
    "article_title": "Tasks",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "We will use this information and the combined information for the purposes set out above (depending on the types of information we receive).Disclosure of your information. You agree that we have the right to share your information with any member of our group, which means our subsidiaries, our ultimate holding company and its subsidiaries, as defined in section 1159 and as listedhere.We will also disclose your information to third parties:If we are under a duty to disclose or share your personal data in order to comply with any legal obligation, or in order to enforce or apply ourterms of useand other agreements; or to protect the rights, property, or safety of Canonical, our customers, or others.In accordance with Privacy notices made known at the time of collection.In the event that we sell or buy any business or assets, in which case we will disclose your personal data to the prospective seller or buyer of such business or assets.If Canonical or substantially all of its assets are acquired by a third party, in which case personal data held by it about its customers will be one of the transferred assets.Where we transfer and store your information. The information that we collect from you will be transferred to, and stored at, a destination outside the European Economic Area (\"EEA\") It will also be processed by staff operating outside the EEA who work for us or for one of our suppliers This includes staff engaged by us for the provision of the services we provide you Further information can be foundhere",
          "similarity_score": 0.6305
        },
        {
          "matched_policy_passage": "To analyse the performance or the appropriateness of products or services To comply with legal and regulatory requirements (including responding to court orders, subpoenas and to prevent crime) These special circumstances may require us to disclose personal information To contact you if your actions violate your agreement with us (if any)",
          "similarity_score": 0.6689
        },
        {
          "matched_policy_passage": "To comply with legal and regulatory requirements (including responding to court orders, subpoenas and to prevent crime) These special circumstances may require us to disclose personal information To contact you if your actions violate your agreement with us (if any) To fix errors and analyse trends",
          "similarity_score": 0.6073
        },
        {
          "matched_policy_passage": "We will combine this information with information you give to us and information we collect about you We will use this information and the combined information for the purposes set out above (depending on the types of information we receive) Disclosure of your information You agree that we have the right to share your information with any member of our group, which means our subsidiaries, our ultimate holding company and its subsidiaries, as defined in section 1159 and as listedhere We will also disclose your information to third parties: If we are under a duty to disclose or share your personal data in order to comply with any legal obligation, or in order to enforce or apply ourterms of useand other agreements; or to protect the rights, property, or safety of Canonical, our customers, or others",
          "similarity_score": 0.6256
        },
        {
          "matched_policy_passage": "We will use this information and the combined information for the purposes set out above (depending on the types of information we receive) Disclosure of your information You agree that we have the right to share your information with any member of our group, which means our subsidiaries, our ultimate holding company and its subsidiaries, as defined in section 1159 and as listedhere We will also disclose your information to third parties: If we are under a duty to disclose or share your personal data in order to comply with any legal obligation, or in order to enforce or apply ourterms of useand other agreements; or to protect the rights, property, or safety of Canonical, our customers, or others In accordance with Privacy notices made known at the time of collection",
          "similarity_score": 0.6401
        }
      ]
    }
  },
  {
    "article_number": 22,
    "article_title": "Automated individual decision-making, including profiling",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "Full list of Canonical contracting entities This policy (together with ourterms of useand any other documents referred to on it) sets out the basis on which any personal data we collect from you, or that you provide to us, will be processed by us Please read the following carefully to understand our views and practices regarding your personal data and how we will treat it By visiting a Canonical website you are accepting and consenting to the practices described in this policy For the purpose of applicable data protection legislation, the data controller is Canonical Group limited (0110334C) of 5 New Street Square, London EC4A 3TW",
          "similarity_score": 0.6094
        },
        {
          "matched_policy_passage": "Please read the following carefully to understand our views and practices regarding your personal data and how we will treat it By visiting a Canonical website you are accepting and consenting to the practices described in this policy For the purpose of applicable data protection legislation, the data controller is Canonical Group limited (0110334C) of 5 New Street Square, London EC4A 3TW Our nominated representative for all data privacy matters is Mrs Katherine Ollerhead, Director of Legal, Canonical Group Limited",
          "similarity_score": 0.6053
        }
      ]
    }
  },
  {
    "article_number": 39,
    "article_title": "Tasks of the data protection officer",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "To contact you to respond to enquiries or to provide notices to you regarding your use of our websites or the provision of our services To provide services, products, process payment, and authenticate access (where required) To analyse the performance or the appropriateness of products or services To comply with legal and regulatory requirements (including responding to court orders, subpoenas and to prevent crime)",
          "similarity_score": 0.6016
        }
      ]
    }
  },
  {
    "article_number": 14,
    "article_title": "Information to be provided where personal data have not been obtained from the data subject",
    "matches": {
      "25.": [
        {
          "matched_policy_passage": "To provide services, products, process payment, and authenticate access (where required) To analyse the performance or the appropriateness of products or services To comply with legal and regulatory requirements (including responding to court orders, subpoenas and to prevent crime) These special circumstances may require us to disclose personal information",
          "similarity_score": 0.63
        }
      ]
    }
  },
  {
    "article_number": 47,
    "article_title": "Binding corporate rules",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "What are your rights? You have the right to consent to our processing of personal data for marketing purposes and to ask us not to process your personal data for marketing purposes. We will usually inform you (before collecting your data) if we intend to use your data for such purposes or if we intend to disclose your information to any third party for such purposes. You can exercise your right to prevent such processing by checking certain boxes on the forms we use to collect your data You can also exercise the right at any time by contacting us atdataprotection@canonical.comor by using the relevantcontact usform Under the data protection legislation, you have the following rights These consist of: The right to be informed The right to rectification The right to restrict processing The right to data portability Rights in relation to automated decision making and profiling",
          "similarity_score": 0.6971
        },
        {
          "matched_policy_passage": "You can also exercise the right at any time by contacting us atdataprotection@canonical.comor by using the relevantcontact usform Under the data protection legislation, you have the following rights These consist of: The right to be informed The right to rectification The right to restrict processing The right to data portability Rights in relation to automated decision making and profiling Each of these rights are supported by appropriate procedures within Canonical which allow the required action to be taken within the timescales stated in the applicable data protection legislation",
          "similarity_score": 0.6756
        },
        {
          "matched_policy_passage": "These consist of: The right to be informed The right to rectification The right to restrict processing The right to data portability Rights in relation to automated decision making and profiling Each of these rights are supported by appropriate procedures within Canonical which allow the required action to be taken within the timescales stated in the applicable data protection legislation You can also ask us to stop using your information the simplest way to do this is to withdraw your consent, which you can do at any time, either by clicking the unsubscribe link at the end of any newsletter, or by emailing, writing or telephoning us using the contact details above We keep your order information for so long as reasonably required in accordance with our record retention policy",
          "similarity_score": 0.6767
        },
        {
          "matched_policy_passage": "Please check these policies before you submit any personal data to these websites These timescales are shown in Table 1 The right to be informed When data is collected (if supplied by data subject) or within one month (if not supplied by data subject) The right to rectification The right to restrict processing The right to data portability On receipt of objection Rights in relation to automated decision making and profiling Our website and services use cookies to distinguish you from other users of our website and services",
          "similarity_score": 0.6523
        }
      ]
    }
  },
  {
    "article_number": 36,
    "article_title": "Prior consultation",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "Under the data protection legislation, you have the following rights These consist of: The right to be informed The right to rectification The right to restrict processing The right to data portability Rights in relation to automated decision making and profiling Each of these rights are supported by appropriate procedures within Canonical which allow the required action to be taken within the timescales stated in the applicable data protection legislation You can also ask us to stop using your information the simplest way to do this is to withdraw your consent, which you can do at any time, either by clicking the unsubscribe link at the end of any newsletter, or by emailing, writing or telephoning us using the contact details above",
          "similarity_score": 0.7067
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "Each of these rights are supported by appropriate procedures within Canonical which allow the required action to be taken within the timescales stated in the applicable data protection legislation You can also ask us to stop using your information the simplest way to do this is to withdraw your consent, which you can do at any time, either by clicking the unsubscribe link at the end of any newsletter, or by emailing, writing or telephoning us using the contact details above We keep your order information for so long as reasonably required in accordance with our record retention policy Your personal information associated with the order will then be removed",
          "similarity_score": 0.6173
        }
      ]
    }
  },
  {
    "article_number": 42,
    "article_title": "Certification",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "If you follow a link to any of these websites, please note that these websites have their own privacy policies and that we do not accept any responsibility or liability for these policies Please check these policies before you submit any personal data to these websites These timescales are shown in Table 1 The right to be informed When data is collected (if supplied by data subject) or within one month (if not supplied by data subject) The right to rectification The right to restrict processing The right to data portability On receipt of objection Rights in relation to automated decision making and profiling",
          "similarity_score": 0.6376
        }
      ]
    }
  },
  {
    "article_number": 13,
    "article_title": "Information to be provided where personal data are collected from the data subject",
    "matches": {
      "8.": [
        {
          "matched_policy_passage": "These timescales are shown in Table 1 The right to be informed When data is collected (if supplied by data subject) or within one month (if not supplied by data subject) The right to rectification The right to restrict processing The right to data portability On receipt of objection Rights in relation to automated decision making and profiling Our website and services use cookies to distinguish you from other users of our website and services This helps us to provide you with a good experience when you browse our website or use our services and also allows us to improve our site and services",
          "similarity_score": 0.6212
        }
      ]
    }
  },
  {
    "article_number": 23,
    "article_title": "Restrictions",
    "matches": {
      "16.": [
        {
          "matched_policy_passage": "How do we protect the information we collect Canonical is very concerned about protecting the confidentiality of your personal information We have security measures, including administrative, physical and electronic measures, to protect against the loss, exposure, misuse or alteration of information that we have collected from you in the use of the services These measures include SSL data encryption to transmit your personal information as well as technical architectures and systems to prevent unauthorised third parties from accessing your personal information How we use the information we collect We use information held about you in the following ways: To provide you with the services you require at the time and for the reasons you provide the information, e.g",
          "similarity_score": 0.6143
        },
        {
          "matched_policy_passage": "Once we have received your information, we will use strict procedures and security features to try to prevent unauthorised access Changes to our privacy policy Any changes we make to our privacy policy in the future will be posted on this page and, where appropriate, notified to you by email Please check back frequently to see any updates or changes to our privacy policy Questions, comments and requests regarding this privacy policy are welcomed and should be addressed todataprotection@canonical.comor to the address below: Legal, Canonical 4th Floor, 201 Borough High Street London SE1 1JA United Kingdom Alternatively you can use the relevantcontact usform",
          "similarity_score": 0.6074
        }
      ]
    }
  },
  {
    "article_number": 85,
    "article_title": "Processing and freedom of expression and information",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "Disclosure of your information You agree that we have the right to share your information with any member of our group, which means our subsidiaries, our ultimate holding company and its subsidiaries, as defined in section 1159 and as listedhere We will also disclose your information to third parties: If we are under a duty to disclose or share your personal data in order to comply with any legal obligation, or in order to enforce or apply ourterms of useand other agreements; or to protect the rights, property, or safety of Canonical, our customers, or others In accordance with Privacy notices made known at the time of collection In the event that we sell or buy any business or assets, in which case we will disclose your personal data to the prospective seller or buyer of such business or assets",
          "similarity_score": 0.6081
        }
      ]
    }
  },
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "12.": [
        {
          "matched_policy_passage": "In the event that we sell or buy any business or assets, in which case we will disclose your personal data to the prospective seller or buyer of such business or assets If Canonical or substantially all of its assets are acquired by a third party, in which case personal data held by it about its customers will be one of the transferred assets Where we transfer and store your information The information that we collect from you will be transferred to, and stored at, a destination outside the European Economic Area (\"EEA\") It will also be processed by staff operating outside the EEA who work for us or for one of our suppliers",
          "similarity_score": 0.6038
        }
      ]
    }
  },
  {
    "article_number": 49,
    "article_title": "Derogations for specific situations",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "This includes staff engaged by us for the provision of the services we provide you Further information can be foundhere By submitting your personal data, you agree to this transfer, storing or processing We will take all steps reasonably necessary to ensure that your data is treated securely and in accordance with this privacy policy and all applicable data protection legislation",
          "similarity_score": 0.6341
        },
        {
          "matched_policy_passage": "Further information can be foundhere By submitting your personal data, you agree to this transfer, storing or processing We will take all steps reasonably necessary to ensure that your data is treated securely and in accordance with this privacy policy and all applicable data protection legislation All information you provide to us is stored on our secure servers",
          "similarity_score": 0.6097
        },
        {
          "matched_policy_passage": "By submitting your personal data, you agree to this transfer, storing or processing We will take all steps reasonably necessary to ensure that your data is treated securely and in accordance with this privacy policy and all applicable data protection legislation All information you provide to us is stored on our secure servers Where we have given you (or where you have chosen) a password which enables you to access certain parts of our site, you are responsible for keeping this password confidential",
          "similarity_score": 0.6236
        }
      ]
    }
  }
]