[
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "12.": [
        {
          "matched_policy_passage": "Personal data we collect about you4 Our purpose for using your personal data5 Disclosing your personal data6 Transfer to other countries8",
          "similarity_score": 0.6812
        },
        {
          "matched_policy_passage": "Our purpose for using your personal data5 Disclosing your personal data6 Transfer to other countries8 Keeping your personal data safe9",
          "similarity_score": 0.6721
        },
        {
          "matched_policy_passage": "Disclosing your personal data6 Transfer to other countries8 Keeping your personal data safe9 Privacy Request Metrics11",
          "similarity_score": 0.6156
        },
        {
          "matched_policy_passage": "Personal data we collect about you 4 Our purpose for using your personal data 5 Disclosing your personal data 7 Transfer to other countries 8",
          "similarity_score": 0.6589
        },
        {
          "matched_policy_passage": "Our purpose for using your personal data 5 Disclosing your personal data 7 Transfer to other countries 8 Keeping your personal data safe 10",
          "similarity_score": 0.6483
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Transfer to other countries8 Keeping your personal data safe9 Privacy Request Metrics11 Changes to this Policy12",
          "similarity_score": 0.6333
        },
        {
          "matched_policy_passage": "On the other hand, we will remove unlawful content if the law requires us to do so Transfer to other countries. Because of the global nature of our business, Spotify transfers personal data internationally with Spotify group companies, subcontractors and partners when carrying out the activities described in this Policy.Whenever we transfer personal data internationally, we use tools to make sure the data transfer complies with applicable law.We also identify and use additional protections as appropriate for each data transfer For example, we use:technical protections, such as encryption and pseudonymizationpolicies and processes to challenge disproportionate or unlawful government authority requests8 Keeping your personal data safe. Were committed to protecting our users personal data",
          "similarity_score": 0.6314
        },
        {
          "matched_policy_passage": "Transfer to other countries. Because of the global nature of our business, Spotify transfers personal data internationally with Spotify group companies, subcontractors and partners when carrying out the activities described in this Policy.Whenever we transfer personal data internationally, we use tools to make sure the data transfer complies with applicable law.We also identify and use additional protections as appropriate for each data transfer For example, we use:technical protections, such as encryption and pseudonymizationpolicies and processes to challenge disproportionate or unlawful government authority requests8 Keeping your personal data safe. Were committed to protecting our users personal data We put in place appropriate technical and organizational measures to help protect the security of your personal data",
          "similarity_score": 0.6306
        },
        {
          "matched_policy_passage": "On the other hand, we will remove unlawful content if the law requires us to do so Transfer to other countries Because of the global nature of our business, Spotify transfers personal data internationally with Spotify group companies, subcontractors and partners when carrying out the activities described in this Policy Whenever we transfer personal data internationally, we use tools to make sure the data transfer complies with applicable law We also identify and use additional protections as appropriate for each data transfer",
          "similarity_score": 0.6165
        },
        {
          "matched_policy_passage": "Transfer to other countries Because of the global nature of our business, Spotify transfers personal data internationally with Spotify group companies, subcontractors and partners when carrying out the activities described in this Policy Whenever we transfer personal data internationally, we use tools to make sure the data transfer complies with applicable law We also identify and use additional protections as appropriate for each data transfer For example, we use: technical protections, such as encryption and pseudonymization policies and processes to challenge disproportionate or unlawful government authority requests 8",
          "similarity_score": 0.6632
        }
      ]
    }
  },
  {
    "article_number": 1,
    "article_title": "Subject-matter and objectives",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "Your personal data rights and controls. Certain U.S. states have adopted privacy laws that give certain rights to individuals over their personal data We provide these rights to all residents of the U.S., regardless of where they live.The table below explains:your rightshow to exercise them. You can also watch our video about. Your Privacy Controls You will not receive discriminatory treatment for exercising any of your privacy rights.Its your right to..How?Be informed. Be informed of the personal data we process about you and how we process it.We inform you:through this Policythrough information provided to you as you use the Spotify Serviceby answering your specific questions and requests when youcontact us. Know/Access. Request to know and access the personal data we process about you.To request a copy of your personal data from Spotify, either:use the Download your data tool on your. Account Privacypage, orcontact us. When you download your data you will receive the information about your data that Spotify has to provide under applicable laws If you would like more information about how we process your personal data, you cancontact us.Correction. Request that we amend or update your personal data where its inaccurate.You can edit your User Data under Edit profile in your account or bycontacting us.Deletion. Request that we delete certain of your personal data.Please note there are situations where Spotify is unable to delete your data, for example when:its still necessary to process the data for the purpose we collected it forwe have an overriding interest in continuing to process the data, for example where we need the data to protect our services from fraud. Spotify has a legal obligation to keep the data, or. Spotify needs the data to establish, exercise or defend legal claims",
          "similarity_score": 0.6286
        },
        {
          "matched_policy_passage": "Your personal data rights and controls Certain U.S. states have adopted privacy laws that give certain rights to individuals over their personal data We provide these rights to all residents of the U.S., regardless of where they live The table below explains: You can also watch our video about. Your Privacy Controls You will not receive discriminatory treatment for exercising any of your privacy rights",
          "similarity_score": 0.6766
        },
        {
          "matched_policy_passage": "We provide these rights to all residents of the U.S., regardless of where they live The table below explains: You can also watch our video about. Your Privacy Controls You will not receive discriminatory treatment for exercising any of your privacy rights Be informed of the personal data we process about you and how we process it",
          "similarity_score": 0.612
        }
      ]
    }
  },
  {
    "article_number": 70,
    "article_title": "Tasks of the Board",
    "matches": {
      "24.": [
        {
          "matched_policy_passage": "For example, we may be subject to legal or contractual obligations that require this These may include mandatory data retention laws, government orders to preserve data relevant to an investigation, or data kept for the purposes of litigation We may also keep data that has been removed from the Spotify Service for a limited period of time This could be:to help ensure user safety, orto protect against harmful content on our platform.This helps us investigate potential breaches of our. User Guidelinesand. Platform Rules",
          "similarity_score": 0.6403
        },
        {
          "matched_policy_passage": "These may include mandatory data retention laws, government orders to preserve data relevant to an investigation, or data kept for the purposes of litigation We may also keep data that has been removed from the Spotify Service for a limited period of time This could be:to help ensure user safety, orto protect against harmful content on our platform.This helps us investigate potential breaches of our. User Guidelinesand. Platform Rules On the other hand, we will remove unlawful content if the law requires us to do so",
          "similarity_score": 0.6209
        },
        {
          "matched_policy_passage": "These may include mandatory data retention laws, government orders to preserve data relevant to an investigation, or data kept for the purposes of litigation We may also keep data that has been removed from the Spotify Service for a limited period of time This could be: to help ensure user safety, or to protect against harmful content on our platform This helps us investigate potential breaches of our. User Guidelinesand. Platform Rules",
          "similarity_score": 0.6225
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "17.": [
        {
          "matched_policy_passage": "For example, we use:technical protections, such as encryption and pseudonymizationpolicies and processes to challenge disproportionate or unlawful government authority requests8 Keeping your personal data safe. Were committed to protecting our users personal data We put in place appropriate technical and organizational measures to help protect the security of your personal data However, be aware that no system is ever completely secure.We have put various safeguards in place to guard against unauthorized access and unnecessary retention of personal data in our systems",
          "similarity_score": 0.7671
        },
        {
          "matched_policy_passage": "For example, we use: technical protections, such as encryption and pseudonymization policies and processes to challenge disproportionate or unlawful government authority requests 8 Keeping your personal data safe Were committed to protecting our users personal data We put in place appropriate technical and organizational measures to help protect the security of your personal data However, be aware that no system is ever completely secure",
          "similarity_score": 0.7547
        },
        {
          "matched_policy_passage": "We put in place appropriate technical and organizational measures to help protect the security of your personal data However, be aware that no system is ever completely secure We have put various safeguards in place to guard against unauthorized access and unnecessary retention of personal data in our systems These include pseudonymization, encryption, access, and retention policies",
          "similarity_score": 0.7315
        }
      ]
    }
  },
  {
    "article_number": 20,
    "article_title": "Right to data portability",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "Request a copy of your personal data in electronic format and the right to transmit that personal data for use in another partys service Request a copy of your personal data in electronic format and the right to transmit that personal data for use in another partys service For information about how to exercise the right to portability, see Know/Access above For information about how to exercise the right to portability, see Know/Access above",
          "similarity_score": 0.6033
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Request a copy of your personal data in electronic format and the right to transmit that personal data for use in another partys service For information about how to exercise the right to portability, see Know/Access above For information about how to exercise the right to portability, see Know/Access above Not be subject to automated decision making Not be subject to automated decision making Not be subject to a decision based solely on automated decision making (decisions without human involvement), including profiling, where the decision would have a legal effect on you or produce a similarly significant effect",
          "similarity_score": 0.6445
        }
      ]
    }
  },
  {
    "article_number": 22,
    "article_title": "Automated individual decision-making, including profiling",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "For information about how to exercise the right to portability, see Know/Access above For information about how to exercise the right to portability, see Know/Access above Not be subject to automated decision making Not be subject to automated decision making Not be subject to a decision based solely on automated decision making (decisions without human involvement), including profiling, where the decision would have a legal effect on you or produce a similarly significant effect Not be subject to a decision based solely on automated decision making (decisions without human involvement), including profiling, where the decision would have a legal effect on you or produce a similarly significant effect",
          "similarity_score": 0.624
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "Spotify does not carry out this type of automated decision making in the Spotify Service Withdrawal of consent Withdrawal of consent Withdraw your consent to us collecting or using your personal data.You can do this if Spotify is processing your personal data solely based on your consent Withdraw your consent to us collecting or using your personal data You can do this if Spotify is processing your personal data solely based on your consent",
          "similarity_score": 0.6101
        },
        {
          "matched_policy_passage": "Withdrawal of consent Withdrawal of consent Withdraw your consent to us collecting or using your personal data.You can do this if Spotify is processing your personal data solely based on your consent Withdraw your consent to us collecting or using your personal data You can do this if Spotify is processing your personal data solely based on your consent To withdraw your consent, you can: adjust the relevant control on Spotifycontact us To withdraw your consent, you can: adjust the relevant control on Spotify Verifying requests, generally To verify a request to know, request to delete, and request to correct, we ask you to provide certain details related to your Spotify account",
          "similarity_score": 0.6313
        }
      ]
    }
  },
  {
    "article_number": 61,
    "article_title": "Mutual assistance",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "If all the members of a household make an access, correction or deletion request, we will respond as if the requests are individual requests Requests made through agents You may designate, in writing or through a power of attorney (in accordance with local law), an authorized agent to make requests on your behalf to exercise your rights Before accepting such a request from an agent, we will require the agent to provide proof you have authorized it to act on your behalf, and we may need you to verify your identity directly with us If your request is denied you may have the right to appeal the denial in accordance with the instructions provided to you when the denial was made",
          "similarity_score": 0.6194
        }
      ]
    }
  },
  {
    "article_number": 45,
    "article_title": "Transfers on the basis of an adequacy decision",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "when we use your personal data to tailor advertising to your interests, or when we send you email marketing User Data. Usage Data. Survey and Research Data Survey and Research Data To comply with a legal obligation that we are subject to.This might be: an obligation under the law of the country / region you are in Swedish law (because of our headquarters in Sweden), or EU law that applies to us. For example, when we use your date of birth when required for age verification purposes To comply with a legal obligation that we are subject to an obligation under the law of the country / region you are in Swedish law (because of our headquarters in Sweden), or EU law that applies to us For example, when we use your date of birth when required for age verification purposes User Data. Street Address Data. Usage Data. Voice Data. Payment and Purchase Data. Survey and Research Data Payment and Purchase Data Survey and Research Data To comply with a request from law enforcement, courts, or other competent authorities",
          "similarity_score": 0.6018
        },
        {
          "matched_policy_passage": "Whenever we transfer personal data internationally, we use tools to make sure the data transfer complies with applicable law We also identify and use additional protections as appropriate for each data transfer For example, we use: technical protections, such as encryption and pseudonymization policies and processes to challenge disproportionate or unlawful government authority requests 8 Keeping your personal data safe Were committed to protecting our users personal data",
          "similarity_score": 0.7169
        }
      ]
    }
  },
  {
    "article_number": 4,
    "article_title": "Definitions",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "To comply with a request from law enforcement, courts, or other competent authorities User Data. Street Address Data. Usage Data. Voice Data. Payment and Purchase Data. Survey and Research Data Payment and Purchase Data Survey and Research Data To fulfill contractual obligations with third parties.For example, when we provide pseudonymized data about our users listening because we have an agreement with a Spotify rightsholder to do so.Pseudonymized data means that your data is identified by a code rather than your name or other directly identifying information To fulfill contractual obligations with third parties For example, when we provide pseudonymized data about our users listening because we have an agreement with a Spotify rightsholder to do so",
          "similarity_score": 0.7125
        },
        {
          "matched_policy_passage": "User Data. Street Address Data. Usage Data. Voice Data. Payment and Purchase Data. Survey and Research Data Payment and Purchase Data Survey and Research Data To fulfill contractual obligations with third parties.For example, when we provide pseudonymized data about our users listening because we have an agreement with a Spotify rightsholder to do so.Pseudonymized data means that your data is identified by a code rather than your name or other directly identifying information To fulfill contractual obligations with third parties For example, when we provide pseudonymized data about our users listening because we have an agreement with a Spotify rightsholder to do so Pseudonymized data means that your data is identified by a code rather than your name or other directly identifying information",
          "similarity_score": 0.7274
        },
        {
          "matched_policy_passage": "For example, when we provide pseudonymized data about our users listening because we have an agreement with a Spotify rightsholder to do so Pseudonymized data means that your data is identified by a code rather than your name or other directly identifying information User Data. Usage Data. Voice Data. Payment and Purchase Data Payment and Purchase Data To take appropriate action with reports of intellectual property infringement and inappropriate content To take appropriate action with reports of intellectual property infringement and inappropriate content",
          "similarity_score": 0.6578
        },
        {
          "matched_policy_passage": "Pseudonymized data means that your data is identified by a code rather than your name or other directly identifying information User Data. Usage Data. Voice Data. Payment and Purchase Data Payment and Purchase Data To take appropriate action with reports of intellectual property infringement and inappropriate content To take appropriate action with reports of intellectual property infringement and inappropriate content User Data. Usage Data. Voice Data. Payment and Purchase Data Payment and Purchase Data To establish, exercise, or defend legal claims.For example, if we are involved in litigation, we need to provide information to our lawyers in relation to that legal case",
          "similarity_score": 0.6903
        }
      ]
    }
  },
  {
    "article_number": 47,
    "article_title": "Binding corporate rules",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "To fulfill contractual obligations with third parties For example, when we provide pseudonymized data about our users listening because we have an agreement with a Spotify rightsholder to do so Pseudonymized data means that your data is identified by a code rather than your name or other directly identifying information User Data. Usage Data. Voice Data. Payment and Purchase Data Payment and Purchase Data To take appropriate action with reports of intellectual property infringement and inappropriate content",
          "similarity_score": 0.627
        }
      ],
      "9.": [
        {
          "matched_policy_passage": "We also identify and use additional protections as appropriate for each data transfer For example, we use: technical protections, such as encryption and pseudonymization policies and processes to challenge disproportionate or unlawful government authority requests 8 Keeping your personal data safe Were committed to protecting our users personal data We put in place appropriate technical and organizational measures to help protect the security of your personal data",
          "similarity_score": 0.7091
        }
      ],
      "19.": [
        {
          "matched_policy_passage": "Keeping your personal data safe Were committed to protecting our users personal data We put in place appropriate technical and organizational measures to help protect the security of your personal data However, be aware that no system is ever completely secure We have put various safeguards in place to guard against unauthorized access and unnecessary retention of personal data in our systems",
          "similarity_score": 0.6402
        }
      ]
    }
  },
  {
    "article_number": 80,
    "article_title": "Representation of data subjects",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "To take appropriate action with reports of intellectual property infringement and inappropriate content User Data. Usage Data. Voice Data. Payment and Purchase Data Payment and Purchase Data To establish, exercise, or defend legal claims.For example, if we are involved in litigation, we need to provide information to our lawyers in relation to that legal case To establish, exercise, or defend legal claims For example, if we are involved in litigation, we need to provide information to our lawyers in relation to that legal case",
          "similarity_score": 0.6077
        }
      ]
    }
  },
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "Data retained for extended time periods for limited purposes After your account is deleted, we keep some data for a longer time period but for very limited purposes For example, we may be subject to legal or contractual obligations that require this These may include mandatory data retention laws, government orders to preserve data relevant to an investigation, or data kept for the purposes of litigation We may also keep data that has been removed from the Spotify Service for a limited period of time",
          "similarity_score": 0.6797
        },
        {
          "matched_policy_passage": "For example, we may be subject to legal or contractual obligations that require this These may include mandatory data retention laws, government orders to preserve data relevant to an investigation, or data kept for the purposes of litigation We may also keep data that has been removed from the Spotify Service for a limited period of time This could be: to help ensure user safety, or to protect against harmful content on our platform",
          "similarity_score": 0.6735
        }
      ]
    }
  }
]