[
  {
    "article_number": 70,
    "article_title": "Tasks of the Board",
    "matches": {
      "24.": [
        {
          "matched_policy_passage": "We have over 1 million customers and we take customer data and security extremely seriously.When you decide to outsource some or all of the hosting for the data that your organisation processes to OVHcloud, you are entrusting us with a share of your information assets We are aware of the issues that this can represent for your company, particularly when it comes to compliance with the relevant data protection regulations This is why OVHcloud is providing the most complete information possible on issues concerning the protection of personal data.Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR)",
          "similarity_score": 0.6363
        },
        {
          "matched_policy_passage": "When you decide to outsource some or all of the hosting for the data that your organisation processes to OVHcloud, you are entrusting us with a share of your information assets We are aware of the issues that this can represent for your company, particularly when it comes to compliance with the relevant data protection regulations This is why OVHcloud is providing the most complete information possible on issues concerning the protection of personal data Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels",
          "similarity_score": 0.602
        },
        {
          "matched_policy_passage": "We are aware of the issues that this can represent for your company, particularly when it comes to compliance with the relevant data protection regulations This is why OVHcloud is providing the most complete information possible on issues concerning the protection of personal data Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR)",
          "similarity_score": 0.6936
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation) Charter of Fundamental Rights of the European Union (2012/C 326/02) Convention for the protection of individuals with regard to the automatic processing of personal data OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR)",
          "similarity_score": 0.7123
        }
      ]
    }
  },
  {
    "article_number": 47,
    "article_title": "Binding corporate rules",
    "matches": {
      "9.": [
        {
          "matched_policy_passage": "We are aware of the issues that this can represent for your company, particularly when it comes to compliance with the relevant data protection regulations This is why OVHcloud is providing the most complete information possible on issues concerning the protection of personal data.Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations",
          "similarity_score": 0.7104
        },
        {
          "matched_policy_passage": "Other, more specific regulations may exist, including for certain specific categories of personal data In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data.Find out more about GDPRFind out about our security measures Personal data protection. Personal data protection. OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions. OVH, founded in 1999, is now one of the leading names in the cloud industry, with a presence in 19 countries around the world We have over 1 million customers and we take customer data and security extremely seriously.When you decide to outsource some or all of the hosting for the data that your organisation processes to OVHcloud, you are entrusting us with a share of your information assets",
          "similarity_score": 0.6257
        },
        {
          "matched_policy_passage": "We strongly advise all our customers to be particularly vigilant on these aspects of compliance Other, more specific regulations may exist, including for certain specific categories of personal data In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data.Find out more about GDPRFind out about our security measures Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection. OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions Personal data protection. OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions Personal data protection. OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions Personal data protection Personal data protection Personal data protection OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions OVHcloud and personal data protection: OVHcloud and personal data protection: GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions Our expert answers your questions Privacy Policy: OVHcloud personal data usage policy Legislative and regulatory provisions OVH, founded in 1999, is now one of the leading names in the cloud industry, with a presence in 19 countries around the world",
          "similarity_score": 0.6509
        },
        {
          "matched_policy_passage": "Other, more specific regulations may exist, including for certain specific categories of personal data In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data.Find out more about GDPRFind out about our security measures Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection Personal data protection. OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions Personal data protection. OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions Personal data protection. OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions Personal data protection Personal data protection Personal data protection OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions OVHcloud and personal data protection: OVHcloud and personal data protection: GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions Our expert answers your questions Privacy Policy: OVHcloud personal data usage policy Legislative and regulatory provisions OVH, founded in 1999, is now one of the leading names in the cloud industry, with a presence in 19 countries around the world We have over 1 million customers and we take customer data and security extremely seriously.When you decide to outsource some or all of the hosting for the data that your organisation processes to OVHcloud, you are entrusting us with a share of your information assets",
          "similarity_score": 0.653
        },
        {
          "matched_policy_passage": "Other, more specific regulations may exist, including for certain specific categories of personal data In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels",
          "similarity_score": 0.7073
        },
        {
          "matched_policy_passage": "Other, more specific regulations may exist, including for certain specific categories of personal data In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data Personal data protection regulations Personal data protection regulations Personal data protection regulations There are currently various documents covering data protection in place at the national, international, and European levels",
          "similarity_score": 0.705
        },
        {
          "matched_policy_passage": "Personal data protection regulations Personal data protection regulations Personal data protection regulations There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations We strongly advise all our customers to be particularly vigilant on these aspects of compliance",
          "similarity_score": 0.7122
        }
      ]
    }
  },
  {
    "article_number": 45,
    "article_title": "Transfers on the basis of an adequacy decision",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "This is why OVHcloud is providing the most complete information possible on issues concerning the protection of personal data.Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations We strongly advise all our customers to be particularly vigilant on these aspects of compliance",
          "similarity_score": 0.6472
        },
        {
          "matched_policy_passage": "This is why OVHcloud is providing the most complete information possible on issues concerning the protection of personal data Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations",
          "similarity_score": 0.6539
        },
        {
          "matched_policy_passage": "In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR)",
          "similarity_score": 0.7128
        },
        {
          "matched_policy_passage": "There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations We strongly advise all our customers to be particularly vigilant on these aspects of compliance",
          "similarity_score": 0.7184
        },
        {
          "matched_policy_passage": "In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following: Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679",
          "similarity_score": 0.7101
        },
        {
          "matched_policy_passage": "There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following: Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679 Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation) Charter of Fundamental Rights of the European Union (2012/C 326/02)",
          "similarity_score": 0.7138
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations We strongly advise all our customers to be particularly vigilant on these aspects of compliance",
          "similarity_score": 0.7114
        },
        {
          "matched_policy_passage": "In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR)",
          "similarity_score": 0.7284
        },
        {
          "matched_policy_passage": "In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data Personal data protection regulations Personal data protection regulations Personal data protection regulations There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR)",
          "similarity_score": 0.7192
        },
        {
          "matched_policy_passage": "Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data Personal data protection regulations Personal data protection regulations Personal data protection regulations There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations",
          "similarity_score": 0.6958
        },
        {
          "matched_policy_passage": "Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following: Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679 Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation)",
          "similarity_score": 0.6664
        }
      ]
    }
  },
  {
    "article_number": 94,
    "article_title": "Repeal of Directive 95/46/EC",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations We strongly advise all our customers to be particularly vigilant on these aspects of compliance Other, more specific regulations may exist, including for certain specific categories of personal data",
          "similarity_score": 0.7623
        },
        {
          "matched_policy_passage": "The most important ones are the following: Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679 Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation) Charter of Fundamental Rights of the European Union (2012/C 326/02) Convention for the protection of individuals with regard to the automatic processing of personal data",
          "similarity_score": 0.7505
        }
      ]
    }
  },
  {
    "article_number": 39,
    "article_title": "Tasks of the data protection officer",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations We strongly advise all our customers to be particularly vigilant on these aspects of compliance Other, more specific regulations may exist, including for certain specific categories of personal data In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them",
          "similarity_score": 0.6481
        },
        {
          "matched_policy_passage": "We strongly advise all our customers to be particularly vigilant on these aspects of compliance Other, more specific regulations may exist, including for certain specific categories of personal data In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data.Find out more about GDPRFind out about our security measures Personal data protection. Personal data protection. OVHcloud and personal data protection:GDPRSecurity measures. Our expert answers your questions. Exercise your rights. Privacy Policy: OVHcloud personal data usage policy. Cookie usage policy. Legislative and regulatory provisions. OVH, founded in 1999, is now one of the leading names in the cloud industry, with a presence in 19 countries around the world",
          "similarity_score": 0.6634
        },
        {
          "matched_policy_passage": "We strongly advise all our customers to be particularly vigilant on these aspects of compliance Other, more specific regulations may exist, including for certain specific categories of personal data In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data",
          "similarity_score": 0.71
        },
        {
          "matched_policy_passage": "Convention for the protection of individuals with regard to the automatic processing of personal data OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations We strongly advise all our customers to be particularly vigilant on these aspects of compliance",
          "similarity_score": 0.6217
        }
      ]
    }
  },
  {
    "article_number": 68,
    "article_title": "European Data Protection Board",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data Personal data protection regulations. There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations",
          "similarity_score": 0.6865
        },
        {
          "matched_policy_passage": "Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data There are currently various documents covering data protection in place at the national, international, and European levels The most important ones are the following:-Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, repealed on 25 May 2018 by Regulation (EU) 2016/679.Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation).Charter of Fundamental Rights of the European Union (2012/C 326/02).Convention for the protection of individuals with regard to the automatic processing of personal data.OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations",
          "similarity_score": 0.6735
        },
        {
          "matched_policy_passage": "Charter of Fundamental Rights of the European Union (2012/C 326/02) Convention for the protection of individuals with regard to the automatic processing of personal data OVHcloud undertakes to abide by its obligations in accordance with the aforementioned regulations, particularly the General Data Protection Regulations (GDPR) It's this commitment to compliance in particular which means that OVHcloudâs customers can also meet some of their own regulatory obligations",
          "similarity_score": 0.6225
        }
      ]
    }
  },
  {
    "article_number": 88,
    "article_title": "Processing in the context of employment",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "Other, more specific regulations may exist, including for certain specific categories of personal data In such cases, organisations are solely responsible for correctly identifying the regulations applicable to their business activities, and achieving compliance with them Choosing the right provider, especially when it comes to the cloud, is essential if you want to meet your own obligations on protecting personal data There are currently various documents covering data protection in place at the national, international, and European levels",
          "similarity_score": 0.7211
        }
      ]
    }
  }
]