[
  {
    "article_number": 85,
    "article_title": "Processing and freedom of expression and information",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "Other companies' use of cookies and other data collection technologies are subject to their own privacy policies, not this one.For Legal and Other Purposes.We may access, preserve and disclose information to investigate, prevent, or take action in connection with: (i) legal process and legal requests; (ii) enforcement of the. Terms; (iii) claims that any content violates the rights of third-parties; (iv) requests for customer service; (v) technical issues; (vi) protecting the rights, property or personal safety of Yahoo, its users or the public; (vii) establishing or exercising our legal rights or defending against legal claims; or (viii) as otherwise required by law.This may include responding to lawful governmental requests Learn more about how weevaluate and respond to these requests.New Ownership.If the ownership or control of all or part of Yahoo or a specific Services changes as a result of a merger, acquisition or sale of assets, we may transfer your information to the new owner.Details for Specific Products and Services. Additional privacy practices for certain Yahoo Services are includedhere.Information Security and Data Retention. Yahoo has technical, administrative and physical safeguards in place to help protect against unauthorized access, use or disclosure of customer information we collect or store.Yahoo will retain your personal information for as long as necessary to provide the applicable Yahoo Services to you In some cases, Yahoo has certain business or legal requirements that result in an obligation to retain your personal information for an extended period of time These obligations may include financial record keeping, ensuring continuity of our products or services, security, fraud, and abuse prevention, or compliance with our legal obligations",
          "similarity_score": 0.6156
        },
        {
          "matched_policy_passage": "Other companies' use of cookies and other data collection technologies are subject to their own privacy policies, not this one.For Legal and Other Purposes.We may access, preserve and disclose information to investigate, prevent, or take action in connection with: (i) legal process and legal requests; (ii) enforcement of the. Terms; (iii) claims that any content violates the rights of third-parties; (iv) requests for customer service; (v) technical issues; (vi) protecting the rights, property or personal safety of Yahoo, its users or the public; (vii) establishing or exercising our legal rights or defending against legal claims; or (viii) as otherwise required by law.This may include responding to lawful governmental requests Learn more about how weevaluate and respond to these requests.New Ownership.If the ownership or control of all or part of Yahoo or a specific Services changes as a result of a merger, acquisition or sale of assets, we may transfer your information to the new owner Yahoo shares information within its affiliated brands and companies We also share information we have about you for the purposes described in this Privacy Policy, including to provide Services that you have requested (including when you connect withthird-party apps and widgets)",
          "similarity_score": 0.6156
        },
        {
          "matched_policy_passage": "Other companies' use of cookies and other data collection technologies are subject to their own privacy policies, not this one For Legal and Other Purposes.We may access, preserve and disclose information to investigate, prevent, or take action in connection with: (i) legal process and legal requests; (ii) enforcement of the. Terms; (iii) claims that any content violates the rights of third-parties; (iv) requests for customer service; (v) technical issues; (vi) protecting the rights, property or personal safety of Yahoo, its users or the public; (vii) establishing or exercising our legal rights or defending against legal claims; or (viii) as otherwise required by law.This may include responding to lawful governmental requests Learn more about how weevaluate and respond to these requests For Legal and Other Purposes.We may access, preserve and disclose information to investigate, prevent, or take action in connection with: (i) legal process and legal requests; (ii) enforcement of the. Terms; (iii) claims that any content violates the rights of third-parties; (iv) requests for customer service; (v) technical issues; (vi) protecting the rights, property or personal safety of Yahoo, its users or the public; (vii) establishing or exercising our legal rights or defending against legal claims; or (viii) as otherwise required by law",
          "similarity_score": 0.6137
        }
      ]
    }
  },
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "These obligations may include financial record keeping, ensuring continuity of our products or services, security, fraud, and abuse prevention, or compliance with our legal obligations In some limited cases, we may keep data for longer than needed for the purposes set out in the. Yahoo Privacy Dashboard, such as: (i) replicating or backing up certain data to offline storage for disaster recovery purposes; (ii) truncating, redacting or summarizing raw data, log files and database records into statistical aggregate data or probabilistic data structures to understand long term trends; (iii) maintaining de-identified data for varying periods for research, reporting and product testing or development (in these cases, unique identifiers and linkages to existing data about you are broken or removed so that this data is no longer associated with you, your browser, or device); or (iv) keeping and using certain data to comply with our legal obligations, resolve disputes or enforce our agreements (for example, we might keep data associated with an account subject to litigation or a request from law enforcement) For specific information about your personal information or how your personal information is processed by a particular Yahoo product or service you may interact with, please log into the. Yahoo Privacy Dashboard.Protecting Childrens Privacy. Our Services are for a general audience We do not knowingly collect, use, or share information that could reasonably be used to identify children under age 13 without prior parental consent or consistent with applicable law",
          "similarity_score": 0.6028
        },
        {
          "matched_policy_passage": "These obligations may include financial record keeping, ensuring continuity of our products or services, security, fraud, and abuse prevention, or compliance with our legal obligations In some limited cases, we may keep data for longer than needed for the purposes set out in the. Yahoo Privacy Dashboard, such as: (i) replicating or backing up certain data to offline storage for disaster recovery purposes; (ii) truncating, redacting or summarizing raw data, log files and database records into statistical aggregate data or probabilistic data structures to understand long term trends; (iii) maintaining de-identified data for varying periods for research, reporting and product testing or development (in these cases, unique identifiers and linkages to existing data about you are broken or removed so that this data is no longer associated with you, your browser, or device); or (iv) keeping and using certain data to comply with our legal obligations, resolve disputes or enforce our agreements (for example, we might keep data associated with an account subject to litigation or a request from law enforcement) For specific information about your personal information or how your personal information is processed by a particular Yahoo product or service you may interact with, please log into the. Yahoo Privacy Dashboard Yahoo has technical, administrative and physical safeguards in place to help protect against unauthorized access, use or disclosure of customer information we collect or store",
          "similarity_score": 0.6028
        },
        {
          "matched_policy_passage": "These obligations may include financial record keeping, ensuring continuity of our products or services, security, fraud, and abuse prevention, or compliance with our legal obligations In some limited cases, we may keep data for longer than needed for the purposes set out in the. Yahoo Privacy Dashboard, such as: (i) replicating or backing up certain data to offline storage for disaster recovery purposes; (ii) truncating, redacting or summarizing raw data, log files and database records into statistical aggregate data or probabilistic data structures to understand long term trends; (iii) maintaining de-identified data for varying periods for research, reporting and product testing or development (in these cases, unique identifiers and linkages to existing data about you are broken or removed so that this data is no longer associated with you, your browser, or device); or (iv) keeping and using certain data to comply with our legal obligations, resolve disputes or enforce our agreements (for example, we might keep data associated with an account subject to litigation or a request from law enforcement) For specific information about your personal information or how your personal information is processed by a particular Yahoo product or service you may interact with, please log into the. Yahoo Privacy Dashboard Yahoo will retain your personal information for as long as necessary to provide the applicable Yahoo Services to you",
          "similarity_score": 0.6028
        },
        {
          "matched_policy_passage": "These obligations may include financial record keeping, ensuring continuity of our products or services, security, fraud, and abuse prevention, or compliance with our legal obligations In some limited cases, we may keep data for longer than needed for the purposes set out in the. Yahoo Privacy Dashboard, such as: (i) replicating or backing up certain data to offline storage for disaster recovery purposes; (ii) truncating, redacting or summarizing raw data, log files and database records into statistical aggregate data or probabilistic data structures to understand long term trends; (iii) maintaining de-identified data for varying periods for research, reporting and product testing or development (in these cases, unique identifiers and linkages to existing data about you are broken or removed so that this data is no longer associated with you, your browser, or device); or (iv) keeping and using certain data to comply with our legal obligations, resolve disputes or enforce our agreements (for example, we might keep data associated with an account subject to litigation or a request from law enforcement) For specific information about your personal information or how your personal information is processed by a particular Yahoo product or service you may interact with, please log into the. Yahoo Privacy Dashboard Protecting Childrens Privacy. Our Services are for a general audience",
          "similarity_score": 0.6028
        }
      ]
    }
  },
  {
    "article_number": 8,
    "article_title": "Conditions applicable to child's consent in relation to information society services",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We do not knowingly collect, use, or share information that could reasonably be used to identify children under age 13 without prior parental consent or consistent with applicable law With parental permission, a child under age 13 might have a Yahoo Family Account Visit. Children's Privacy & Family Accountsto learn more about childrens privacy at Yahoo.Our Legal Bases for Processing Information.We mainly rely on three separate bases to lawfully process your information First, we need to process your information in certain ways to provide our services to you, in accordance with our Terms of Service",
          "similarity_score": 0.6144
        },
        {
          "matched_policy_passage": "We do not knowingly collect, use, or share information that could reasonably be used to identify children under age 13 without prior parental consent or consistent with applicable law With parental permission, a child under age 13 might have a Yahoo Family Account Visit. Children's Privacy & Family Accountsto learn more about childrens privacy at Yahoo Our Services are for a general audience",
          "similarity_score": 0.6056
        },
        {
          "matched_policy_passage": "We do not knowingly collect, use, or share information that could reasonably be used to identify children under age 13 without prior parental consent or consistent with applicable law With parental permission, a child under age 13 might have a Yahoo Family Account Visit. Children's Privacy & Family Accountsto learn more about childrens privacy at Yahoo Our Legal Bases for Processing Information.We mainly rely on three separate bases to lawfully process your information",
          "similarity_score": 0.6108
        }
      ]
    }
  },
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "9.": [
        {
          "matched_policy_passage": "Visit. Children's Privacy & Family Accountsto learn more about childrens privacy at Yahoo.Our Legal Bases for Processing Information.We mainly rely on three separate bases to lawfully process your information First, we need to process your information in certain ways to provide our services to you, in accordance with our Terms of Service This processing is necessary to perform the contract between you and us Second, where you have given us consent to use your information in certain ways, we will rely on your consent",
          "similarity_score": 0.6078
        }
      ]
    }
  },
  {
    "article_number": 9,
    "article_title": "Processing of special categories of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "First, we need to process your information in certain ways to provide our services to you, in accordance with our Terms of Service This processing is necessary to perform the contract between you and us Second, where you have given us consent to use your information in certain ways, we will rely on your consent Third, in certain cases, we may process your information where necessary for the purposes of our legitimate interests or the legitimate interests of third parties, where those legitimate interests are not overridden by your rights or interests",
          "similarity_score": 0.6339
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "7.": [
        {
          "matched_policy_passage": "This processing is necessary to perform the contract between you and us Second, where you have given us consent to use your information in certain ways, we will rely on your consent Third, in certain cases, we may process your information where necessary for the purposes of our legitimate interests or the legitimate interests of third parties, where those legitimate interests are not overridden by your rights or interests Occasionally, Yahoo may rely on other legal bases to process your information, such as to protect a users vital interests (such as where there is a risk of imminent harm) or to comply with a legal obligation",
          "similarity_score": 0.6541
        },
        {
          "matched_policy_passage": "Second, where you have given us consent to use your information in certain ways, we will rely on your consent Third, in certain cases, we may process your information where necessary for the purposes of our legitimate interests or the legitimate interests of third parties, where those legitimate interests are not overridden by your rights or interests Occasionally, Yahoo may rely on other legal bases to process your information, such as to protect a users vital interests (such as where there is a risk of imminent harm) or to comply with a legal obligation Please see our. Legal basespage for more information.Data Processing and Transfers. When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy",
          "similarity_score": 0.6086
        },
        {
          "matched_policy_passage": "Third, in certain cases, we may process your information where necessary for the purposes of our legitimate interests or the legitimate interests of third parties, where those legitimate interests are not overridden by your rights or interests Occasionally, Yahoo may rely on other legal bases to process your information, such as to protect a users vital interests (such as where there is a risk of imminent harm) or to comply with a legal obligation Please see our. Legal basespage for more information.Data Processing and Transfers. When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services",
          "similarity_score": 0.6489
        },
        {
          "matched_policy_passage": "Third, in certain cases, we may process your information where necessary for the purposes of our legitimate interests or the legitimate interests of third parties, where those legitimate interests are not overridden by your rights or interests Occasionally, Yahoo may rely on other legal bases to process your information, such as to protect a users vital interests (such as where there is a risk of imminent harm) or to comply with a legal obligation Please see our. Legal basespage for more information Our Legal Bases for Processing Information.We mainly rely on three separate bases to lawfully process your information",
          "similarity_score": 0.6007
        },
        {
          "matched_policy_passage": "Third, in certain cases, we may process your information where necessary for the purposes of our legitimate interests or the legitimate interests of third parties, where those legitimate interests are not overridden by your rights or interests Occasionally, Yahoo may rely on other legal bases to process your information, such as to protect a users vital interests (such as where there is a risk of imminent harm) or to comply with a legal obligation Please see our. Legal basespage for more information Data Processing and Transfers. When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy",
          "similarity_score": 0.6338
        }
      ]
    }
  },
  {
    "article_number": 50,
    "article_title": "International cooperation for the protection of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "Occasionally, Yahoo may rely on other legal bases to process your information, such as to protect a users vital interests (such as where there is a risk of imminent harm) or to comply with a legal obligation Please see our. Legal basespage for more information.Data Processing and Transfers. When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside.Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF",
          "similarity_score": 0.6225
        },
        {
          "matched_policy_passage": "Please see our. Legal basespage for more information.Data Processing and Transfers. When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside.Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom",
          "similarity_score": 0.6641
        },
        {
          "matched_policy_passage": "Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside.Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom For more information, please visit our. Data Transferpage.The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information",
          "similarity_score": 0.6179
        },
        {
          "matched_policy_passage": "Occasionally, Yahoo may rely on other legal bases to process your information, such as to protect a users vital interests (such as where there is a risk of imminent harm) or to comply with a legal obligation Please see our. Legal basespage for more information Data Processing and Transfers. When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services",
          "similarity_score": 0.6238
        },
        {
          "matched_policy_passage": "Please see our. Legal basespage for more information Data Processing and Transfers. When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside.Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF",
          "similarity_score": 0.6623
        },
        {
          "matched_policy_passage": "Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services",
          "similarity_score": 0.6344
        },
        {
          "matched_policy_passage": "Some of these countries may not have the same data protection safeguards as the country where you reside When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside",
          "similarity_score": 0.6544
        },
        {
          "matched_policy_passage": "Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom",
          "similarity_score": 0.624
        },
        {
          "matched_policy_passage": "Some of these countries may not have the same data protection safeguards as the country where you reside Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom For more information, please visit our. Data Transferpage",
          "similarity_score": 0.61
        },
        {
          "matched_policy_passage": "For more information, please visit our. Data Transferpage The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information If you are based in the EU/EEA/UK, when your data is moved from your home country to a third country outside the EU/EEA/UK, some of these countries may not have the same data protection safeguards as your home country The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information",
          "similarity_score": 0.6665
        }
      ]
    }
  },
  {
    "article_number": 48,
    "article_title": "Transfers or disclosures not authorised by Union law",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom For more information, please visit our. Data Transferpage.The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information If you are based in the EU/EEA/UK, when your data is moved from your home country to a third country outside the EU/EEA/UK, some of these countries may not have the same data protection safeguards as your home country.Other Important Information. This Privacy Policy Applies Only to Yahoo.This Privacy Policy does not apply to the practices of companies that Yahoo does not own or control, or to people that Yahoo does not employ or manage In addition, some affiliated products may have different privacy policies and practices that are not subject to this Privacy Policy.Changes. We may update this Privacy Policy from time to time, so you should check it periodically",
          "similarity_score": 0.7077
        },
        {
          "matched_policy_passage": "Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom For more information, please visit our. Data Transferpage.The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information If you are based in the EU/EEA/UK, when your data is moved from your home country to a third country outside the EU/EEA/UK, some of these countries may not have the same data protection safeguards as your home country Data Processing and Transfers When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy",
          "similarity_score": 0.711
        },
        {
          "matched_policy_passage": "For more information, please visit our. Data Transferpage.The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information If you are based in the EU/EEA/UK, when your data is moved from your home country to a third country outside the EU/EEA/UK, some of these countries may not have the same data protection safeguards as your home country Data Processing and Transfers When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services",
          "similarity_score": 0.6703
        },
        {
          "matched_policy_passage": "Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom For more information, please visit our. Data Transferpage The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information If you are based in the EU/EEA/UK, when your data is moved from your home country to a third country outside the EU/EEA/UK, some of these countries may not have the same data protection safeguards as your home country",
          "similarity_score": 0.7099
        }
      ]
    }
  },
  {
    "article_number": 45,
    "article_title": "Transfers on the basis of an adequacy decision",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "For more information, please visit our. Data Transferpage.The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information If you are based in the EU/EEA/UK, when your data is moved from your home country to a third country outside the EU/EEA/UK, some of these countries may not have the same data protection safeguards as your home country.Other Important Information. This Privacy Policy Applies Only to Yahoo.This Privacy Policy does not apply to the practices of companies that Yahoo does not own or control, or to people that Yahoo does not employ or manage In addition, some affiliated products may have different privacy policies and practices that are not subject to this Privacy Policy.Changes. We may update this Privacy Policy from time to time, so you should check it periodically If we make changes that are material we will provide you with appropriate notice before such changes take effect.Questions & Suggestions. If you have questions, suggestions, or wish to make a complaint, please complete afeedback formor you can contact us at:Yahoo. Customer Care - Privacy Policy Issues770 Broadway, New York. NY 10003, USAIf you wish to contact our Data Protection Officer, you can do so by post to: Attn: Data Protection Officer, Yahoo EMEA, The EXO Building, North Wall Quay, Dublin 1, D01 W5Y2, Ireland.Our Article 27 Representative can be contacted by email at. Yahoo. GDPRrepresentative@mhc.ie, or by post at:MHC GDPR Representative. Mason Hayes and Curran Professional Services Limited. South Bank House. Barrow Street. Dublin 4Ireland. Recent Updates. May 2018 - update to privacy notice;October 2019 - Oath to Verizon Media name change;October 2020 - updates to data transfers and legal bases; and. September 2021 - updates to reflect name change; additional information added regarding data retention;September 2024 - updates to data transfers.December 2024 - updates to Information from Cookies and Other Technologies; additional information added regarding data sharing with trusted partners",
          "similarity_score": 0.6145
        },
        {
          "matched_policy_passage": "The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information If you are based in the EU/EEA/UK, when your data is moved from your home country to a third country outside the EU/EEA/UK, some of these countries may not have the same data protection safeguards as your home country The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information If you are based in the EU/EEA/UK, when your data is moved from your home country to a third country outside the EU/EEA/UK, some of these countries may not have the same data protection safeguards as your home country",
          "similarity_score": 0.6481
        }
      ]
    }
  },
  {
    "article_number": 23,
    "article_title": "Restrictions",
    "matches": {
      "16.": [
        {
          "matched_policy_passage": "For Legal and Other Purposes.We may access, preserve and disclose information to investigate, prevent, or take action in connection with: (i) legal process and legal requests; (ii) enforcement of the. Terms; (iii) claims that any content violates the rights of third-parties; (iv) requests for customer service; (v) technical issues; (vi) protecting the rights, property or personal safety of Yahoo, its users or the public; (vii) establishing or exercising our legal rights or defending against legal claims; or (viii) as otherwise required by law.This may include responding to lawful governmental requests Learn more about how weevaluate and respond to these requests For Legal and Other Purposes.We may access, preserve and disclose information to investigate, prevent, or take action in connection with: (i) legal process and legal requests; (ii) enforcement of the. Terms; (iii) claims that any content violates the rights of third-parties; (iv) requests for customer service; (v) technical issues; (vi) protecting the rights, property or personal safety of Yahoo, its users or the public; (vii) establishing or exercising our legal rights or defending against legal claims; or (viii) as otherwise required by law This may include responding to lawful governmental requests",
          "similarity_score": 0.6779
        },
        {
          "matched_policy_passage": "Learn more about how weevaluate and respond to these requests For Legal and Other Purposes.We may access, preserve and disclose information to investigate, prevent, or take action in connection with: (i) legal process and legal requests; (ii) enforcement of the. Terms; (iii) claims that any content violates the rights of third-parties; (iv) requests for customer service; (v) technical issues; (vi) protecting the rights, property or personal safety of Yahoo, its users or the public; (vii) establishing or exercising our legal rights or defending against legal claims; or (viii) as otherwise required by law This may include responding to lawful governmental requests Learn more about how weevaluate and respond to these requests",
          "similarity_score": 0.6145
        },
        {
          "matched_policy_passage": "For Legal and Other Purposes.We may access, preserve and disclose information to investigate, prevent, or take action in connection with: (i) legal process and legal requests; (ii) enforcement of the. Terms; (iii) claims that any content violates the rights of third-parties; (iv) requests for customer service; (v) technical issues; (vi) protecting the rights, property or personal safety of Yahoo, its users or the public; (vii) establishing or exercising our legal rights or defending against legal claims; or (viii) as otherwise required by law This may include responding to lawful governmental requests Learn more about how weevaluate and respond to these requests This may include responding to lawful governmental requests",
          "similarity_score": 0.6736
        }
      ]
    }
  },
  {
    "article_number": 13,
    "article_title": "Information to be provided where personal data are collected from the data subject",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "Our Legal Bases for Processing Information.We mainly rely on three separate bases to lawfully process your information First, we need to process your information in certain ways to provide our services to you, in accordance with our Terms of Service This processing is necessary to perform the contract between you and us Second, where you have given us consent to use your information in certain ways, we will rely on your consent",
          "similarity_score": 0.663
        },
        {
          "matched_policy_passage": "Please see our. Legal basespage for more information Our Legal Bases for Processing Information.We mainly rely on three separate bases to lawfully process your information First, we need to process your information in certain ways to provide our services to you, in accordance with our Terms of Service This processing is necessary to perform the contract between you and us",
          "similarity_score": 0.6409
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "Second, where you have given us consent to use your information in certain ways, we will rely on your consent Third, in certain cases, we may process your information where necessary for the purposes of our legitimate interests or the legitimate interests of third parties, where those legitimate interests are not overridden by your rights or interests Occasionally, Yahoo may rely on other legal bases to process your information, such as to protect a users vital interests (such as where there is a risk of imminent harm) or to comply with a legal obligation Please see our. Legal basespage for more information",
          "similarity_score": 0.6097
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "Data Processing and Transfers. When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside.Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom",
          "similarity_score": 0.6419
        },
        {
          "matched_policy_passage": "If you are based in the EU/EEA/UK, when your data is moved from your home country to a third country outside the EU/EEA/UK, some of these countries may not have the same data protection safeguards as your home country Data Processing and Transfers When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside",
          "similarity_score": 0.6747
        },
        {
          "matched_policy_passage": "Data Processing and Transfers When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy",
          "similarity_score": 0.6628
        },
        {
          "matched_policy_passage": "When you use or interact with any of our Services, you consent to the data processing, sharing, transferring and uses of your information as outlined in this Privacy Policy Regardless of the country where you reside, you authorize us to transfer, process, store and use your information in countries other than your own in accordance with this Privacy Policy and to provide you with Services Some of these countries may not have the same data protection safeguards as the country where you reside Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF",
          "similarity_score": 0.6679
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom For more information, please visit our. Data Transferpage Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom",
          "similarity_score": 0.6932
        },
        {
          "matched_policy_passage": "For more information, please visit our. Data Transferpage Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom For more information, please visit our. Data Transferpage",
          "similarity_score": 0.6373
        },
        {
          "matched_policy_passage": "Yahoo processes information related to individuals in the EU/EEA/UK/Switzerland and receives that information from the EU/EEA/UK/Switzerland through various compliance mechanisms, including the EU-U.S. Data Privacy Framework (DPF), the UK Extension to the DPF, and the Swiss-U.S. DPF Where appropriate, we also rely on other transfer mechanisms such as data processing agreements based on Standard Contractual Clauses adopted by the European Commission or the United Kingdom For more information, please visit our. Data Transferpage The United States and other non-EU/EEA/UK countries have different laws on data protection and rules in relation to government access to information",
          "similarity_score": 0.617
        }
      ]
    }
  }
]