[
  {
    "article_number": 57,
    "article_title": "Tasks",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "We work hard to try to make Discord a safe, positive, and inclusive place To do so, we use your information to monitor for and take action against users and content that violate our. Terms of Service,Community Guidelines, andother policies This includes responding to user reports, generating transcriptions of content as part of our investigation, detecting fraud and malware, and proactively scanning attachments and other content for illegal or harmful activity We also use certain information, which may include content reported to us, content that violates our. Terms of Service, and certain other content widely available on the service (such as public posts, usernames, avatars, banners, user profiles, server names, server icons, and server banners),to create systems and modelsthat can be automated to more swiftly detect, categorize, and take action against prohibited content or conduct.To contact you",
          "similarity_score": 0.6002
        },
        {
          "matched_policy_passage": "We work hard to try to make Discord a safe, positive, and inclusive place To do so, we use your information to monitor for and take action against users and content that violate our. Terms of Service,Community Guidelines, andother policies This includes responding to user reports, generating transcriptions of content as part of our investigation, detecting fraud and malware, and proactively scanning attachments and other content for illegal or harmful activity We also use certain information, which may include content reported to us, content that violates our. Terms of Service, and certain other content widely available on the service (such as public posts, usernames, avatars, banners, user profiles, server names, server icons, and server banners),to create systems and modelsthat can be automated to more swiftly detect, categorize, and take action against prohibited content or conduct",
          "similarity_score": 0.6002
        }
      ],
      "6.": [
        {
          "matched_policy_passage": "Where local law requires, we will obtain your consent before sending such communications To comply with our legal obligations We retain and use your information in connection with potential legal claims when necessary and for compliance, regulatory, and auditing purposes For example, we retain information where we are required by law or if we are compelled to do so by a court order or regulatory body Also, when you exercise any of your applicable legal rights to access, amend, or delete your personal information, we may request additional information from you for the purpose of confirming your identity",
          "similarity_score": 0.6276
        },
        {
          "matched_policy_passage": "To enforce our policies and rights We may disclose information if needed to enforce our. Terms of Service,Community Guidelines, any of ourother policies, or to protect the rights, property, and safety of ourselves and others With our related companies We may provide information toour related companies, including parents, affiliates, subsidiaries, and other companies under common control and ownership",
          "similarity_score": 0.641
        },
        {
          "matched_policy_passage": "We may disclose information if needed to enforce our. Terms of Service,Community Guidelines, any of ourother policies, or to protect the rights, property, and safety of ourselves and others With our related companies We may provide information toour related companies, including parents, affiliates, subsidiaries, and other companies under common control and ownership Sale, Acquisition, or Transfer of Assets",
          "similarity_score": 0.6262
        }
      ]
    }
  },
  {
    "article_number": 7,
    "article_title": "Conditions for consent",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "Where local law requires, we will obtain your consent before sending such communications.To comply with our legal obligations. We retain and use your information in connection with potential legal claims when necessary and for compliance, regulatory, and auditing purposes For example, we retain information where we are required by law or if we are compelled to do so by a court order or regulatory body Also, when you exercise any of your applicable legal rights to access, amend, or delete your personal information, we may request additional information from you for the purpose of confirming your identity.âWith your consentâWe may also collect and use personal information with your consent, such as to send you marketing communications where legally required You can revoke your consent at any time (mostly through our services directly), though note that you might not be able to use any service or feature that requires collection or use of that personal information.âTo protect someoneâs vital interests. We may collect or share personal data if we think someoneâs life is in dangerâfor example, to help resolve an urgent medical situation.How we disclose your information. When you tell us to",
          "similarity_score": 0.6411
        },
        {
          "matched_policy_passage": "For example, we retain information where we are required by law or if we are compelled to do so by a court order or regulatory body Also, when you exercise any of your applicable legal rights to access, amend, or delete your personal information, we may request additional information from you for the purpose of confirming your identity.âWith your consentâWe may also collect and use personal information with your consent, such as to send you marketing communications where legally required You can revoke your consent at any time (mostly through our services directly), though note that you might not be able to use any service or feature that requires collection or use of that personal information.âTo protect someoneâs vital interests. We may collect or share personal data if we think someoneâs life is in dangerâfor example, to help resolve an urgent medical situation.How we disclose your information. When you tell us to When you add your content to the services, you are telling us to make that content available to certain people or communities",
          "similarity_score": 0.6414
        },
        {
          "matched_policy_passage": "Where local law requires, we will obtain your consent before sending such communications.To comply with our legal obligations. We retain and use your information in connection with potential legal claims when necessary and for compliance, regulatory, and auditing purposes For example, we retain information where we are required by law or if we are compelled to do so by a court order or regulatory body Also, when you exercise any of your applicable legal rights to access, amend, or delete your personal information, we may request additional information from you for the purpose of confirming your identity.âWith your consentâWe may also collect and use personal information with your consent, such as to send you marketing communications where legally required You can revoke your consent at any time (mostly through our services directly), though note that you might not be able to use any service or feature that requires collection or use of that personal information.âTo protect someoneâs vital interests. We may collect or share personal data if we think someoneâs life is in dangerâfor example, to help resolve an urgent medical situation",
          "similarity_score": 0.6411
        },
        {
          "matched_policy_passage": "For example, we retain information where we are required by law or if we are compelled to do so by a court order or regulatory body Also, when you exercise any of your applicable legal rights to access, amend, or delete your personal information, we may request additional information from you for the purpose of confirming your identity.âWith your consentâWe may also collect and use personal information with your consent, such as to send you marketing communications where legally required You can revoke your consent at any time (mostly through our services directly), though note that you might not be able to use any service or feature that requires collection or use of that personal information.âTo protect someoneâs vital interests. We may collect or share personal data if we think someoneâs life is in dangerâfor example, to help resolve an urgent medical situation How we use your information Under certain data protection laws like GDPR, companies must have a âlegal basisââa valid reasonâto process personal information",
          "similarity_score": 0.6414
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "If you are located in certain regions, including the European Union, you may have additional rights such as those listed below, and as outlined in thestate and region specific informationand disclosures that you can exercise through the Discord app directly or by contacting us:Right of access to your personal data. Right to rectify your personal data if it is incorrect. Right to erase your personal data. Right to limit the processing of your personal data. Right to the portability of your personal data. Right to object to the processing of your personal data. Right to withdraw consent Withdrawing consent does not affect the lawfulness of processing based on consent before withdrawal.If you have any questions about these rights or wish to exercise control over your information, please reach out to privacy@discord.com.Changes to this Privacy Policy. We will update this Privacy Policy from time to time We always indicate the date the last changes were published, and if changes are significant, weâll provide a more prominent notice as required by law, such as by emailing you or highlighting the changes within the services.Contact us. Email us at privacy@discord.com with any questions about this Privacy Policy or how we process your information Weâll be happy to help.To contact Discordâs Data Protection Officer, please email dpo@discord.com.You can also reach us by mail if you want",
          "similarity_score": 0.6458
        },
        {
          "matched_policy_passage": "Withdrawing consent does not affect the lawfulness of processing based on consent before withdrawal.If you have any questions about these rights or wish to exercise control over your information, please reach out to privacy@discord.com.Changes to this Privacy Policy. We will update this Privacy Policy from time to time We always indicate the date the last changes were published, and if changes are significant, weâll provide a more prominent notice as required by law, such as by emailing you or highlighting the changes within the services.Contact us. Email us at privacy@discord.com with any questions about this Privacy Policy or how we process your information Weâll be happy to help.To contact Discordâs Data Protection Officer, please email dpo@discord.com.You can also reach us by mail if you want If you reside in the EEA or United Kingdom, you can contact us at:ÂDiscord Netherlands BVÂATTN: Privacy PolicyÂSchiphol Boulevard 1951118 BG Schiphol,Netherlands. If you reside anywhere else, you can contact us at:ÂDiscord Inc.ÂATTN: Privacy PolicyÂ444 De Haro Street #200ÂSan Francisco, CA 94107, USA.If you reside in the United Kingdom, you can also contact Vera. Safe, Discordâs appointed representative for data protection matters related to the processing of personal data, using this contact form:https://verasafe.com/public-resources/contact-data-protection-representativeor via telephone at +420 228 881 031",
          "similarity_score": 0.6504
        },
        {
          "matched_policy_passage": "If you are located in certain regions, including the European Union, you may have additional rights such as those listed below, and as outlined in thestate and region specific informationand disclosures that you can exercise through the Discord app directly or by contacting us:Right of access to your personal data. Right to rectify your personal data if it is incorrect. Right to erase your personal data. Right to limit the processing of your personal data. Right to the portability of your personal data. Right to object to the processing of your personal data. Right to withdraw consent Withdrawing consent does not affect the lawfulness of processing based on consent before withdrawal.If you have any questions about these rights or wish to exercise control over your information, please reach out to privacy@discord.com Information about local privacy laws Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it Weâve described most of that already in the earlier portions of this Policy, but you can find state and region specific information and disclosureshere",
          "similarity_score": 0.6458
        },
        {
          "matched_policy_passage": "Withdrawing consent does not affect the lawfulness of processing based on consent before withdrawal.If you have any questions about these rights or wish to exercise control over your information, please reach out to privacy@discord.com Information about local privacy laws Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it Weâve described most of that already in the earlier portions of this Policy, but you can find state and region specific information and disclosureshere âExercising your rights:As described in the âHow to control your privacyâsection above, all our users have control over their information and can directly edit or delete information from their account and limit what data we process",
          "similarity_score": 0.662
        },
        {
          "matched_policy_passage": "If you are located in certain regions, including the European Union, you may have additional rights such as those listed below, and as outlined in thestate and region specific informationand disclosures that you can exercise through the Discord app directly or by contacting us: Right of access to your personal data Right to rectify your personal data if it is incorrect Right to erase your personal data Right to limit the processing of your personal data Right to the portability of your personal data Right to object to the processing of your personal data Right to withdraw consent Withdrawing consent does not affect the lawfulness of processing based on consent before withdrawal If you have any questions about these rights or wish to exercise control over your information, please reach out to privacy@discord.com Changes to this Privacy Policy. We will update this Privacy Policy from time to time",
          "similarity_score": 0.683
        },
        {
          "matched_policy_passage": "Withdrawing consent does not affect the lawfulness of processing based on consent before withdrawal If you have any questions about these rights or wish to exercise control over your information, please reach out to privacy@discord.com Changes to this Privacy Policy. We will update this Privacy Policy from time to time We always indicate the date the last changes were published, and if changes are significant, weâll provide a more prominent notice as required by law, such as by emailing you or highlighting the changes within the services",
          "similarity_score": 0.7009
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "Also, when you exercise any of your applicable legal rights to access, amend, or delete your personal information, we may request additional information from you for the purpose of confirming your identity.âWith your consentâWe may also collect and use personal information with your consent, such as to send you marketing communications where legally required You can revoke your consent at any time (mostly through our services directly), though note that you might not be able to use any service or feature that requires collection or use of that personal information.âTo protect someoneâs vital interests. We may collect or share personal data if we think someoneâs life is in dangerâfor example, to help resolve an urgent medical situation.How we disclose your information. When you tell us to When you add your content to the services, you are telling us to make that content available to certain people or communities Who can access that information is determined by who can access a particular space",
          "similarity_score": 0.6202
        },
        {
          "matched_policy_passage": "Also, when you exercise any of your applicable legal rights to access, amend, or delete your personal information, we may request additional information from you for the purpose of confirming your identity.âWith your consentâWe may also collect and use personal information with your consent, such as to send you marketing communications where legally required You can revoke your consent at any time (mostly through our services directly), though note that you might not be able to use any service or feature that requires collection or use of that personal information.âTo protect someoneâs vital interests. We may collect or share personal data if we think someoneâs life is in dangerâfor example, to help resolve an urgent medical situation How we use your information Under certain data protection laws like GDPR, companies must have a âlegal basisââa valid reasonâto process personal information Discord relies on different legal bases to process your information for the purposes described in this Privacy Policy",
          "similarity_score": 0.6202
        },
        {
          "matched_policy_passage": "You can revoke your consent at any time (mostly through our services directly), though note that you might not be able to use any service or feature that requires collection or use of that personal information âTo protect someoneâs vital interests We may collect or share personal data if we think someoneâs life is in dangerâfor example, to help resolve an urgent medical situation How we disclose your information. When you tell us to When you add your content to the services, you are telling us to make that content available to certain people or communities",
          "similarity_score": 0.6376
        }
      ],
      "17.": [
        {
          "matched_policy_passage": "We may disclose information if we believe in good faith that it's necessary to prevent serious harm to a person To enforce our policies and rights We may disclose information if needed to enforce our. Terms of Service,Community Guidelines, any of ourother policies, or to protect the rights, property, and safety of ourselves and others With our related companies",
          "similarity_score": 0.6247
        }
      ]
    }
  },
  {
    "article_number": 9,
    "article_title": "Processing of special categories of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "You can revoke your consent at any time (mostly through our services directly), though note that you might not be able to use any service or feature that requires collection or use of that personal information.âTo protect someoneâs vital interests. We may collect or share personal data if we think someoneâs life is in dangerâfor example, to help resolve an urgent medical situation.How we disclose your information. When you tell us to When you add your content to the services, you are telling us to make that content available to certain people or communities Who can access that information is determined by who can access a particular space For servers, those permissions are set by server owners or admins",
          "similarity_score": 0.614
        },
        {
          "matched_policy_passage": "You can revoke your consent at any time (mostly through our services directly), though note that you might not be able to use any service or feature that requires collection or use of that personal information.âTo protect someoneâs vital interests. We may collect or share personal data if we think someoneâs life is in dangerâfor example, to help resolve an urgent medical situation How we use your information Under certain data protection laws like GDPR, companies must have a âlegal basisââa valid reasonâto process personal information Discord relies on different legal bases to process your information for the purposes described in this Privacy Policy We use the Information We CollectâAccount information,Content you create,Payment information,Information from actions you take,Information used to enable optional features,Other information you provide directly to us,Information about your device,Information about your use of the apps or websites,other information that we collect automatically, and. Information we receive from other sourcesâfor the following reasons and according to these legal bases",
          "similarity_score": 0.6187
        }
      ]
    }
  },
  {
    "article_number": 14,
    "article_title": "Information to be provided where personal data have not been obtained from the data subject",
    "matches": {
      "25.": [
        {
          "matched_policy_passage": "This may include information like the fact that you installed our app or registered to use Discord.To comply with the law We may disclose information in response to a request for information if we believe disclosure is required by law, including meeting national security or law enforcement requirements Where allowed and feasible, we will attempt to provide you with prior notice before disclosing your information in response to such a request Our. Transparency Reporthas additional information about how we respond to requests from governments and law enforcement entities.In an emergency",
          "similarity_score": 0.6169
        },
        {
          "matched_policy_passage": "We may disclose information in response to a request for information if we believe disclosure is required by law, including meeting national security or law enforcement requirements Where allowed and feasible, we will attempt to provide you with prior notice before disclosing your information in response to such a request Our. Transparency Reporthas additional information about how we respond to requests from governments and law enforcement entities.In an emergency We may disclose information if we believe in good faith that it's necessary to prevent serious harm to a person.To enforce our policies and rights",
          "similarity_score": 0.6468
        },
        {
          "matched_policy_passage": "To comply with the law We may disclose information in response to a request for information if we believe disclosure is required by law, including meeting national security or law enforcement requirements Where allowed and feasible, we will attempt to provide you with prior notice before disclosing your information in response to such a request Our. Transparency Reporthas additional information about how we respond to requests from governments and law enforcement entities",
          "similarity_score": 0.6459
        }
      ],
      "19.": [
        {
          "matched_policy_passage": "This may include information like the fact that you installed our app or registered to use Discord To comply with the law We may disclose information in response to a request for information if we believe disclosure is required by law, including meeting national security or law enforcement requirements Where allowed and feasible, we will attempt to provide you with prior notice before disclosing your information in response to such a request",
          "similarity_score": 0.6619
        },
        {
          "matched_policy_passage": "We may disclose information in response to a request for information if we believe disclosure is required by law, including meeting national security or law enforcement requirements Where allowed and feasible, we will attempt to provide you with prior notice before disclosing your information in response to such a request Our. Transparency Reporthas additional information about how we respond to requests from governments and law enforcement entities We may disclose information if we believe in good faith that it's necessary to prevent serious harm to a person",
          "similarity_score": 0.6532
        }
      ]
    }
  },
  {
    "article_number": 50,
    "article_title": "International cooperation for the protection of personal data",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "Where allowed and feasible, we will attempt to provide you with prior notice before disclosing your information in response to such a request Our. Transparency Reporthas additional information about how we respond to requests from governments and law enforcement entities.In an emergency We may disclose information if we believe in good faith that it's necessary to prevent serious harm to a person.To enforce our policies and rights We may disclose information if needed to enforce our. Terms of Service,Community Guidelines, any of ourother policies, or to protect the rights, property, and safety of ourselves and others.With our related companies",
          "similarity_score": 0.6241
        },
        {
          "matched_policy_passage": "Where allowed and feasible, we will attempt to provide you with prior notice before disclosing your information in response to such a request Our. Transparency Reporthas additional information about how we respond to requests from governments and law enforcement entities We may disclose information if we believe in good faith that it's necessary to prevent serious harm to a person To enforce our policies and rights",
          "similarity_score": 0.6153
        },
        {
          "matched_policy_passage": "Weâve appointed Vera. Safe as Discordâs representative in the United Kingdom for data protection matters, pursuant to Article 27 of the UK General Data Protection Regulation See the section âContact Usâ below You can contact Vera. Safe only on matters related to the processing of personal data Information about local privacy laws. Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it",
          "similarity_score": 0.6554
        },
        {
          "matched_policy_passage": "Information about local privacy laws Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it Weâve described most of that already in the earlier portions of this Policy, but you can find state and region specific information and disclosureshere âExercising your rights:As described in the âHow to control your privacyâsection above, all our users have control over their information and can directly edit or delete information from their account and limit what data we process If you are located in certain regions, including the European Union, you may have additional rights such as those listed below, and as outlined in thestate and region specific informationand disclosures that you can exercise through the Discord app directly or by contacting us: Right of access to your personal data Right to rectify your personal data if it is incorrect Right to erase your personal data Right to limit the processing of your personal data Right to the portability of your personal data Right to object to the processing of your personal data Right to withdraw consent",
          "similarity_score": 0.6327
        }
      ],
      "5.": [
        {
          "matched_policy_passage": "Also, in limited circumstances, we may have a legal obligation to retain certain information, even if you delete the information or your account.Access your information. If you want to see what information we have collected about you, you can request a copy of your data in the Privacy & Safety section of your User Settings You should receive your data packet within 30 days Data is delivered in common digital formats including CSV, JSON, and any other file format you used when uploading attachments to the services You can learn more about how to access your informationin our Help Center.International data transfers. We are based in the United States, and we process and store information on servers located in the United States",
          "similarity_score": 0.6289
        },
        {
          "matched_policy_passage": "In certain circumstances, we may be liable for the transfer of personal data from the EU, Switzerland, or the UK to a third party outside those countries If there is any conflict between the terms in our privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern.For more information about the Data Privacy Framework principles and to view our certification, please visit the U.S. Department of Commerceâs. Data Privacy Framework site.Services offered by third parties. We allow third party developers to build certain features or other services and offer them within the Discord services For example, server administrators can add âbotsâ created by third party developers that provide features like content moderation and interactive games Similarly, you may have access to games or activities built by third parties within the services.These third-party services need to follow all policies that apply to them (including often our. Developer Terms of Serviceand. Developer Policy)",
          "similarity_score": 0.6326
        },
        {
          "matched_policy_passage": "See the section âContact Usâ below You can contact Vera. Safe only on matters related to the processing of personal data.Information about local privacy laws. Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it Weâve described most of that already in the earlier portions of this Policy, but you can find state and region specific information and disclosureshere.âExercising your rights:As described in the âHow to control your privacyâsection above, all our users have control over their information and can directly edit or delete information from their account and limit what data we process If you are located in certain regions, including the European Union, you may have additional rights such as those listed below, and as outlined in thestate and region specific informationand disclosures that you can exercise through the Discord app directly or by contacting us:Right of access to your personal data. Right to rectify your personal data if it is incorrect. Right to erase your personal data. Right to limit the processing of your personal data. Right to the portability of your personal data. Right to object to the processing of your personal data. Right to withdraw consent",
          "similarity_score": 0.6394
        },
        {
          "matched_policy_passage": "You can contact Vera. Safe only on matters related to the processing of personal data.Information about local privacy laws. Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it Weâve described most of that already in the earlier portions of this Policy, but you can find state and region specific information and disclosureshere.âExercising your rights:As described in the âHow to control your privacyâsection above, all our users have control over their information and can directly edit or delete information from their account and limit what data we process If you are located in certain regions, including the European Union, you may have additional rights such as those listed below, and as outlined in thestate and region specific informationand disclosures that you can exercise through the Discord app directly or by contacting us:Right of access to your personal data. Right to rectify your personal data if it is incorrect. Right to erase your personal data. Right to limit the processing of your personal data. Right to the portability of your personal data. Right to object to the processing of your personal data. Right to withdraw consent Withdrawing consent does not affect the lawfulness of processing based on consent before withdrawal.If you have any questions about these rights or wish to exercise control over your information, please reach out to privacy@discord.com.Changes to this Privacy Policy. We will update this Privacy Policy from time to time",
          "similarity_score": 0.6508
        },
        {
          "matched_policy_passage": "In certain circumstances, we may be liable for the transfer of personal data from the EU, Switzerland, or the UK to a third party outside those countries If there is any conflict between the terms in our privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern For more information about the Data Privacy Framework principles and to view our certification, please visit the U.S. Department of Commerceâs. Data Privacy Framework site Services offered by third parties. We allow third party developers to build certain features or other services and offer them within the Discord services",
          "similarity_score": 0.6512
        },
        {
          "matched_policy_passage": "See the section âContact Usâ below You can contact Vera. Safe only on matters related to the processing of personal data Information about local privacy laws. Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it Weâve described most of that already in the earlier portions of this Policy, but you can find state and region specific information and disclosureshere.âExercising your rights:As described in the âHow to control your privacyâsection above, all our users have control over their information and can directly edit or delete information from their account and limit what data we process",
          "similarity_score": 0.6619
        },
        {
          "matched_policy_passage": "You can contact Vera. Safe only on matters related to the processing of personal data Information about local privacy laws. Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it Weâve described most of that already in the earlier portions of this Policy, but you can find state and region specific information and disclosureshere.âExercising your rights:As described in the âHow to control your privacyâsection above, all our users have control over their information and can directly edit or delete information from their account and limit what data we process If you are located in certain regions, including the European Union, you may have additional rights such as those listed below, and as outlined in thestate and region specific informationand disclosures that you can exercise through the Discord app directly or by contacting us:Right of access to your personal data. Right to rectify your personal data if it is incorrect. Right to erase your personal data. Right to limit the processing of your personal data. Right to the portability of your personal data. Right to object to the processing of your personal data. Right to withdraw consent",
          "similarity_score": 0.6579
        }
      ],
      "1.": [
        {
          "matched_policy_passage": "Itâs up to you whether to participate in a server that uses bots, and whether to engage with third-party services in general.Data Protection Officer. You can contact Discord Netherlands BVâs Data Protection Officer atdpo@discord.com.Weâve appointed Vera. Safe as Discordâs representative in the United Kingdom for data protection matters, pursuant to Article 27 of the UK General Data Protection Regulation See the section âContact Usâ below You can contact Vera. Safe only on matters related to the processing of personal data.Information about local privacy laws. Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it Weâve described most of that already in the earlier portions of this Policy, but you can find state and region specific information and disclosureshere.âExercising your rights:As described in the âHow to control your privacyâsection above, all our users have control over their information and can directly edit or delete information from their account and limit what data we process",
          "similarity_score": 0.6036
        }
      ]
    }
  },
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "We may disclose information that has been aggregated or anonymized such that it cannot reasonably be used to identify you For example, we may share aggregated user statistics in order to describe our business, features, or promotions to partners or the public.Data retention. We retain personal information until we determine it is no longer needed for the processing purposes for which we collected or retain it or for legal compliance You can learn more about data retention periods inour data retention policy.How we protect your information. We take a number of steps to help protect your information All information sent within our services is encrypted both in transit and at rest",
          "similarity_score": 0.6397
        },
        {
          "matched_policy_passage": "For example, we may share aggregated user statistics in order to describe our business, features, or promotions to partners or the public.Data retention. We retain personal information until we determine it is no longer needed for the processing purposes for which we collected or retain it or for legal compliance You can learn more about data retention periods inour data retention policy.How we protect your information. We take a number of steps to help protect your information All information sent within our services is encrypted both in transit and at rest For example, we use Transport Layer Security (âTLSâ) to encrypt text and images in transit",
          "similarity_score": 0.629
        },
        {
          "matched_policy_passage": "We may disclose information that has been aggregated or anonymized such that it cannot reasonably be used to identify you For example, we may share aggregated user statistics in order to describe our business, features, or promotions to partners or the public Data retention. We retain personal information until we determine it is no longer needed for the processing purposes for which we collected or retain it or for legal compliance You can learn more about data retention periods inour data retention policy",
          "similarity_score": 0.6663
        },
        {
          "matched_policy_passage": "For example, we may share aggregated user statistics in order to describe our business, features, or promotions to partners or the public Data retention. We retain personal information until we determine it is no longer needed for the processing purposes for which we collected or retain it or for legal compliance You can learn more about data retention periods inour data retention policy We retain personal information until we determine it is no longer needed for the processing purposes for which we collected or retain it or for legal compliance",
          "similarity_score": 0.6663
        },
        {
          "matched_policy_passage": "We retain personal information until we determine it is no longer needed for the processing purposes for which we collected or retain it or for legal compliance You can learn more about data retention periods inour data retention policy How we protect your information. We take a number of steps to help protect your information All information sent within our services is encrypted both in transit and at rest",
          "similarity_score": 0.6625
        },
        {
          "matched_policy_passage": "Content may be retained by Discord for use as described elsewhere in this policy and inour data retention policy Also, in limited circumstances, we may have a legal obligation to retain certain information, even if you delete the information or your account Access your information If you want to see what information we have collected about you, you can request a copy of your data in the Privacy & Safety section of your User Settings You should receive your data packet within 30 days",
          "similarity_score": 0.6285
        }
      ]
    }
  },
  {
    "article_number": 40,
    "article_title": "Codes of conduct",
    "matches": {
      "12.": [
        {
          "matched_policy_passage": "Data is delivered in common digital formats including CSV, JSON, and any other file format you used when uploading attachments to the services You can learn more about how to access your informationin our Help Center.International data transfers. We are based in the United States, and we process and store information on servers located in the United States We may also store information on servers and equipment in other countries depending on a variety of factors, including the locations of our users and service providers These data transfers allow us to provide our services to you",
          "similarity_score": 0.6231
        }
      ],
      "7.": [
        {
          "matched_policy_passage": "For example, we may share aggregated user statistics in order to describe our business, features, or promotions to partners or the public How we disclose your information When you tell us to When you add your content to the services, you are telling us to make that content available to certain people or communities Who can access that information is determined by who can access a particular space",
          "similarity_score": 0.6147
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "You can learn more about how to access your informationin our Help Center.International data transfers. We are based in the United States, and we process and store information on servers located in the United States We may also store information on servers and equipment in other countries depending on a variety of factors, including the locations of our users and service providers These data transfers allow us to provide our services to you By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law.When transferring data outside the EEA, we usestandard contract clauses(Module 1 and Module 2), and we rely on the European Commission'sadequacy decisionsabout certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer.Discord and its U.S. entities/subsidiaries (Backgammon Merger Sub II, LLC, Brazos Games, LLC, Discord International, Inc, Flames Sub LLC, and Sentropy Technologies Inc.) also comply with the EU-U.S. and Swiss-U.S. Data Privacy Frameworks, as well as the UK Extension to the EU-U.S. Data Privacy Framework",
          "similarity_score": 0.6309
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We may also store information on servers and equipment in other countries depending on a variety of factors, including the locations of our users and service providers These data transfers allow us to provide our services to you By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law.When transferring data outside the EEA, we usestandard contract clauses(Module 1 and Module 2), and we rely on the European Commission'sadequacy decisionsabout certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer.Discord and its U.S. entities/subsidiaries (Backgammon Merger Sub II, LLC, Brazos Games, LLC, Discord International, Inc, Flames Sub LLC, and Sentropy Technologies Inc.) also comply with the EU-U.S. and Swiss-U.S. Data Privacy Frameworks, as well as the UK Extension to the EU-U.S. Data Privacy Framework If you have questions or complaints regarding our compliance with the Data Privacy Framework principles, please reach out to us at privacy@discord.com",
          "similarity_score": 0.7034
        },
        {
          "matched_policy_passage": "These data transfers allow us to provide our services to you By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law.When transferring data outside the EEA, we usestandard contract clauses(Module 1 and Module 2), and we rely on the European Commission'sadequacy decisionsabout certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer.Discord and its U.S. entities/subsidiaries (Backgammon Merger Sub II, LLC, Brazos Games, LLC, Discord International, Inc, Flames Sub LLC, and Sentropy Technologies Inc.) also comply with the EU-U.S. and Swiss-U.S. Data Privacy Frameworks, as well as the UK Extension to the EU-U.S. Data Privacy Framework If you have questions or complaints regarding our compliance with the Data Privacy Framework principles, please reach out to us at privacy@discord.com If we do not resolve your complaint, you may submit your complaint free of charge to. JAMS",
          "similarity_score": 0.7371
        },
        {
          "matched_policy_passage": "By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law.When transferring data outside the EEA, we usestandard contract clauses(Module 1 and Module 2), and we rely on the European Commission'sadequacy decisionsabout certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer.Discord and its U.S. entities/subsidiaries (Backgammon Merger Sub II, LLC, Brazos Games, LLC, Discord International, Inc, Flames Sub LLC, and Sentropy Technologies Inc.) also comply with the EU-U.S. and Swiss-U.S. Data Privacy Frameworks, as well as the UK Extension to the EU-U.S. Data Privacy Framework If you have questions or complaints regarding our compliance with the Data Privacy Framework principles, please reach out to us at privacy@discord.com If we do not resolve your complaint, you may submit your complaint free of charge to. JAMS Under certain conditions specified by the Data Privacy Framework principles, you may also be able to invoke binding arbitration to resolve your complaint",
          "similarity_score": 0.7105
        },
        {
          "matched_policy_passage": "International data transfers. We are based in the United States, and we process and store information on servers located in the United States We may also store information on servers and equipment in other countries depending on a variety of factors, including the locations of our users and service providers These data transfers allow us to provide our services to you By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law.When transferring data outside the EEA, we usestandard contract clauses(Module 1 and Module 2), and we rely on the European Commission'sadequacy decisionsabout certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer.Discord and its U.S. entities/subsidiaries (Backgammon Merger Sub II, LLC, Brazos Games, LLC, Discord International, Inc, Flames Sub LLC, and Sentropy Technologies Inc.) also comply with the EU-U.S. and Swiss-U.S. Data Privacy Frameworks, as well as the UK Extension to the EU-U.S. Data Privacy Framework",
          "similarity_score": 0.6969
        },
        {
          "matched_policy_passage": "In certain circumstances, we may be liable for the transfer of personal data from the EU, Switzerland, or the UK to a third party outside those countries If there is any conflict between the terms in our privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern.For more information about the Data Privacy Framework principles and to view our certification, please visit the U.S. Department of Commerceâs. Data Privacy Framework site International data transfers We are based in the United States, and we process and store information on servers located in the United States We may also store information on servers and equipment in other countries depending on a variety of factors, including the locations of our users and service providers",
          "similarity_score": 0.663
        },
        {
          "matched_policy_passage": "International data transfers We are based in the United States, and we process and store information on servers located in the United States We may also store information on servers and equipment in other countries depending on a variety of factors, including the locations of our users and service providers These data transfers allow us to provide our services to you By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law",
          "similarity_score": 0.6887
        },
        {
          "matched_policy_passage": "We may also store information on servers and equipment in other countries depending on a variety of factors, including the locations of our users and service providers These data transfers allow us to provide our services to you By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law When transferring data outside the EEA, we usestandard contract clauses(Module 1 and Module 2), and we rely on the European Commission'sadequacy decisionsabout certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer",
          "similarity_score": 0.697
        },
        {
          "matched_policy_passage": "These data transfers allow us to provide our services to you By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law When transferring data outside the EEA, we usestandard contract clauses(Module 1 and Module 2), and we rely on the European Commission'sadequacy decisionsabout certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer Discord and its U.S. entities/subsidiaries (Backgammon Merger Sub II, LLC, Brazos Games, LLC, Discord International, Inc, Flames Sub LLC, and Sentropy Technologies Inc.) also comply with the EU-U.S. and Swiss-U.S. Data Privacy Frameworks, as well as the UK Extension to the EU-U.S. Data Privacy Framework",
          "similarity_score": 0.747
        },
        {
          "matched_policy_passage": "By accessing or using our services or otherwise providing information to us, you understand that your information will be processed, transferred, and stored in the U.S. and other countries, where different data protection standards may apply and/or you may not have the same rights as you do under local law When transferring data outside the EEA, we usestandard contract clauses(Module 1 and Module 2), and we rely on the European Commission'sadequacy decisionsabout certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer Discord and its U.S. entities/subsidiaries (Backgammon Merger Sub II, LLC, Brazos Games, LLC, Discord International, Inc, Flames Sub LLC, and Sentropy Technologies Inc.) also comply with the EU-U.S. and Swiss-U.S. Data Privacy Frameworks, as well as the UK Extension to the EU-U.S. Data Privacy Framework If you have questions or complaints regarding our compliance with the Data Privacy Framework principles, please reach out to us at privacy@discord.com",
          "similarity_score": 0.7138
        },
        {
          "matched_policy_passage": "When transferring data outside the EEA, we usestandard contract clauses(Module 1 and Module 2), and we rely on the European Commission'sadequacy decisionsabout certain countries, as applicable, or other legally compliant mechanisms or conditions for such data transfer Discord and its U.S. entities/subsidiaries (Backgammon Merger Sub II, LLC, Brazos Games, LLC, Discord International, Inc, Flames Sub LLC, and Sentropy Technologies Inc.) also comply with the EU-U.S. and Swiss-U.S. Data Privacy Frameworks, as well as the UK Extension to the EU-U.S. Data Privacy Framework If you have questions or complaints regarding our compliance with the Data Privacy Framework principles, please reach out to us at privacy@discord.com If we do not resolve your complaint, you may submit your complaint free of charge to. JAMS",
          "similarity_score": 0.6583
        }
      ]
    }
  },
  {
    "article_number": 48,
    "article_title": "Transfers or disclosures not authorised by Union law",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Under certain conditions specified by the Data Privacy Framework principles, you may also be able to invoke binding arbitration to resolve your complaint We are subject to the investigatory and enforcement powers of the U.S. Federal Trade Commission In certain circumstances, we may be liable for the transfer of personal data from the EU, Switzerland, or the UK to a third party outside those countries If there is any conflict between the terms in our privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern.For more information about the Data Privacy Framework principles and to view our certification, please visit the U.S. Department of Commerceâs. Data Privacy Framework site.Services offered by third parties. We allow third party developers to build certain features or other services and offer them within the Discord services",
          "similarity_score": 0.6804
        },
        {
          "matched_policy_passage": "We are subject to the investigatory and enforcement powers of the U.S. Federal Trade Commission In certain circumstances, we may be liable for the transfer of personal data from the EU, Switzerland, or the UK to a third party outside those countries If there is any conflict between the terms in our privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern.For more information about the Data Privacy Framework principles and to view our certification, please visit the U.S. Department of Commerceâs. Data Privacy Framework site.Services offered by third parties. We allow third party developers to build certain features or other services and offer them within the Discord services For example, server administrators can add âbotsâ created by third party developers that provide features like content moderation and interactive games",
          "similarity_score": 0.6675
        },
        {
          "matched_policy_passage": "Under certain conditions specified by the Data Privacy Framework principles, you may also be able to invoke binding arbitration to resolve your complaint We are subject to the investigatory and enforcement powers of the U.S. Federal Trade Commission In certain circumstances, we may be liable for the transfer of personal data from the EU, Switzerland, or the UK to a third party outside those countries If there is any conflict between the terms in our privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern.For more information about the Data Privacy Framework principles and to view our certification, please visit the U.S. Department of Commerceâs. Data Privacy Framework site",
          "similarity_score": 0.6804
        },
        {
          "matched_policy_passage": "We are subject to the investigatory and enforcement powers of the U.S. Federal Trade Commission In certain circumstances, we may be liable for the transfer of personal data from the EU, Switzerland, or the UK to a third party outside those countries If there is any conflict between the terms in our privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern.For more information about the Data Privacy Framework principles and to view our certification, please visit the U.S. Department of Commerceâs. Data Privacy Framework site International data transfers We are based in the United States, and we process and store information on servers located in the United States",
          "similarity_score": 0.6753
        },
        {
          "matched_policy_passage": "Under certain conditions specified by the Data Privacy Framework principles, you may also be able to invoke binding arbitration to resolve your complaint We are subject to the investigatory and enforcement powers of the U.S. Federal Trade Commission In certain circumstances, we may be liable for the transfer of personal data from the EU, Switzerland, or the UK to a third party outside those countries If there is any conflict between the terms in our privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern",
          "similarity_score": 0.6885
        },
        {
          "matched_policy_passage": "We are subject to the investigatory and enforcement powers of the U.S. Federal Trade Commission In certain circumstances, we may be liable for the transfer of personal data from the EU, Switzerland, or the UK to a third party outside those countries If there is any conflict between the terms in our privacy policy and the EU-U.S. DPF Principles and/or the Swiss-U.S. DPF Principles, the Principles shall govern For more information about the Data Privacy Framework principles and to view our certification, please visit the U.S. Department of Commerceâs. Data Privacy Framework site",
          "similarity_score": 0.6736
        }
      ]
    }
  },
  {
    "article_number": 86,
    "article_title": "Processing and public access to official documents",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Information we receive from other sources We may receive information about you from other sources, including from other users and third parties, and combine that information with the other information we have about you For example, if you interact with our social media account on another platform, we may receive certain information about you like your username on that platform How we use your information. Under certain data protection laws like GDPR, companies must have a âlegal basisââa valid reasonâto process personal information Discord relies on different legal bases to process your information for the purposes described in this Privacy Policy",
          "similarity_score": 0.6316
        },
        {
          "matched_policy_passage": "How we use your information. Under certain data protection laws like GDPR, companies must have a âlegal basisââa valid reasonâto process personal information Discord relies on different legal bases to process your information for the purposes described in this Privacy Policy We use the Information We CollectâAccount information,Content you create,Payment information,Information from actions you take,Information used to enable optional features,Other information you provide directly to us,Information about your device,Information about your use of the apps or websites,other information that we collect automatically, and. Information we receive from other sourcesâfor the following reasons and according to these legal bases For each reason, we describe why we process your information and how we process your information to achieve each purpose.âTo fulfill our contract with you. To provide you with the services",
          "similarity_score": 0.6185
        },
        {
          "matched_policy_passage": "How we use your information Under certain data protection laws like GDPR, companies must have a âlegal basisââa valid reasonâto process personal information Discord relies on different legal bases to process your information for the purposes described in this Privacy Policy We use the Information We CollectâAccount information,Content you create,Payment information,Information from actions you take,Information used to enable optional features,Other information you provide directly to us,Information about your device,Information about your use of the apps or websites,other information that we collect automatically, and. Information we receive from other sourcesâfor the following reasons and according to these legal bases For each reason, we describe why we process your information and how we process your information to achieve each purpose",
          "similarity_score": 0.617
        },
        {
          "matched_policy_passage": "Information about local privacy laws. Certain local laws, such as the European Unionâs General Data Protection Regulation (GDPR), Brazilâs Lei Geral de ProteÃÃo de Dados (LGPD), and Californiaâs Consumer Privacy Act (CCPA), require services to provide information about the information they collect, how they use it, and the lawful basis for processing it Weâve described most of that already in the earlier portions of this Policy, but you can find state and region specific information and disclosureshere.âExercising your rights:As described in the âHow to control your privacyâsection above, all our users have control over their information and can directly edit or delete information from their account and limit what data we process If you are located in certain regions, including the European Union, you may have additional rights such as those listed below, and as outlined in thestate and region specific informationand disclosures that you can exercise through the Discord app directly or by contacting us:Right of access to your personal data. Right to rectify your personal data if it is incorrect. Right to erase your personal data. Right to limit the processing of your personal data. Right to the portability of your personal data. Right to object to the processing of your personal data. Right to withdraw consent Withdrawing consent does not affect the lawfulness of processing based on consent before withdrawal.If you have any questions about these rights or wish to exercise control over your information, please reach out to privacy@discord.com",
          "similarity_score": 0.6387
        }
      ]
    }
  },
  {
    "article_number": 47,
    "article_title": "Binding corporate rules",
    "matches": {
      "19.": [
        {
          "matched_policy_passage": "Also, in limited circumstances, we may have a legal obligation to retain certain information, even if you delete the information or your account.Access your information. If you want to see what information we have collected about you, you can request a copy of your data in the Privacy & Safety section of your User Settings You should receive your data packet within 30 days Data is delivered in common digital formats including CSV, JSON, and any other file format you used when uploading attachments to the services You can learn more about how to access your informationin our Help Center",
          "similarity_score": 0.6181
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "âExercising your rights:As described in the âHow to control your privacyâsection above, all our users have control over their information and can directly edit or delete information from their account and limit what data we process If you are located in certain regions, including the European Union, you may have additional rights such as those listed below, and as outlined in thestate and region specific informationand disclosures that you can exercise through the Discord app directly or by contacting us: Right of access to your personal data Right to rectify your personal data if it is incorrect Right to erase your personal data Right to limit the processing of your personal data Right to the portability of your personal data Right to object to the processing of your personal data Right to withdraw consent Withdrawing consent does not affect the lawfulness of processing based on consent before withdrawal If you have any questions about these rights or wish to exercise control over your information, please reach out to privacy@discord.com",
          "similarity_score": 0.6227
        }
      ]
    }
  },
  {
    "article_number": 13,
    "article_title": "Information to be provided where personal data are collected from the data subject",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "See the section âContact Usâ below You can contact Vera. Safe only on matters related to the processing of personal data Data Protection Officer You can contact Discord Netherlands BVâs Data Protection Officer atdpo@discord.com Weâve appointed Vera. Safe as Discordâs representative in the United Kingdom for data protection matters, pursuant to Article 27 of the UK General Data Protection Regulation",
          "similarity_score": 0.6131
        },
        {
          "matched_policy_passage": "You can contact Vera. Safe only on matters related to the processing of personal data Data Protection Officer You can contact Discord Netherlands BVâs Data Protection Officer atdpo@discord.com Weâve appointed Vera. Safe as Discordâs representative in the United Kingdom for data protection matters, pursuant to Article 27 of the UK General Data Protection Regulation See the section âContact Usâ below",
          "similarity_score": 0.6209
        },
        {
          "matched_policy_passage": "Data Protection Officer You can contact Discord Netherlands BVâs Data Protection Officer atdpo@discord.com Weâve appointed Vera. Safe as Discordâs representative in the United Kingdom for data protection matters, pursuant to Article 27 of the UK General Data Protection Regulation See the section âContact Usâ below You can contact Vera. Safe only on matters related to the processing of personal data",
          "similarity_score": 0.6541
        }
      ]
    }
  }
]