[
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Otherwise, at your request, and as required by applicable law, we will:Inform you of what personal data we have about you that is under our control;Amend or correct such personal data or any previous privacy preferences you selected, or direct you toapplicable tools; and/or. Delete such personal data or direct you to applicable tools.In order to exercise any of your rights as to personal data controlled by Zoom, please clickhere Where legally permitted, we may decline to process requests that are unreasonably repetitive or systematic, require disproportionate technical effort, or jeopardize the privacy of others As an account owner or a user under a licensed account, you may also take steps to affect your personal data by visiting your account and modifying your personal data directly.Children. Zoom does not allow children under the age of 16 to sign up for a Zoom account.For educational organizations that use Zoom products and services to provide educational services to children under 18, Zooms Childrens Educational Privacy Statement is availablehere.How to Contact Us. To exercise your rights, please clickhere If you have any privacy-related questions or comments related to this Privacy Statement, please send an email toprivacy@zoom.us.You can also contact us by writing to the following address:Zoom Communications, Inc.Attention: Data Protection Officer55 Almaden Blvd, Suite 600San Jose, CA 95113Or to our representative in the EU or UK:Lionheart Squared (Europe) Limited. Attn: Data Privacy2 Pembroke House. Upper Pembroke Street 28-32Dublin. DO2 EK84Republic of lrelandemail:zoom@Lionheart. Squared.eu. Lionheart Squared Limited. Attn: Data Privacy17 Glasshouse Studios. Fryern Court Road. Fordingbridge. Hampshire. SP6 1QXUnited Kingdom. Contact:zoom@Lionheart. Squared.co.uk. You can contact our Data Protection Officer by sending an email toprivacy@zoom.us.Retention. We retain personal data for as long as required to engage in the uses described in this Privacy Statement, unless a longer retention period is required by applicable law.The criteria used to determine our retention periods include the following:The length of time we have an ongoing relationship with you and provide Zoom products and services to you (for example, for as long as you have an account with us or keep using our products);Whether account owners modify or their users delete information through their accounts;Whether we have a legal obligation to keep the data (for example, certain laws require us to keep records of your transactions for a certain period of time before we can delete them); or. Whether retention is advisable in light of our legal position (such as in regard to the enforcement of our agreements, the resolution of disputes, and applicable statutes of limitations, litigation, or regulatory investigation).European Data Protection Specific Information. Data Subjects Rights. If you are in the EEA, Switzerland, or the UK, your rights in relation to your personal data processed by us as a controller specifically include:Right of access and/or portability: You have the right to access any personal data that we hold about you and, in some circumstances, have that data provided to you so that you can provide or port that data to another provider;Right of erasure: In certain circumstances, you have the right to the erasure of personal data that we hold about you (for example, if it is no longer necessary for the purposes for which it was originally collected);Right to object to processing: In certain circumstances, you have the right to request that we stop processing your personal data and/or stop sending you marketing communications;Right to rectification: You have the right to require us to correct any inaccurate or incomplete personal data;Right to restrict processing: You have the right to request that we restrict processing of your personal data in certain circumstances (for example, where you believe that the personal data we hold about you is not accurate or lawfully held).To exercise your rights, please clickhere",
          "similarity_score": 0.6368
        }
      ],
      "7.": [
        {
          "matched_policy_passage": "This includes detecting, investigating, preventing, and stopping fraudulent, harmful, unauthorized, or illegal activity (fraud and abuse detection) and compliance with privacy laws;To protect your vital interests or those of others:We process certain personal data in order to protect vital interests for the purpose of detecting and preventing illicit activities that impact vital interests and public safety, including child sexual abuse material; and. As necessary for our (or others) legitimate interests, unless those interests are overridden by your interests or fundamental rights and freedoms, which require protection of personal data:We process your personal data based on such legitimate interests to (i) enter and perform the contract with the account owner and/or reseller providing you with the products and services (which includes billing, compliance with contractual obligations, and related administration and support); (ii) develop, test, and improve our products and services and troubleshoot products and services; (iii) ensure authentication, integrity, security, and safety of accounts, activity, and products and services, including detect and prevent malicious conduct and violations of our terms and policies, prevent or investigate bad or unsafe experiences, and address security threats; (iv) send marketing communications, advertising, and promotions related to the products and services; and (v) comply with non-EEA laws, regulations, codes of practice, guidelines, or rules applicable to us and respond to requests from, and other communications with, competent non-EEA public, governmental, judicial, or other regulatory authorities, as well as meet our corporate and social responsibility commitments, protect our rights and property and the ones of our customers, resolve disputes, and enforce agreements.International Data Transfers. Zoom operates globally, which means personal data may be transferred, stored (for example, in a data center), and processed outside of the country or region where it was initially collected where Zoom or its service providers have customers or facilities including in countries where meeting participants or account owners hosting meetings or webinars that you participate in or receiving messages that you send are based.Therefore, by using Zoom products and services or providing personal data for any of the purposes stated above, you acknowledge that your personal data may be transferred to or stored in the United States where we are established, as well as in other countries outside of the EEA, Switzerland, and the UK Such countries may have data protection rules that are different and less protective than those of your country.We protect your personal data in accordance with this Privacy Statement wherever it is processed and take appropriate contractual or other steps to protect it under applicable laws Where personal data of users in the EEA, Switzerland, or the UK is being transferred to a recipient located in a country outside the EEA, Switzerland, or the UK which has not been recognized as having an adequate level of data protection, we ensure that the transfer is governed by the European Commissions standard contractual clauses Please contact us if you would like further information in that respect.Zoom complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce",
          "similarity_score": 0.6561
        },
        {
          "matched_policy_passage": "This includes detecting, investigating, preventing, and stopping fraudulent, harmful, unauthorized, or illegal activity (fraud and abuse detection) and compliance with privacy laws; To protect your vital interests or those of others:We process certain personal data in order to protect vital interests for the purpose of detecting and preventing illicit activities that impact vital interests and public safety, including child sexual abuse material; and As necessary for our (or others) legitimate interests, unless those interests are overridden by your interests or fundamental rights and freedoms, which require protection of personal data:We process your personal data based on such legitimate interests to (i) enter and perform the contract with the account owner and/or reseller providing you with the products and services (which includes billing, compliance with contractual obligations, and related administration and support); (ii) develop, test, and improve our products and services and troubleshoot products and services; (iii) ensure authentication, integrity, security, and safety of accounts, activity, and products and services, including detect and prevent malicious conduct and violations of our terms and policies, prevent or investigate bad or unsafe experiences, and address security threats; (iv) send marketing communications, advertising, and promotions related to the products and services; and (v) comply with non-EEA laws, regulations, codes of practice, guidelines, or rules applicable to us and respond to requests from, and other communications with, competent non-EEA public, governmental, judicial, or other regulatory authorities, as well as meet our corporate and social responsibility commitments, protect our rights and property and the ones of our customers, resolve disputes, and enforce agreements International Data Transfers Zoom operates globally, which means personal data may be transferred, stored (for example, in a data center), and processed outside of the country or region where it was initially collected where Zoom or its service providers have customers or facilities including in countries where meeting participants or account owners hosting meetings or webinars that you participate in or receiving messages that you send are based Therefore, by using Zoom products and services or providing personal data for any of the purposes stated above, you acknowledge that your personal data may be transferred to or stored in the United States where we are established, as well as in other countries outside of the EEA, Switzerland, and the UK Such countries may have data protection rules that are different and less protective than those of your country",
          "similarity_score": 0.6599
        }
      ],
      "6.": [
        {
          "matched_policy_passage": "We retain personal data for as long as required to engage in the uses described in this Privacy Statement, unless a longer retention period is required by applicable law The criteria used to determine our retention periods include the following: The length of time we have an ongoing relationship with you and provide Zoom products and services to you (for example, for as long as you have an account with us or keep using our products); Whether account owners modify or their users delete information through their accounts; Whether we have a legal obligation to keep the data (for example, certain laws require us to keep records of your transactions for a certain period of time before we can delete them); or Whether retention is advisable in light of our legal position (such as in regard to the enforcement of our agreements, the resolution of disputes, and applicable statutes of limitations, litigation, or regulatory investigation) European Data Protection Specific Information If you are in the EEA, Switzerland, or the UK, your rights in relation to your personal data processed by us as a controller specifically include: Right of access and/or portability: You have the right to access any personal data that we hold about you and, in some circumstances, have that data provided to you so that you can provide or port that data to another provider; Right of erasure: In certain circumstances, you have the right to the erasure of personal data that we hold about you (for example, if it is no longer necessary for the purposes for which it was originally collected); Right to object to processing: In certain circumstances, you have the right to request that we stop processing your personal data and/or stop sending you marketing communications; Right to rectification: You have the right to require us to correct any inaccurate or incomplete personal data; Right to restrict processing: You have the right to request that we restrict processing of your personal data in certain circumstances (for example, where you believe that the personal data we hold about you is not accurate or lawfully held) To exercise your rights, please clickhere",
          "similarity_score": 0.6896
        }
      ]
    }
  },
  {
    "article_number": 38,
    "article_title": "Position of the data protection officer",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "If you have any other questions about our use of your personal data, please send a request at the contact details specified in the. How to Contact Ussection of this Privacy Statement Please note that we may request you to provide us with additional information in order to confirm your identity and ensure that you are entitled to access the relevant personal data.You also have the right to lodge a complaint to a data protection authority For more information, please contact your local data protection authority.Legal Basis for Processing Personal Data. We only use your information in a lawful, transparent, and fair manner Depending on the specific personal data concerned and the factual context, when Zoom processes personal data as a controller for individuals in regions such as the EEA, Switzerland, and the UK, we rely on the following legal bases as applicable in your jurisdiction:As necessary for our contract:When we enter into a contract directly with you, we process your personal data on the basis of our contract in order to prepare and enter into the contract, as well as to perform and manage our contract (i.e., providing Zoom products and services, features and services to account owners, their users, and those they invite to join meetings and webinars hosted on their accounts, and manage our relationship and contract, including billing, compliance with contractual obligations, and related administration)",
          "similarity_score": 0.6347
        },
        {
          "matched_policy_passage": "To exercise your rights, please clickhere If you have any other questions about our use of your personal data, please send a request at the contact details specified in the. How to Contact Ussection of this Privacy Statement Please note that we may request you to provide us with additional information in order to confirm your identity and ensure that you are entitled to access the relevant personal data You also have the right to lodge a complaint to a data protection authority",
          "similarity_score": 0.636
        }
      ]
    }
  },
  {
    "article_number": 45,
    "article_title": "Transfers on the basis of an adequacy decision",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "Please note that we may request you to provide us with additional information in order to confirm your identity and ensure that you are entitled to access the relevant personal data.You also have the right to lodge a complaint to a data protection authority For more information, please contact your local data protection authority.Legal Basis for Processing Personal Data. We only use your information in a lawful, transparent, and fair manner Depending on the specific personal data concerned and the factual context, when Zoom processes personal data as a controller for individuals in regions such as the EEA, Switzerland, and the UK, we rely on the following legal bases as applicable in your jurisdiction:As necessary for our contract:When we enter into a contract directly with you, we process your personal data on the basis of our contract in order to prepare and enter into the contract, as well as to perform and manage our contract (i.e., providing Zoom products and services, features and services to account owners, their users, and those they invite to join meetings and webinars hosted on their accounts, and manage our relationship and contract, including billing, compliance with contractual obligations, and related administration) If we do not process your personal data for these purposes, we may not be able to provide you with all products and services;Consistent with specific revocable consents:We rely on your prior consent in order to utilize cookies to engage advertising and analytics partners to deliver tailored advertising and analysis of our website usage",
          "similarity_score": 0.7145
        },
        {
          "matched_policy_passage": "For more information, please contact your local data protection authority.Legal Basis for Processing Personal Data. We only use your information in a lawful, transparent, and fair manner Depending on the specific personal data concerned and the factual context, when Zoom processes personal data as a controller for individuals in regions such as the EEA, Switzerland, and the UK, we rely on the following legal bases as applicable in your jurisdiction:As necessary for our contract:When we enter into a contract directly with you, we process your personal data on the basis of our contract in order to prepare and enter into the contract, as well as to perform and manage our contract (i.e., providing Zoom products and services, features and services to account owners, their users, and those they invite to join meetings and webinars hosted on their accounts, and manage our relationship and contract, including billing, compliance with contractual obligations, and related administration) If we do not process your personal data for these purposes, we may not be able to provide you with all products and services;Consistent with specific revocable consents:We rely on your prior consent in order to utilize cookies to engage advertising and analytics partners to deliver tailored advertising and analysis of our website usage You have the right to withdraw your consent at any time by visiting our cookie management tool, available in Cookies Settings;As necessary to comply with our legal obligations:We process your personal data to comply with the legal obligations to which we are subject for the purposes of compliance with EEA laws, regulations, codes of practice, guidelines, or rules applicable to us, and for responses to requests from, and other communications with, competent EEA public, governmental, judicial, or other regulatory authorities",
          "similarity_score": 0.6933
        }
      ]
    }
  },
  {
    "article_number": 22,
    "article_title": "Automated individual decision-making, including profiling",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "Depending on the specific personal data concerned and the factual context, when Zoom processes personal data as a controller for individuals in regions such as the EEA, Switzerland, and the UK, we rely on the following legal bases as applicable in your jurisdiction:As necessary for our contract:When we enter into a contract directly with you, we process your personal data on the basis of our contract in order to prepare and enter into the contract, as well as to perform and manage our contract (i.e., providing Zoom products and services, features and services to account owners, their users, and those they invite to join meetings and webinars hosted on their accounts, and manage our relationship and contract, including billing, compliance with contractual obligations, and related administration) If we do not process your personal data for these purposes, we may not be able to provide you with all products and services;Consistent with specific revocable consents:We rely on your prior consent in order to utilize cookies to engage advertising and analytics partners to deliver tailored advertising and analysis of our website usage You have the right to withdraw your consent at any time by visiting our cookie management tool, available in Cookies Settings;As necessary to comply with our legal obligations:We process your personal data to comply with the legal obligations to which we are subject for the purposes of compliance with EEA laws, regulations, codes of practice, guidelines, or rules applicable to us, and for responses to requests from, and other communications with, competent EEA public, governmental, judicial, or other regulatory authorities This includes detecting, investigating, preventing, and stopping fraudulent, harmful, unauthorized, or illegal activity (fraud and abuse detection) and compliance with privacy laws;To protect your vital interests or those of others:We process certain personal data in order to protect vital interests for the purpose of detecting and preventing illicit activities that impact vital interests and public safety, including child sexual abuse material; and. As necessary for our (or others) legitimate interests, unless those interests are overridden by your interests or fundamental rights and freedoms, which require protection of personal data:We process your personal data based on such legitimate interests to (i) enter and perform the contract with the account owner and/or reseller providing you with the products and services (which includes billing, compliance with contractual obligations, and related administration and support); (ii) develop, test, and improve our products and services and troubleshoot products and services; (iii) ensure authentication, integrity, security, and safety of accounts, activity, and products and services, including detect and prevent malicious conduct and violations of our terms and policies, prevent or investigate bad or unsafe experiences, and address security threats; (iv) send marketing communications, advertising, and promotions related to the products and services; and (v) comply with non-EEA laws, regulations, codes of practice, guidelines, or rules applicable to us and respond to requests from, and other communications with, competent non-EEA public, governmental, judicial, or other regulatory authorities, as well as meet our corporate and social responsibility commitments, protect our rights and property and the ones of our customers, resolve disputes, and enforce agreements.International Data Transfers. Zoom operates globally, which means personal data may be transferred, stored (for example, in a data center), and processed outside of the country or region where it was initially collected where Zoom or its service providers have customers or facilities including in countries where meeting participants or account owners hosting meetings or webinars that you participate in or receiving messages that you send are based.Therefore, by using Zoom products and services or providing personal data for any of the purposes stated above, you acknowledge that your personal data may be transferred to or stored in the United States where we are established, as well as in other countries outside of the EEA, Switzerland, and the UK",
          "similarity_score": 0.6306
        },
        {
          "matched_policy_passage": "Depending on the specific personal data concerned and the factual context, when Zoom processes personal data as a controller for individuals in regions such as the EEA, Switzerland, and the UK, we rely on the following legal bases as applicable in your jurisdiction: As necessary for our contract:When we enter into a contract directly with you, we process your personal data on the basis of our contract in order to prepare and enter into the contract, as well as to perform and manage our contract (i.e., providing Zoom products and services, features and services to account owners, their users, and those they invite to join meetings and webinars hosted on their accounts, and manage our relationship and contract, including billing, compliance with contractual obligations, and related administration) If we do not process your personal data for these purposes, we may not be able to provide you with all products and services; Consistent with specific revocable consents:We rely on your prior consent in order to utilize cookies to engage advertising and analytics partners to deliver tailored advertising and analysis of our website usage You have the right to withdraw your consent at any time by visiting our cookie management tool, available in Cookies Settings; As necessary to comply with our legal obligations:We process your personal data to comply with the legal obligations to which we are subject for the purposes of compliance with EEA laws, regulations, codes of practice, guidelines, or rules applicable to us, and for responses to requests from, and other communications with, competent EEA public, governmental, judicial, or other regulatory authorities This includes detecting, investigating, preventing, and stopping fraudulent, harmful, unauthorized, or illegal activity (fraud and abuse detection) and compliance with privacy laws; To protect your vital interests or those of others:We process certain personal data in order to protect vital interests for the purpose of detecting and preventing illicit activities that impact vital interests and public safety, including child sexual abuse material; and As necessary for our (or others) legitimate interests, unless those interests are overridden by your interests or fundamental rights and freedoms, which require protection of personal data:We process your personal data based on such legitimate interests to (i) enter and perform the contract with the account owner and/or reseller providing you with the products and services (which includes billing, compliance with contractual obligations, and related administration and support); (ii) develop, test, and improve our products and services and troubleshoot products and services; (iii) ensure authentication, integrity, security, and safety of accounts, activity, and products and services, including detect and prevent malicious conduct and violations of our terms and policies, prevent or investigate bad or unsafe experiences, and address security threats; (iv) send marketing communications, advertising, and promotions related to the products and services; and (v) comply with non-EEA laws, regulations, codes of practice, guidelines, or rules applicable to us and respond to requests from, and other communications with, competent non-EEA public, governmental, judicial, or other regulatory authorities, as well as meet our corporate and social responsibility commitments, protect our rights and property and the ones of our customers, resolve disputes, and enforce agreements",
          "similarity_score": 0.6306
        }
      ]
    }
  },
  {
    "article_number": 47,
    "article_title": "Binding corporate rules",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "You have the right to withdraw your consent at any time by visiting our cookie management tool, available in Cookies Settings;As necessary to comply with our legal obligations:We process your personal data to comply with the legal obligations to which we are subject for the purposes of compliance with EEA laws, regulations, codes of practice, guidelines, or rules applicable to us, and for responses to requests from, and other communications with, competent EEA public, governmental, judicial, or other regulatory authorities This includes detecting, investigating, preventing, and stopping fraudulent, harmful, unauthorized, or illegal activity (fraud and abuse detection) and compliance with privacy laws;To protect your vital interests or those of others:We process certain personal data in order to protect vital interests for the purpose of detecting and preventing illicit activities that impact vital interests and public safety, including child sexual abuse material; and. As necessary for our (or others) legitimate interests, unless those interests are overridden by your interests or fundamental rights and freedoms, which require protection of personal data:We process your personal data based on such legitimate interests to (i) enter and perform the contract with the account owner and/or reseller providing you with the products and services (which includes billing, compliance with contractual obligations, and related administration and support); (ii) develop, test, and improve our products and services and troubleshoot products and services; (iii) ensure authentication, integrity, security, and safety of accounts, activity, and products and services, including detect and prevent malicious conduct and violations of our terms and policies, prevent or investigate bad or unsafe experiences, and address security threats; (iv) send marketing communications, advertising, and promotions related to the products and services; and (v) comply with non-EEA laws, regulations, codes of practice, guidelines, or rules applicable to us and respond to requests from, and other communications with, competent non-EEA public, governmental, judicial, or other regulatory authorities, as well as meet our corporate and social responsibility commitments, protect our rights and property and the ones of our customers, resolve disputes, and enforce agreements.International Data Transfers. Zoom operates globally, which means personal data may be transferred, stored (for example, in a data center), and processed outside of the country or region where it was initially collected where Zoom or its service providers have customers or facilities including in countries where meeting participants or account owners hosting meetings or webinars that you participate in or receiving messages that you send are based.Therefore, by using Zoom products and services or providing personal data for any of the purposes stated above, you acknowledge that your personal data may be transferred to or stored in the United States where we are established, as well as in other countries outside of the EEA, Switzerland, and the UK Such countries may have data protection rules that are different and less protective than those of your country.We protect your personal data in accordance with this Privacy Statement wherever it is processed and take appropriate contractual or other steps to protect it under applicable laws Where personal data of users in the EEA, Switzerland, or the UK is being transferred to a recipient located in a country outside the EEA, Switzerland, or the UK which has not been recognized as having an adequate level of data protection, we ensure that the transfer is governed by the European Commissions standard contractual clauses",
          "similarity_score": 0.6047
        },
        {
          "matched_policy_passage": "You have the right to withdraw your consent at any time by visiting our cookie management tool, available in Cookies Settings; As necessary to comply with our legal obligations:We process your personal data to comply with the legal obligations to which we are subject for the purposes of compliance with EEA laws, regulations, codes of practice, guidelines, or rules applicable to us, and for responses to requests from, and other communications with, competent EEA public, governmental, judicial, or other regulatory authorities This includes detecting, investigating, preventing, and stopping fraudulent, harmful, unauthorized, or illegal activity (fraud and abuse detection) and compliance with privacy laws; To protect your vital interests or those of others:We process certain personal data in order to protect vital interests for the purpose of detecting and preventing illicit activities that impact vital interests and public safety, including child sexual abuse material; and As necessary for our (or others) legitimate interests, unless those interests are overridden by your interests or fundamental rights and freedoms, which require protection of personal data:We process your personal data based on such legitimate interests to (i) enter and perform the contract with the account owner and/or reseller providing you with the products and services (which includes billing, compliance with contractual obligations, and related administration and support); (ii) develop, test, and improve our products and services and troubleshoot products and services; (iii) ensure authentication, integrity, security, and safety of accounts, activity, and products and services, including detect and prevent malicious conduct and violations of our terms and policies, prevent or investigate bad or unsafe experiences, and address security threats; (iv) send marketing communications, advertising, and promotions related to the products and services; and (v) comply with non-EEA laws, regulations, codes of practice, guidelines, or rules applicable to us and respond to requests from, and other communications with, competent non-EEA public, governmental, judicial, or other regulatory authorities, as well as meet our corporate and social responsibility commitments, protect our rights and property and the ones of our customers, resolve disputes, and enforce agreements International Data Transfers Zoom operates globally, which means personal data may be transferred, stored (for example, in a data center), and processed outside of the country or region where it was initially collected where Zoom or its service providers have customers or facilities including in countries where meeting participants or account owners hosting meetings or webinars that you participate in or receiving messages that you send are based Therefore, by using Zoom products and services or providing personal data for any of the purposes stated above, you acknowledge that your personal data may be transferred to or stored in the United States where we are established, as well as in other countries outside of the EEA, Switzerland, and the UK",
          "similarity_score": 0.6047
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "European Data Protection Specific Information If you are in the EEA, Switzerland, or the UK, your rights in relation to your personal data processed by us as a controller specifically include: Right of access and/or portability: You have the right to access any personal data that we hold about you and, in some circumstances, have that data provided to you so that you can provide or port that data to another provider; Right of erasure: In certain circumstances, you have the right to the erasure of personal data that we hold about you (for example, if it is no longer necessary for the purposes for which it was originally collected); Right to object to processing: In certain circumstances, you have the right to request that we stop processing your personal data and/or stop sending you marketing communications; Right to rectification: You have the right to require us to correct any inaccurate or incomplete personal data; Right to restrict processing: You have the right to request that we restrict processing of your personal data in certain circumstances (for example, where you believe that the personal data we hold about you is not accurate or lawfully held) To exercise your rights, please clickhere If you have any other questions about our use of your personal data, please send a request at the contact details specified in the. How to Contact Ussection of this Privacy Statement Please note that we may request you to provide us with additional information in order to confirm your identity and ensure that you are entitled to access the relevant personal data",
          "similarity_score": 0.6755
        }
      ]
    }
  },
  {
    "article_number": 50,
    "article_title": "International cooperation for the protection of personal data",
    "matches": {
      "5.": [
        {
          "matched_policy_passage": "Such countries may have data protection rules that are different and less protective than those of your country.We protect your personal data in accordance with this Privacy Statement wherever it is processed and take appropriate contractual or other steps to protect it under applicable laws Where personal data of users in the EEA, Switzerland, or the UK is being transferred to a recipient located in a country outside the EEA, Switzerland, or the UK which has not been recognized as having an adequate level of data protection, we ensure that the transfer is governed by the European Commissions standard contractual clauses Please contact us if you would like further information in that respect.Zoom complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce Zoom has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles (EU-U.S. DPF Principles) with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF and from the United Kingdom (and Gibraltar) in reliance on the UK Extension to the EU-U.S. DPF",
          "similarity_score": 0.7167
        },
        {
          "matched_policy_passage": "Such countries may have data protection rules that are different and less protective than those of your country We protect your personal data in accordance with this Privacy Statement wherever it is processed and take appropriate contractual or other steps to protect it under applicable laws Where personal data of users in the EEA, Switzerland, or the UK is being transferred to a recipient located in a country outside the EEA, Switzerland, or the UK which has not been recognized as having an adequate level of data protection, we ensure that the transfer is governed by the European Commissions standard contractual clauses Please contact us if you would like further information in that respect",
          "similarity_score": 0.7165
        }
      ],
      "3.": [
        {
          "matched_policy_passage": "Please note that we may request you to provide us with additional information in order to confirm your identity and ensure that you are entitled to access the relevant personal data You also have the right to lodge a complaint to a data protection authority For more information, please contact your local data protection authority Legal Basis for Processing Personal Data We only use your information in a lawful, transparent, and fair manner",
          "similarity_score": 0.7027
        }
      ]
    }
  },
  {
    "article_number": 44,
    "article_title": "General principle for transfers",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Where personal data of users in the EEA, Switzerland, or the UK is being transferred to a recipient located in a country outside the EEA, Switzerland, or the UK which has not been recognized as having an adequate level of data protection, we ensure that the transfer is governed by the European Commissions standard contractual clauses Please contact us if you would like further information in that respect.Zoom complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce Zoom has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles (EU-U.S. DPF Principles) with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF and from the United Kingdom (and Gibraltar) in reliance on the UK Extension to the EU-U.S. DPF Zoom has certified to the U.S. Department of Commerce that it adheres to the Swiss-U.S. Data Privacy Framework Principles (Swiss-U.S. DPF Principles) with regard to the processing of personal data received from Switzerland in reliance on the Swiss-U.S. DPF",
          "similarity_score": 0.6175
        },
        {
          "matched_policy_passage": "International Data Transfers Zoom operates globally, which means personal data may be transferred, stored (for example, in a data center), and processed outside of the country or region where it was initially collected where Zoom or its service providers have customers or facilities including in countries where meeting participants or account owners hosting meetings or webinars that you participate in or receiving messages that you send are based Therefore, by using Zoom products and services or providing personal data for any of the purposes stated above, you acknowledge that your personal data may be transferred to or stored in the United States where we are established, as well as in other countries outside of the EEA, Switzerland, and the UK Such countries may have data protection rules that are different and less protective than those of your country We protect your personal data in accordance with this Privacy Statement wherever it is processed and take appropriate contractual or other steps to protect it under applicable laws",
          "similarity_score": 0.6201
        },
        {
          "matched_policy_passage": "We protect your personal data in accordance with this Privacy Statement wherever it is processed and take appropriate contractual or other steps to protect it under applicable laws Where personal data of users in the EEA, Switzerland, or the UK is being transferred to a recipient located in a country outside the EEA, Switzerland, or the UK which has not been recognized as having an adequate level of data protection, we ensure that the transfer is governed by the European Commissions standard contractual clauses Please contact us if you would like further information in that respect Zoom complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce",
          "similarity_score": 0.6391
        },
        {
          "matched_policy_passage": "Where personal data of users in the EEA, Switzerland, or the UK is being transferred to a recipient located in a country outside the EEA, Switzerland, or the UK which has not been recognized as having an adequate level of data protection, we ensure that the transfer is governed by the European Commissions standard contractual clauses Please contact us if you would like further information in that respect Zoom complies with the EU-U.S. Data Privacy Framework (EU-U.S. DPF), the UK Extension to the EU-U.S. DPF, and the Swiss-U.S. Data Privacy Framework (Swiss-U.S. DPF) as set forth by the U.S. Department of Commerce Zoom has certified to the U.S. Department of Commerce that it adheres to the EU-U.S. Data Privacy Framework Principles (EU-U.S. DPF Principles) with regard to the processing of personal data received from the European Union in reliance on the EU-U.S. DPF and from the United Kingdom (and Gibraltar) in reliance on the UK Extension to the EU-U.S. DPF",
          "similarity_score": 0.6156
        }
      ]
    }
  },
  {
    "article_number": 57,
    "article_title": "Tasks",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "Otherwise, at your request, and as required by applicable law, we will: European Economic Area (EEA), Switzerland, or the UK California or another U.S. state Inform you of what personal data we have about you that is under our control; Amend or correct such personal data or any previous privacy preferences you selected, or direct you toapplicable tools; and/or Delete such personal data or direct you to applicable tools In order to exercise any of your rights as to personal data controlled by Zoom, please clickhere Where legally permitted, we may decline to process requests that are unreasonably repetitive or systematic, require disproportionate technical effort, or jeopardize the privacy of others As an account owner or a user under a licensed account, you may also take steps to affect your personal data by visiting your account and modifying your personal data directly",
          "similarity_score": 0.6062
        }
      ]
    }
  },
  {
    "article_number": 77,
    "article_title": "Right to lodge a complaint with a supervisory authority",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "You also have the right to lodge a complaint to a data protection authority For more information, please contact your local data protection authority Legal Basis for Processing Personal Data We only use your information in a lawful, transparent, and fair manner Depending on the specific personal data concerned and the factual context, when Zoom processes personal data as a controller for individuals in regions such as the EEA, Switzerland, and the UK, we rely on the following legal bases as applicable in your jurisdiction: As necessary for our contract:When we enter into a contract directly with you, we process your personal data on the basis of our contract in order to prepare and enter into the contract, as well as to perform and manage our contract (i.e., providing Zoom products and services, features and services to account owners, their users, and those they invite to join meetings and webinars hosted on their accounts, and manage our relationship and contract, including billing, compliance with contractual obligations, and related administration)",
          "similarity_score": 0.7029
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "12.": [
        {
          "matched_policy_passage": "For more information, please contact your local data protection authority Legal Basis for Processing Personal Data We only use your information in a lawful, transparent, and fair manner Depending on the specific personal data concerned and the factual context, when Zoom processes personal data as a controller for individuals in regions such as the EEA, Switzerland, and the UK, we rely on the following legal bases as applicable in your jurisdiction: As necessary for our contract:When we enter into a contract directly with you, we process your personal data on the basis of our contract in order to prepare and enter into the contract, as well as to perform and manage our contract (i.e., providing Zoom products and services, features and services to account owners, their users, and those they invite to join meetings and webinars hosted on their accounts, and manage our relationship and contract, including billing, compliance with contractual obligations, and related administration) If we do not process your personal data for these purposes, we may not be able to provide you with all products and services; Consistent with specific revocable consents:We rely on your prior consent in order to utilize cookies to engage advertising and analytics partners to deliver tailored advertising and analysis of our website usage",
          "similarity_score": 0.6724
        },
        {
          "matched_policy_passage": "Legal Basis for Processing Personal Data We only use your information in a lawful, transparent, and fair manner Depending on the specific personal data concerned and the factual context, when Zoom processes personal data as a controller for individuals in regions such as the EEA, Switzerland, and the UK, we rely on the following legal bases as applicable in your jurisdiction: As necessary for our contract:When we enter into a contract directly with you, we process your personal data on the basis of our contract in order to prepare and enter into the contract, as well as to perform and manage our contract (i.e., providing Zoom products and services, features and services to account owners, their users, and those they invite to join meetings and webinars hosted on their accounts, and manage our relationship and contract, including billing, compliance with contractual obligations, and related administration) If we do not process your personal data for these purposes, we may not be able to provide you with all products and services; Consistent with specific revocable consents:We rely on your prior consent in order to utilize cookies to engage advertising and analytics partners to deliver tailored advertising and analysis of our website usage You have the right to withdraw your consent at any time by visiting our cookie management tool, available in Cookies Settings; As necessary to comply with our legal obligations:We process your personal data to comply with the legal obligations to which we are subject for the purposes of compliance with EEA laws, regulations, codes of practice, guidelines, or rules applicable to us, and for responses to requests from, and other communications with, competent EEA public, governmental, judicial, or other regulatory authorities",
          "similarity_score": 0.669
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "10.": [
        {
          "matched_policy_passage": "Therefore, by using Zoom products and services or providing personal data for any of the purposes stated above, you acknowledge that your personal data may be transferred to or stored in the United States where we are established, as well as in other countries outside of the EEA, Switzerland, and the UK Such countries may have data protection rules that are different and less protective than those of your country We protect your personal data in accordance with this Privacy Statement wherever it is processed and take appropriate contractual or other steps to protect it under applicable laws Where personal data of users in the EEA, Switzerland, or the UK is being transferred to a recipient located in a country outside the EEA, Switzerland, or the UK which has not been recognized as having an adequate level of data protection, we ensure that the transfer is governed by the European Commissions standard contractual clauses",
          "similarity_score": 0.6811
        }
      ]
    }
  }
]