[
  {
    "article_number": 23,
    "article_title": "Restrictions",
    "matches": {
      "18.": [
        {
          "matched_policy_passage": "The user requested the service, and the risk of the processing of the data is minimal.Indefinite (Protocol Labs)Your feedback. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years.Browser testing and research (Nightly, Dev, and Beta versions only)Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the Browser. Device model, i. OS version, language, timezone, CPU architecture, carrier, connection status Optional: Crash log (crash logs will also be sent if you opted-in when activating i. OS) Optional: Comments and screenshots you share if you send feedback through Test. Flight.Our interest in testing the product and fixing problems",
          "similarity_score": 0.6397
        },
        {
          "matched_policy_passage": "Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To make and verify Basic Attention Token contributions, (including to detect and prevent fraud).IP address at time of claiming a grant of BAT tokens or requesting confirmation tokens.Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Generally stored for 7 days In cases of suspected fraud, stored for up to 60 days In case of confirmed fraud, stored for up to 2 years.To make and verify Basic Attention Token contributions, (including to detect and prevent fraud).Rewards Payment ID, declared country code and Custodian ID and custodial country code when verifying a Brave Rewards wallet with a custodial partner.Necessary for the performance of acontract between us, (and necessary to provide the requested service & to provide customer support).Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements.To make and verify Basic Attention Token contributions to a Solana address, (including to detect and prevent fraud).Rewards Payment ID and associated Solana address. Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Compliance with legal obligations. The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements Purpose of processing Categories of personal data processed Legal basis of processing To make and verify Basic Attention Token contributions, (including to detect and prevent fraud)",
          "similarity_score": 0.6238
        },
        {
          "matched_policy_passage": "Compliance with legal obligations The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements Brave News. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To collect content from the server in order to display it for the user.IP addresses.Legitimate interest The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To collect content from the server in order to display it for the user.IP addresses.Legitimate interest The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processing Categories of personal data processed Legal basis of processing To collect content from the server in order to display it for the user",
          "similarity_score": 0.6229
        },
        {
          "matched_policy_passage": "Brave News. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To collect content from the server in order to display it for the user.IP addresses.Legitimate interest The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To collect content from the server in order to display it for the user.IP addresses.Legitimate interest The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processing Categories of personal data processed Legal basis of processing To collect content from the server in order to display it for the user The data are used in order to deliver the service, and the risk of the processing of the data is minimal",
          "similarity_score": 0.6434
        },
        {
          "matched_policy_passage": "The user requested the service, and the risk of the processing of the data is minimal (Protocol Labs) Your feedback. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest",
          "similarity_score": 0.6204
        }
      ]
    }
  },
  {
    "article_number": 13,
    "article_title": "Information to be provided where personal data are collected from the data subject",
    "matches": {
      "4.": [
        {
          "matched_policy_passage": "(Protocol Labs)Your feedback. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years.Browser testing and research (Nightly, Dev, and Beta versions only)Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the Browser. Device model, i. OS version, language, timezone, CPU architecture, carrier, connection status Optional: Crash log (crash logs will also be sent if you opted-in when activating i. OS) Optional: Comments and screenshots you share if you send feedback through Test. Flight.Our interest in testing the product and fixing problems The data are used in a way that does not negatively affect your rights or interests.Apple retains the data for one year",
          "similarity_score": 0.6292
        },
        {
          "matched_policy_passage": "Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To estimate the userâs physical location at the request of a website and with the confirmation of the user.IP address, and information about nearby Wi. Fi access points (MAC address, signal strength, and SSID).Legitimate interest.No storage Purpose of processing Categories of personal data processed Legal basis of processing To estimate the userâs physical location at the request of a website and with the confirmation of the user IP address, and information about nearby Wi. Fi access points (MAC address, signal strength, and SSID) Brave Rewards. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To make and verify Basic Attention Token contributions, (including to detect and prevent fraud).IP address at time of claiming a grant of BAT tokens or requesting confirmation tokens.Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Generally stored for 7 days",
          "similarity_score": 0.6287
        },
        {
          "matched_policy_passage": "Purpose of processing Categories of personal data processed Legal basis of processing To estimate the userâs physical location at the request of a website and with the confirmation of the user IP address, and information about nearby Wi. Fi access points (MAC address, signal strength, and SSID) Brave Rewards. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To make and verify Basic Attention Token contributions, (including to detect and prevent fraud).IP address at time of claiming a grant of BAT tokens or requesting confirmation tokens.Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards.Generally stored for 7 days In cases of suspected fraud, stored for up to 60 days",
          "similarity_score": 0.6619
        },
        {
          "matched_policy_passage": "Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards Compliance with legal obligations The duration of the userâs account, plus 4 years in order to comply with US Internal Revenue Service requirements Brave News. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To collect content from the server in order to display it for the user.IP addresses.Legitimate interest The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To collect content from the server in order to display it for the user.IP addresses.Legitimate interest",
          "similarity_score": 0.6973
        },
        {
          "matched_policy_passage": "The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To collect content from the server in order to display it for the user.IP addresses.Legitimate interest The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processing Categories of personal data processed Legal basis of processing To collect content from the server in order to display it for the user The data are used in order to deliver the service, and the risk of the processing of the data is minimal The duration of the request and response Brave Talk. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To facilitate communications via Brave Talk.IP address, meeting URL, chat content, audio and video, recordings of meetings.Legitimate interest",
          "similarity_score": 0.6108
        },
        {
          "matched_policy_passage": "Purpose of processing Categories of personal data processed Legal basis of processing To facilitate communications via Brave Talk IP address, meeting URL, chat content, audio and video, recordings of meetings The processing is necessary to provide the requested service Duration of the call, except for recordings of meetings that are temporarily stored for 24 hours",
          "similarity_score": 0.6487
        },
        {
          "matched_policy_passage": "(Protocol Labs) Purpose of processing Categories of personal data processed Legal basis of processing To allow access to IPFS content when the user cannot access it via a local IPFS node Legitimate interest The user requested the service, and the risk of the processing of the data is minimal (Protocol Labs) Your feedback. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years",
          "similarity_score": 0.6111
        },
        {
          "matched_policy_passage": "(Protocol Labs) Your feedback. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years",
          "similarity_score": 0.6022
        },
        {
          "matched_policy_passage": "Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years Purpose of processing Categories of personal data processed Legal basis of processing To use feedback sent by users to improve the product Personal data that a user may include in the text they write when sending feedback through an app store or any other means",
          "similarity_score": 0.6655
        },
        {
          "matched_policy_passage": "The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years Purpose of processing Categories of personal data processed Legal basis of processing To use feedback sent by users to improve the product Personal data that a user may include in the text they write when sending feedback through an app store or any other means The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal",
          "similarity_score": 0.6392
        }
      ],
      "8.": [
        {
          "matched_policy_passage": "Personal data that a user may include in the text they write when sending feedback through an app store or any other means The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal Browser testing and research (Nightly, Dev, and Beta versions only)Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the Browser. Device model, i. OS version, language, timezone, CPU architecture, carrier, connection status Optional: Crash log (crash logs will also be sent if you opted-in when activating i. OS) Optional: Comments and screenshots you share if you send feedback through Test. Flight.Our interest in testing the product and fixing problems",
          "similarity_score": 0.6128
        }
      ]
    }
  },
  {
    "article_number": 1,
    "article_title": "Subject-matter and objectives",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "We do not buy or sell personal data about consumers.Where we process personal data about you (subject to laws such as the EU General Data Protection Regulation (GDPR), or California privacylawssuch as the. CCPAor CPRA), you have the following rights:Right to be informed: You have the right to know what personal data we process about you and why, together with information about your rights We explain this via our product privacy policies and/or contextual privacy notices.Right of access: Where we process personal data about you, you have the right to request a copy of it.Right to delete: When certain grounds apply, you can ask us to delete personal data we are processing about you Please note, we have a separate global policy for Brave Search results and theright to be forgotten.Right to rectification: You can ask us to correct inaccurate personal data and/or to update incomplete data.Right to restriction: In certain circumstances, you can request that we refrain from processing your personal data.Right to object: In certain circumstances, you can object to the processing of your personal data (for example to object to the use of your data for profiling and/or purely automated decision making) Please note that we do not buy or sell personal data about consumers.Right to data portability: In certain circumstances you have the right to request and receive personal data in a structured, commonly used, machine readable format that makes it possible to reuse the data",
          "similarity_score": 0.611
        },
        {
          "matched_policy_passage": "Itâs Braveâs policy to not collect personal data1unless itâs necessary to provide services to our users, or to meet certain legal obligations We do not buy or sell personal data about consumers Where we process personal data about you (subject to laws such as the EU General Data Protection Regulation (GDPR), or California privacylawssuch as the. CCPAor CPRA), you have the following rights: Right to be informed: You have the right to know what personal data we process about you and why, together with information about your rights We explain this via our product privacy policies and/or contextual privacy notices",
          "similarity_score": 0.6515
        },
        {
          "matched_policy_passage": "We do not buy or sell personal data about consumers Where we process personal data about you (subject to laws such as the EU General Data Protection Regulation (GDPR), or California privacylawssuch as the. CCPAor CPRA), you have the following rights: Right to be informed: You have the right to know what personal data we process about you and why, together with information about your rights We explain this via our product privacy policies and/or contextual privacy notices Right of access: Where we process personal data about you, you have the right to request a copy of it",
          "similarity_score": 0.6294
        },
        {
          "matched_policy_passage": "Where we process personal data about you (subject to laws such as the EU General Data Protection Regulation (GDPR), or California privacylawssuch as the. CCPAor CPRA), you have the following rights: Right to be informed: You have the right to know what personal data we process about you and why, together with information about your rights We explain this via our product privacy policies and/or contextual privacy notices Right of access: Where we process personal data about you, you have the right to request a copy of it Right to delete: When certain grounds apply, you can ask us to delete personal data we are processing about you",
          "similarity_score": 0.607
        }
      ]
    }
  },
  {
    "article_number": 5,
    "article_title": "Principles relating to processing of personal data",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Please note, we have a separate global policy for Brave Search results and theright to be forgotten.Right to rectification: You can ask us to correct inaccurate personal data and/or to update incomplete data.Right to restriction: In certain circumstances, you can request that we refrain from processing your personal data.Right to object: In certain circumstances, you can object to the processing of your personal data (for example to object to the use of your data for profiling and/or purely automated decision making) Please note that we do not buy or sell personal data about consumers.Right to data portability: In certain circumstances you have the right to request and receive personal data in a structured, commonly used, machine readable format that makes it possible to reuse the data Please note, anonymous data is not subject to this right.Right to lodge a complaint with a regulatory authority: Brave is based in the USA The authority to lodge a complaint about Brave will depend on where you live",
          "similarity_score": 0.6446
        }
      ]
    }
  },
  {
    "article_number": 9,
    "article_title": "Processing of special categories of personal data",
    "matches": {
      "12.": [
        {
          "matched_policy_passage": "Purpose of processing Categories of personal data processed Legal basis of processing To make and verify Basic Attention Token contributions, (including to detect and prevent fraud) IP address at time of claiming a grant of BAT tokens or requesting confirmation tokens Necessary for the performance of acontract between usand necessary to provide the requested service.Processing for the purposes of fraud prevention is based on the legitimate interests of Brave and users of Brave Rewards Necessary for the performance of acontract between usand necessary to provide the requested service",
          "similarity_score": 0.6204
        }
      ]
    }
  },
  {
    "article_number": 6,
    "article_title": "Lawfulness of processing",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "The data are used in order to deliver the service, and the risk of the processing of the data is minimal.The duration of the request and response Purpose of processing Categories of personal data processed Legal basis of processing To collect content from the server in order to display it for the user The data are used in order to deliver the service, and the risk of the processing of the data is minimal The duration of the request and response Brave Talk. Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To facilitate communications via Brave Talk.IP address, meeting URL, chat content, audio and video, recordings of meetings.Legitimate interest The processing is necessary to provide the requested service.Duration of the call, except for recordings of meetings that are temporarily stored for 24 hours.To create a Brave Premium account and manage account access.Email address. Legitimate interest.The data is necessary to establish an account and manage account access.Until an account is deleted",
          "similarity_score": 0.6083
        }
      ],
      "1.": [
        {
          "matched_policy_passage": "Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To facilitate communications via Brave Talk.IP address, meeting URL, chat content, audio and video, recordings of meetings.Legitimate interest The processing is necessary to provide the requested service.Duration of the call, except for recordings of meetings that are temporarily stored for 24 hours.To create a Brave Premium account and manage account access.Email address. Legitimate interest.The data is necessary to establish an account and manage account access.Until an account is deleted Purpose of processing Categories of personal data processed Legal basis of processing To facilitate communications via Brave Talk IP address, meeting URL, chat content, audio and video, recordings of meetings",
          "similarity_score": 0.6347
        },
        {
          "matched_policy_passage": "The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To use feedback sent by users to improve the product.Personal data that a user may include in the text they write when sending feedback through an app store or any other means.Legitimate interest The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal.2 years Purpose of processing Categories of personal data processed Legal basis of processing To use feedback sent by users to improve the product",
          "similarity_score": 0.6164
        },
        {
          "matched_policy_passage": "Purpose of processing Categories of personal data processed Legal basis of processing To use feedback sent by users to improve the product Personal data that a user may include in the text they write when sending feedback through an app store or any other means The user intends for the data to be used for this purpose, and the risk of the processing of the data is minimal Browser testing and research (Nightly, Dev, and Beta versions only)Purpose of processing. Categories of personal data processed. Legal basis of processing. Duration of storage. To fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the Browser. Device model, i. OS version, language, timezone, CPU architecture, carrier, connection status",
          "similarity_score": 0.6566
        }
      ]
    }
  },
  {
    "article_number": 12,
    "article_title": "Transparent information, communication and modalities for the exercise of the rights of the data subject",
    "matches": {
      "3.": [
        {
          "matched_policy_passage": "The processing is necessary to provide the requested service Duration of the call, except for recordings of meetings that are temporarily stored for 24 hours To create a Brave Premium account and manage account access Legitimate interest.The data is necessary to establish an account and manage account access",
          "similarity_score": 0.6107
        }
      ]
    }
  },
  {
    "article_number": 35,
    "article_title": "Data protection impact assessment",
    "matches": {
      "15.": [
        {
          "matched_policy_passage": "Purpose of processing Categories of personal data processed Legal basis of processing To fix problems in the Brave Browser by acting on issues highlighted by crash reports from Beta and Dev versions of the Browser Device model, i. OS version, language, timezone, CPU architecture, carrier, connection status Optional: Crash log (crash logs will also be sent if you opted-in when activating i. OS) Optional: Comments and screenshots you share if you send feedback through Test. Flight Our interest in testing the product and fixing problems The data are used in a way that does not negatively affect your rights or interests",
          "similarity_score": 0.603
        }
      ]
    }
  },
  {
    "article_number": 15,
    "article_title": "Right of access by the data subject",
    "matches": {
      "6.": [
        {
          "matched_policy_passage": "Right of access: Where we process personal data about you, you have the right to request a copy of it Right to delete: When certain grounds apply, you can ask us to delete personal data we are processing about you Please note, we have a separate global policy for Brave Search results and theright to be forgotten Right to rectification: You can ask us to correct inaccurate personal data and/or to update incomplete data",
          "similarity_score": 0.6104
        },
        {
          "matched_policy_passage": "Please note, we have a separate global policy for Brave Search results and theright to be forgotten Right to rectification: You can ask us to correct inaccurate personal data and/or to update incomplete data Right to restriction: In certain circumstances, you can request that we refrain from processing your personal data Right to object: In certain circumstances, you can object to the processing of your personal data (for example to object to the use of your data for profiling and/or purely automated decision making)",
          "similarity_score": 0.6139
        },
        {
          "matched_policy_passage": "Right to rectification: You can ask us to correct inaccurate personal data and/or to update incomplete data Right to restriction: In certain circumstances, you can request that we refrain from processing your personal data Right to object: In certain circumstances, you can object to the processing of your personal data (for example to object to the use of your data for profiling and/or purely automated decision making) Please note that we do not buy or sell personal data about consumers",
          "similarity_score": 0.6734
        }
      ]
    }
  },
  {
    "article_number": 18,
    "article_title": "Right to restriction of processing",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "Right to restriction: In certain circumstances, you can request that we refrain from processing your personal data Right to object: In certain circumstances, you can object to the processing of your personal data (for example to object to the use of your data for profiling and/or purely automated decision making) Please note that we do not buy or sell personal data about consumers Right to data portability: In certain circumstances you have the right to request and receive personal data in a structured, commonly used, machine readable format that makes it possible to reuse the data",
          "similarity_score": 0.6912
        }
      ]
    }
  },
  {
    "article_number": 21,
    "article_title": "Right to object",
    "matches": {
      "2.": [
        {
          "matched_policy_passage": "Right to object: In certain circumstances, you can object to the processing of your personal data (for example to object to the use of your data for profiling and/or purely automated decision making) Please note that we do not buy or sell personal data about consumers Right to data portability: In certain circumstances you have the right to request and receive personal data in a structured, commonly used, machine readable format that makes it possible to reuse the data Please note, anonymous data is not subject to this right",
          "similarity_score": 0.7033
        }
      ]
    }
  },
  {
    "article_number": 4,
    "article_title": "Definitions",
    "matches": {
      "1.": [
        {
          "matched_policy_passage": "We hope youâll find any changes agreeable, but if youâre not comfortable with changes to the info we collect or how we use it, we understand your choice to stop using Brave.Â Personal data means any information that relates to an identified or identifiable living individual In the USA, this is often referred to as Personal Information (PI) or Personally Identifiable Information (PII) These terms are equivalent but not identical.This can include information that can directly identify an individualâsuch as name or email addressâand any other information that may make a person indirectly identifiableâsuch as online identifiers that could be combined with other data to identify an individual, or used on their own to single out individuals and distinguish one person from another with an intent to learn something about them or to take an action towards them Personal data means any information that relates to an identified or identifiable living individual",
          "similarity_score": 0.7226
        },
        {
          "matched_policy_passage": "Personal data means any information that relates to an identified or identifiable living individual In the USA, this is often referred to as Personal Information (PI) or Personally Identifiable Information (PII) These terms are equivalent but not identical.This can include information that can directly identify an individualâsuch as name or email addressâand any other information that may make a person indirectly identifiableâsuch as online identifiers that could be combined with other data to identify an individual, or used on their own to single out individuals and distinguish one person from another with an intent to learn something about them or to take an action towards them Personal data means any information that relates to an identified or identifiable living individual",
          "similarity_score": 0.8174
        },
        {
          "matched_policy_passage": "Personal data means any information that relates to an identified or identifiable living individual In the USA, this is often referred to as Personal Information (PI) or Personally Identifiable Information (PII) These terms are equivalent but not identical This can include information that can directly identify an individualâsuch as name or email addressâand any other information that may make a person indirectly identifiableâsuch as online identifiers that could be combined with other data to identify an individual, or used on their own to single out individuals and distinguish one person from another with an intent to learn something about them or to take an action towards them",
          "similarity_score": 0.8158
        }
      ]
    }
  }
]